{"name": "Melissa Leo", "current role": "Georgia Hale", "birth name": "Melissa Chessington Leo", "birth date": "1960-09-14", "birth place": "New York City, New York, USA", "height": "5' 4\" (1.63 m)", "biography": "Melissa Leo is an American actress. She is known for her Academy Award-winning performance in the 2010 film The Fighter (2010). She was born on September 14, 1960, in New York City. Leo starred as the mother of boxer Micky Ward in the 2010 film The Fighter, also starring Mark Wahlberg. The role garnered her both Golden Globe (Best Supporting Actress) and Oscar awards. Other accolades include award nominations for the film Frozen River (2008) and the HBO series Mildred Pierce.::Drew Stern", "trade mark": " ", "trivia": ["Attended the State University of New York, Purchase (SUNY Purchase). Other alumni include actors Parker Posey, Wesley Snipes, Stanley Tucci, Sherry Stringfield, Adam Trese, Edie Falco, Seth Gilliam, Dwight Ewell, and Steven Weber; producers Bob Gosse and Todd Baker; and directors Danny Leiner, Nick Gomez, and Hal Hartley.", "In March 1997, ex-boyfriend John Heard was charged with harassing Melissa via telephone misuse and trespassing.", "Beat Julia Roberts for the role of Linda Warner on the soap opera All My Children (1970).", "Melissa studied at State University of New York, Purchase but did not graduate.", "Mother is Peggy Chessington Leo, a Californian teacher, and father, Arnold Leo, is an editor at Grove Press, and a fisherman spokesman for the East Hampton Baymen's Association.", "Was the runner-up for the 2004 Los Angeles Film Critics Association Award for Best Supporting Actress for her performance in 21 Grams (2003).", "Won the 2008 Utah Film Critics Association Award for Best Lead Performance by an Actress for her work in Frozen River (2008).", "Has worked with Kristen Stewart twice. Once in The Cake Eaters (2007) and again in Welcome to the Rileys (2010).", "According to Rob Lowe's biography, \"Stories I Only Tell My Friends\", he screen-tested with Melissa, who was in serious contention for the part of \"Debbie\" in About Last Night (1986). However, the part eventually went to Demi Moore.", "She is a natural redhead.", "Despite appearing and being billed in early trailers for Lee Daniels's Lee Daniels' The Butler (2013) as Mamie Eisenhower, her part ultimately was cut from the film.", "Ulster County, New York [July 2008]", "Was the 137th actress to receive an Academy Award; she won the Best Supporting Actress Oscar for The Fighter (2010) at The 83rd Annual Academy Awards (2011) on February 27, 2011.", "She has German, English, and distant Scottish, ancestry. Her surname is German and originates with a German immigrant, Gustave Leo.", "Member of the jury at the Sarajevo Film Festival in 2014.", "Was 26 when she welcomed her first child - son John Matthew \"Jack\" Heard III - on June 17, 1987. Jack's father was John Heard.", "She won an Oscar for playing Alice Eklund-Ward in The Fighter (2010), making her one of 17 actors to win the Award for playing a real person who was still alive at the evening of the Award ceremony (as of 2015). The other sixteen actors and their respective performances are: Spencer Tracy for playing Father Edward Flanagan in Boys Town (1938), Gary Cooper for playing Alvin C. York in Sergeant York (1941), Patty Duke for playing Helen Keller in The Miracle Worker (1962), Jason Robards for playing Ben Bradlee in All the President's Men (1976), Robert De Niro for playing Jake La Motta in Raging Bull (1980), Sissy Spacek for playing Loretta Lynn in Coal Miner's Daughter (1980), Jeremy Irons for playing Claus Von Bullow in _Reversal of Fortune (1990), Susan Sarandon for playing Sister Helen Prejean in Dead Man Walking (1995), Geoffrey Rush for playing David Helfgott in Shine (1996), Julia Roberts for playing Erin Brockovich in Erin Brockovich (2000), Jim Broadbent for playing John Bayley in Iris (2001), Helen Mirren for playing Queen Elizabeth II in The Queen (2006), Sandra Bullock for playing Leigh Anne Tuohy in The Blind Side (2009), Christian Bale for playing Dickie Eklund in The Fighter (2010), Meryl Streep for playing Margaret Thatcher in The Iron Lady (2011) and Eddie Redmayne for playing Stephen Hawking in The Theory of Everything (2014).", "Is one of 22 Oscar-winning actresses to have been born in the state of New York. The others are Alice Brady, Teresa Wright, Anne Revere, Celeste Holm, Claire Trevor, Judy Holliday, Shirley Booth, Susan Hayward, Patty Duke, Anne Bancroft, Barbra Streisand, Jane Fonda, Lee Grant, Beatrice Straight, Whoopi Goldberg, Mercedes Ruehl, Marisa Tomei, Mira Sorvino, Susan Sarandon, Jennifer Connelly and Anne Hathaway.", "Is one of 3 actresses who have won both the Best Supporting Actress Oscar (hers being for The Fighter (2010)) and the Outstanding Guest Actress in a Comedy Series Emmy (hers being for Louie (2010)). The other actresses are Cloris Leachman and Eileen Heckart.", "According to Rob Lowe's biography, \"Stories I Only Tell My Friends\", he screen tested with Melissa who was in serious contention for the part of \"Debbie\" in \"About Last Night\" (1986). However, the part eventually went to Demi Moore."], "filmography": ["Always on My Mind ()", "Blood Relative ()", "Shelter ()", "Coast ()", "Measure of Revenge ()", "Ida Red", "Thunder Force", "Body Brokers", "I Know This Much Is True", "Dolly Parton's Heartstrings", "The Equalizer 2", "I'm Dying Up Here (2017-2018)", "The Parting Glass", "Furlough", "Unlovable", "The Ashram", "The View from Up Here", "The Most Hated Woman in America", "Novitiate", "BoJack Horseman (2014-2016)", "Snowden", "Wayward Pines (2015-2016)", "All the Way", "Burn Country", "London Has Fallen", "Broad City", "Damnation: The Flashback", "LFE", "The Big Short", "The Butterfly, the Harp and the Timepiece", "Mother's Day", "Dwegons and Leprechauns", "The Equalizer", "The Ever After", "The Angriest Man in Brooklyn", "Treme (2010-2013)", "Prisoners", "Call Me Crazy", "Bottled Up", "Oblivion", "Olympus Has Fallen", "Charlie Countryman", "Flight", "Persephone", "Louie", "Francine", "Why Stop Now?", "Lost Revolution", "Brooklyn Brothers Beat the Best", "Seven Days in Utopia", "The Sea Is All I Know", "Mildred Pierce", "Red State", "The Fighter", "Queen of the Lot", "Conviction", "The Space Between", "The Dry Land", "Welcome to the Rileys", "The Farm", "According to Greta", "Everybody's Fine", "Dear Lemon Lima", "Veronika Decides to Die", "Don McKay", "True Adolescents", "Stephanie's Image", "The Alphabet Killer", "Predisposed", "Righteous Kill", "This Is a Story About Ted and Alice", "Law & Order (1993-2008)", "Ball Don't Lie", "Santa Mesa", "Lullaby", "Frozen River", "One Night", "Cold Case", "Mr. Woodcock", "I Believe in America", "Racing Daylight", "The Cake Eaters", "Dear Lemon Lima", "Black Irish", "Midnight Son", "Bomb", "Criminal Minds", "Shark", "Falling Objects", "The House Is Burning", "Hollywood Dreams", "The Limbo Room", "Stephanie Daley", "Confess", "American Gun", "Three Burials", "The L Word", "Patch", "No Shoulder", "Runaway", "Law & Order: Criminal Intent", "Hide and Seek", "From Other Worlds", "CSI: Crime Scene Investigation", "Veronica Mars", "First Breath", "21 Grams", "Fear of Fiction", "Homicide: The Movie", "The 24 Hour Woman", "Code of Ethics", "Legacy", "Homicide: Life on the Street (1993-1997)", "Under the Bridge", "In the Line of Duty: Hunt for Justice", "Last Summer in the Hamptons", "Garden", "Scarlett", "The Ballad of Little Jo", "Venice/Venice", "Immaculate Conception", "Carolina Skeletons", "The Bride in Black", "Against the Law", "The Young Riders (1989-1990)", "Nasty Boys", "Nasty Boys", "Gideon Oliver", "Miami Vice", "All My Children (1984-1988)", "A Time of Destiny", "Spenser: For Hire", "Ladykiller", "Deadtime Stories", "Silent Witness", "The Equalizer", "Always", "Streetwalkin'", "I'm Only There..."]}