{"name": "Marisa Tomei", "current role": "Cynthia Baum", "birth name": " ", "birth date": "1964-12-04", "birth place": "Brooklyn, New York City, New York, USA", "height": "5' 3½\" (1.61 m)", "biography": "Marisa Tomei was born on December 4, 1964, in Brooklyn, New York, to Patricia \"Addie\" (Bianchi), a teacher of English, and Gary Tomei, a lawyer, both of Italian descent. Marisa has a brother, actor Adam Tomei. As a child, Marisa's mother frequently corrected her speech as to eliminate her heavy Brooklyn accent. As a teen, Marisa attended Edward R. Murrow High School and graduated in the class of 1982. She was one year into her college education at Boston University when she dropped out for a co-starring role on the CBS daytime drama As the World Turns (1956). Her role on that show paved the way for her entrance into film: in 1984, she made her film debut with a bit part in The Flamingo Kid (1984). Three years later, Marisa became known for her role as Maggie Lawton, Lisa Bonet's college roommate, on the sitcom A Different World (1987).Her real breakthrough came in 1992, when she co-starred as Joe Pesci's hilariously foul-mouthed, scene-stealing girlfriend in My Cousin Vinny (1992), a performance that won her a Best Supporting Actress Oscar. Later that year, she turned up briefly as a snippy Mabel Normand in director Richard Attenborough's biopic Chaplin (1992), and was soon given her first starring role in Untamed Heart (1993). A subsequent starring role -- and attempted makeover into Audrey Hepburn -- in the romantic comedy Only You (1994) proved only moderately successful.Marisa's other 1994 role as Michael Keaton's hugely pregnant wife in The Paper (1994) was well-received, although the film as a whole was not. Fortunately for Tomei, she was able to rebound the following year with a solid performance as a troubled single mother in Nick Cassavetes' Unhook the Stars (1996) which earned her a Screen Actors Guild nomination for Best Supporting Actress. She turned in a similarly strong work in Welcome to Sarajevo (1997), and in 1998 did some of her best work in years as the sexually liberated, unhinged cousin of Natasha Lyonne's Vivian Abramowitz in Tamara Jenkins' Slums of Beverly Hills (1998). Marisa co-starred with Mel Gibson in the hugely successful romantic comedy What Women Want (2000) and during the 2002 movie award season, she proved her first Best Supporting Actress Oscar win was no fluke when she received her second nomination in the same category for the critically acclaimed dark drama, In the Bedroom (2001). She also made a guest appearance on the animated TV phenomenon The Simpsons (1989) as Sara Sloane, a movie star who falls in love with Ned Flanders. In 2006, she went on to do 4 episodes for Rescue Me (2004). She played Angie, the ex-wife of Tommy Calvin (Denis Leary)'s brother Johnny (Dean Winters). At age 42, Marisa took on a provocative role in legendary filmmaker Sidney Lumet's melodramatic picture Before the Devil Knows You're Dead (2007), in which she appeared nude in love scenes with costars Ethan Hawke and Philip Seymour Hoffman. Marisa then took on another provocative role as a stripper in the highly acclaimed film The Wrestler (2008) opposite Mickey Rourke. Her great performance earned her many awards from numerous film societies for Best Supporting Actress, a third Academy Award nomination, as well as nominations for a Golden Globe and a BAFTA. Many critics heralded this performance as a standout in her career.::A fan of Marisa Tomei", "trade mark": "Usually plays characters that are, or have been, in damaged relationships and/or have emotionally damaged lives.", "trivia": ["Listed as one of twelve \"Promising New Actors of 1991\" in John Willis' Screen World, Vol. 43.", "Attended Boston University.", "Attended Edward R. Murrow High School in Brooklyn, New York. Her brother, Adam Tomei, and Darren Aronofsky also attended this high school.", "Older sister of actor Adam Tomei.", "Has a tattoo of the Egyptian Eye of Ra (protection, good luck abundance) on her right foot.", "In 2003, she played the title role in a revival of Oscar Wilde's \"Salome\" in an Actors Studio production, directed by Estelle Parsons, on Broadway at the Ethel Barrymore Theatre; co-stars included Al Pacino, Dianne Wiest, and David Strathairn.", "She is of Italian descent. Her family is from Tuscany, Sicily, Campania, and Calabria.", "Before the 1993 Oscar ceremony, she told Entertainment Tonight (1981) that her biggest fear was that she would trip on the steps on her way to the stage. She did.", "Revealed to Jon Stewart on The Daily Show (1996) that she sometimes travels under an Italian passport. (Oct 2004)", "No relation to Concetta Tomei.", "Holds dual United States and Italian citizenship.", "Her mother was an English teacher at Cavallaro Junior High School in Brooklyn, New York.", "Auditioned for the role of \"Dorothy Boyd\" in Jerry Maguire (1996).", "In the early 1990s, she had a relationship with Robert Downey Jr. (her co-star in Chaplin (1992) and Only You (1994)). In 1999, she was with actor Dana Ashbrook and had a relationship with Frank Pugliese. She (as of 2009) now dates actor Logan Marshall-Green, who is twelve years her junior.", "Until Captain America: Civil War (2016), she had never starred in a sequel or a prequel to a film.", "One of People Magazine's Most Beautiful People 2009.", "Godmother of Zoë Kravitz, daughter of Marisa's A Different World (1987) co-star Lisa Bonet.", "Turned down the female lead in Four Weddings and a Funeral (1994) which went to Andie MacDowell.", "While portraying roommates on A Different World (1987), she and co-star Lisa Bonet were roommates in real life.", "Announced in 7 February 2005 edition of New York Times, she has signed to join the cast of Neil LaBute's \"This Is How It Goes\" at New York's Public Theatre, beginning previews, March 8, 2005, co-starring Ben Stiller. [February 2005]", "Joins Indian and Pakistani actresses in performances of The Vagina Monologues on a Bombay stage to mark International Women's Day. [March 2004]", "Was the 104th actress to receive an Academy Award; she won the Best Supporting Actress Oscar for My Cousin Vinny (1992) at The 65th Annual Academy Awards (1993) on March 29, 1993.", "Is one of 25 actresses who have received an Academy Award for their performance in a comedy; hers being for My Cousin Vinny (1992). The others in chronological order, are: Claudette Colbert (It Happened One Night (1934)), Loretta Young (The Farmer's Daughter (1947)), Josephine Hull (Harvey (1950)), Judy Holliday (Born Yesterday (1950)), Audrey Hepburn (Roman Holiday (1953)), Goldie Hawn (Cactus Flower (1969)), Glenda Jackson (A Touch of Class (1973)), Lee Grant (Shampoo (1975)), Diane Keaton (Annie Hall (1977)), Maggie Smith (California Suite (1978)), Mary Steenburgen (Melvin and Howard (1980)), Jessica Lange (Tootsie (1982)), Olympia Dukakis (Moonstruck (1987)), Cher (Moonstruck (1987)), Jessica Tandy (Driving Miss Daisy (1989)), Mercedes Ruehl (The Fisher King (1991)), Dianne Wiest (Bullets Over Broadway (1994)), Mira Sorvino (Mighty Aphrodite (1995)), Frances McDormand (Fargo (1996)), Helen Hunt (As Good as It Gets (1997)), Judi Dench (Shakespeare in Love (1998)), Gwyneth Paltrow (Shakespeare in Love (1998)), Penélope Cruz (Vicky Cristina Barcelona (2008)), and Jennifer Lawrence (Silver Linings Playbook (2012)).", "Is one of 22 Oscar-winning actresses to have been born in the state of New York. The others are Alice Brady, Teresa Wright, Anne Revere, Celeste Holm, Claire Trevor, Judy Holliday, Shirley Booth, Susan Hayward, Patty Duke, Anne Bancroft, Barbra Streisand, Jane Fonda, Lee Grant, Beatrice Straight, Whoopi Goldberg, Mercedes Ruehl, Mira Sorvino, Susan Sarandon, Jennifer Connelly, Melissa Leo and Anne Hathaway.", "Born on the same day as Chelsea Noble.", "After her Oscar win for \"My Cousin Vinny\", Tomei was targeted by a bizarre conspiracy theory, pushed mostly by film critic Rex Reed. Reed said that Tomei hadn't actually won the Oscar, and alternately stated that presenter Jack Palance had read the wrong name off the Oscar broadcast TelePrompter or gotten confused when reading the card listing the Best Supporting Actress winner and said Tomei's name, instead of that of Vanessa Redgrave or Emma Thompson, because it fell last alphabetically. However, the show's producers and Price Waterhouse Cooper vote counters said that, if anything, Reed or other anti-Tomei critics noted happened, a PWC representative had orders to go on stage and state both that a mistake had happened and then announce the actual winner. When this situation really occurred at the 2016 Oscars because La La Land (2016) was mistakenly announced as Best Picture winner because Warren Beatty was given the wrong information (it was a copy of Emma Stone's winning card for Best Actress), PWC handled this situation exactly as they had described by bringing out the winning card for Moonlight (2016). This fully debunked Red Reed's conspiracy theory one final indisputable time.", "Both she and her Before the Devil Knows You're Dead (2007) co-star Rosemary Harris have played May Parker, the aunt of Peter Parker / Spider-Man, in films based on Marvel Comics: Harris in Spider-Man (2002), Spider-Man 2 (2004) and Spider-Man 3 (2007) and Tomei in Captain America: Civil War (2016) and Spider-Man: Homecoming (2017).", "Was offered the role of Trinity in The Matrix (1999) but turned down the role.", "She is a lifelong Democrat."], "filmography": ["Untitled Spider-Man Sequel", "Delia's Gone ()", "Sweet Girl", "Sarah Cooper: Everything's Fine", "The King of Staten Island", "Human Capital", "Spider-Man: Far from Home", "Live in Front of a Studio Audience: Norman Lear's 'All in the Family' and 'The Jeffersons'", "Frankie", "Avengers: Endgame", "The Cold Open", "I Hate Kids", "Dark Was the Night", "The First Purge", "The Handmaid's Tale", "After Everything", "Laboratory Conditions", "Spider-Man: Homecoming", "Captain America: Civil War", "Empire", "The Big Short", "Love the Coopers", "Trainwreck", "Spare Parts", "The Rewrite", "Loitering with Intent", "Love Is Strange", "She Said, She Said", "Parental Guidance", "Inescapable", "The Ides of March", "Crazy, Stupid, Love.", "The Lincoln Lawyer", "Salvation Boulevard", "Cyrus", "Amsterdam", "The Wrestler", "War, Inc.", "The Rich Inner Life of Penelope Cloud", "Before the Devil Knows You're Dead", "Wild Hogs", "Grace Is Gone", "Rescue Me", "Danika", "Factotum", "Loverboy", "Marilyn Hotchkiss' Ballroom Dancing & Charm School", "Alfie", "Game Over", "Anger Management", "The Simpsons", "The Wild Thornberrys", "The Guru", "Just a Kiss", "Jenifer", "Someone Like You", "In the Bedroom", "Dirk and Betty", "What Women Want", "King of the Jungle", "The Watcher", "Happy Accidents", "My Own Country", "Slums of Beverly Hills", "Only Love", "Since You've Been Gone", "Welcome to Sarajevo", "A Brother's Kiss", "Unhook the Stars", "Seinfeld", "Four Rooms", "The Perez Family", "Only You", "The Paper", "Untamed Heart", "Chaplin", "Equinox", "My Cousin Vinny", "Zandalee", "Oscar", "Parker Kane", "A Different World (1987-1988)", "Leg Work", "ABC Afterschool Specials", "Playing for Keeps", "As the World Turns (1984-1985)", "The Flamingo Kid", "The Toxic Avenger"]}