{"name": "Ron Perlman", "current role": "Nino", "birth name": "Ronald Francis Perlman", "birth date": "1950-04-13", "birth place": "New York City, New York, USA", "height": "5' 11\" (1.8 m)", "biography": "Ron Perlman is a classically-trained actor who has appeared in countless stage plays, feature films and television productions.Ronald N. Perlman was born April 13, 1950 in Washington Heights, Manhattan, New York. His mother, Dorothy (Rosen), is retired from the City Clerk's Office. His father, Bertram \"Bert\" Perlman, now deceased, was a repairman and a drummer. His parents were both from Jewish families (from Hungary, Germany and Poland).With a career spanning over three decades, Perlman has worked alongside such diverse actors as Marlon Brando, Sean Connery, Dominique Pinon, Brad Dourif, Ed Harris, John Hurt, Jude Law, Christina Ricci, Federico Luppi, Sigourney Weaver, Michael Wincott and Elijah Wood to name a few.While he has never been a bankable star, Perlman has always had a large fan-base. He started out strong as Amoukar, one of the tribesmen in Jean-Jacques Annaud's Academy Award-winning film Quest for Fire (1981), for which he earned a Genie Award nomination. Perlman teamed up with Annaud again, this time as a hunchback named Salvatore in The Name of the Rose (1986). His first real breakthrough came later when he landed the role of the noble lion-man Vincent, opposite Linda Hamilton on the fantasy series Beauty and the Beast (1987). His work in this role earned him not only a Golden Globe Award but an underground fan following. Sadly the series was canceled in its third season shortly after Hamilton's character's death.After that, he spent time doing supporting work on television and independent films such as Guillermo del Toro's debut Cronos (1993) (where a lifelong friendship and collaboration between the director and Perlman would blossom) as Angel and his first lead role as One in Jean-Pierre Jeunet's surreal The City of Lost Children (1995). His first real big role in a mainstream film came when Jeunet wanted him for the brutish Johner in his first Hollywood outing Alien: Resurrection (1997). Perlman has also used his distinctive voice to his advantage, appearing in many animated films/series, commercials and he is a video game fan favorite because of his work on such games as the Fallout series.It was not until much later he received worldwide fame when his good friend Guillermo del Toro helped him land the title role in the big-budget comic book movie Hellboy (2004). Del Toro fought the studio for four years because they wanted a more secure name, but he stood his ground and in 2004, after almost 25 years in and out of obscurity, Perlman became a household name and a sought out actor. Perlman has had one of the most offbeat careers in film, playing everything from a prehistoric ape-man to an aging transsexual and will always be a rarity in Hollywood.Other notable roles include the cunning Norman Arbuthnot in The Last Supper (1995), sniper expert Koulikov in Enemy at the Gates (2001), vampire leader Reinhardt in Blade II (2002), his reprisal of Hellboy in Hellboy II: The Golden Army (2008) and biker chief Clarence Morrow on the popular series Sons of Anarchy (2008).He currently resides in Los Angeles, California with his wife, Opal, and their two children, Blake and Brandon.::Pedro Borges", "trade mark": "Deep rolling voice", "trivia": ["Has two children with his wife Opal Perlman: Blake Perlman (born January 7, 1984) and Brandon Avery Perlman (born March 29, 1990).", "He is left-handed but was forced to use his right as a child, therefore he is relatively comfortable using his right hand.", "Attended and graduated from George Washington High School in New York City.", "Took Graduate training in acting at the University of Minnesota from fall 1971 to spring 1973. On July 20, 1973, he graduated with his then new degree of Master of Fine Arts.", "Attended Lehman College in New York City where he received his Bachelor's degree in Fine Arts for Theatre.", "His wife, Opal Perlman, was a fashion designer but currently works as a jewelry designer.", "Upon meeting to discuss Hellboy (2004), creator Mike Mignola and director Guillermo del Toro decided to reveal to each other their choice for the lead role. They both said at the same time Ron Perlman. Revolutions studio wanted a bigger name like Vin Diesel to play the title role, but del Toro fought for Perlman to get the role and he did in the end.", "Does not speak French and was the only American on set of the French film The City of Lost Children (1995). Regardless, he learned all of his lines and delivered them flawlessly.", "His favorite movie is the comedy-drama film Nobody's Fool (1994).", "Is a huge fan of the New York Yankees.", "Broke a rib while filming the subway scenes in Hellboy (2004). He jumped onto a train that was coming towards him.", "To prepare for his role in Hellboy (2004), he read all the Hellboy comics and worked out three hours a day, five to seven days a week. He also worked out while shooting. Every day, he had off from filming he would work out.", "Is the godfather to Nicholas Kadi's daughter.", "Was ranked in Star magazine's Reader's Poll - Best Dramatic Actor as Vincent in Beauty and the Beast (1987).", "Was ranked in US magazine's \"20 Who Turned Us On\" list on December 26, 1988.", "Was ranked in US magazine's First Annual Reader's Poll - Third runner-up for Best Dramatic Actor as Vincent in Beauty and the Beast (1987) [1988].", "His favorite episode of Beauty and the Beast (1987) is \"A Happy Life\".", "Was friends with Sammy Davis Jr.. They met at the Golden Globe Awards in the late 1980s, apparently Davis was a huge fan of Beauty and the Beast (1987) and had seen every single episode.", "Voiced the mutant villain Clayface on Batman: The Animated Series (1992), a character who, ironically, was a disfigured actor, then voiced the villain Slade on Teen Titans (2003), and also did the voice of the Hulk/Bruce Banner twice on two separate series, one for a guest spot on Fantastic Four: The Animated Series (1994) and one for a guest spot on Iron Man (1994), in addition to providing the voice of Orion for Justice League (2001). He then played the comic book character Hellboy in Hellboy (2004). He went on to portray Batman in Justice League Heroes (2006).", "Has a dog (terrier) named Nigel.", "His hobbies include golf, jazz and pool.", "With the creation of Hellboy II: The Golden Army (2008), at age 58, he became the oldest actor ever to play a main superhero.", "Frequent voice collaborator with fellow voice actor Keith David in these computer games: Fallout: A Post-Nuclear Role-Playing Game (1997), Lords of EverQuest (2003), Halo 2 (2004), Halo 3 (2007). Animated series: Aladdin (1994), Fantastic Four: The Animated Series (1994), Justice League (2001), Teen Titans (2003). In addition, they have both had a guest appearance on the television series The Outer Limits (1995).", "Good friends with Beauty and the Beast (1987) co-star Linda Hamilton. They reunited in the theatre play \"Lover Letters\" (1991), and in the post-Vietnam War drama Missing in America (2005).", "Was presented with the Acting Award of Excellence at the Big Bear Lake International Film Festival on September 18, 2004.", "Worked on the Acadamy Award winning short film Two Soldiers (2003) for free as a favor to writer/director Aaron Schneider.", "Was offered promotional advertisements as Vincent, his character from the television series Beauty and the Beast (1987), but he refused stating that the character was not there to be exploited.", "Is well known for his extensive body of work with acting under prosthetic and has given many actors, like Armin Shimerman (Star Trek: Deep Space Nine (1993)) and Michael Chiklis (Fantastic Four (2005)), advice on how to emote effectively under full-head prosthetic appliances.", "Said in his audio commentary for The City of Lost Children (1995), that of all the things his characters have done in films, his most hated action was when his character, One, attacked Miette under the influence of the evil Octopus Sisters' drug.", "His characters are frequently seen smoking cigars (The Last Supper (1995), Happy, Texas (1999), Price of Glory (2000), Night Class (2001), Hellboy (2004), etc.). Perlman is an avid cigar smoker in real life.", "Early in his career, he tried doing stand-up comedy.", "Producers Lawrence Gordon and Lloyd Levin tried hard for Perlman to get cast as Edward Blake aka The Comedian in Watchmen (2009).", "He was offered the role of Piccolo in Dragonball Evolution (2009), which he turned down to work on Hellboy II: The Golden Army (2008) instead.", "He was considered for the role of Uncle Dave in the action comedy Postal (2007), which went to Dave Foley.", "Wrote a screenplay some years ago entitled \"Wooden Lake\" which he was also going to direct but, as of 2011, that has not gone into production.", "He was going to play the role of Beorn in The Hobbit films when Guillermo del Toro was at the helm, but as pre-production was prolonged again and again, del Toro left and so did Perlman.", "He was considered for the role of Adam Pierson / Methos on Highlander (1992), which went to Peter Wingfield. He later guest starred in the episode \"The Messenger\" as the title role, an Immortal who pretends to be Methos.", "In 2012, Perlman once again endured the 4-hour makeup routine required to transform him into Hellboy -- not for a sequel or other acting job but to fulfill the Make-A-Wish request of a six-year-old boy named Zachary who has leukemia. Creature effects house Spectral Motion applied Perlman's Hellboy makeup (and later also made up Zachary as Hellboy as well), and then Zachary got to spend the day hanging out with \"Hellboy\".", "Has acted on stage for seven years before making his film debut in Quest for Fire (1981). This could not have included a stage version of \"A Few Good Men\" (in the role later made famous by Jack Nicholson) before 1989, when that play was written.", "Has played the same character (Matt Hagen / Clayface) on three different series: Batman: The Animated Series (1992), The New Batman Adventures (1997) and Justice League (2001).", "Has played a role in the live-action film Prince Valiant (1997) as well as making several guest appearances in the animated version The Legend of Prince Valiant (1991).", "Attended the A Diamond is Forever - Cinema Against Aids 2001 gala at the Moulin de Mougins restaurant, to benefit the American Foundation for AIDS Research. [May 2001]", "Was a Guest of Honor at the multi-genre DreamCon in Jacksonville, Florida. [June 2004]", "Currently resides in Los Angeles, California but also keeps a home in New York City.", "Bears such a striking resemblance to singer and actor Tom Waits, that once, Waits was credited as Perlman on a movie poster.", "Has worked with Alice Krige in the horror film Sleepwalkers (1992). Both stars appeared in the very popular Star Trek series. Krige appeared in Star Trek: First Contact (1996) and Perlman appeared in Star Trek: Nemesis (2002).", "Has appeared in two sci-fi films that took place in the year 2379: Alien: Resurrection (1997) and Star Trek: Nemesis (2002).", "Born on the same date as William Sadler (they have appeared together in the stage play \"The Resistable Rise of Artoru Ui\").", "Began his own film production company called \"Wing and a Prayer\" (2010).", "Has volunteered as an actor with the Young Storytellers Program.", "Parents are Bertram \"Bert\" and Dorothy (Rosen) Perlman.", "Comes from a Jewish family (from Germany, Hungary and Poland)."], "filmography": ["The Jesuit ()", "Scream Before You Die", "Saurus City ()", "Don't Look Up", "Heroes of the Golden Masks", "Pinocchio", "How I Got There ()", "Robodog ()", "The Caddy ()", "The Last Victim ()", "This Game's Called Murder ()", "Nightmare Alley", "NYX", "Monster Hunter", "A Place Among the Dead", "American Dad! (2011-2020)", "The Big Ugly", "Reno 911!", "Clover", "Havana Kyrie", "Hell on the Border", "Reprisal", "Go Fish", "Rapunzel's Tangled Adventure (2017-2019)", "The Capture", "Run with the Hunted", "Final Space (2018-2019)", "Splitting Up Together", "The Great War", "Fallout 76", "StartUp (2017-2018)", "The Truth About the Harry Quebert Affair", "Asher", "Transformers: Power of the Primes", "The Steam Engines of Oz", "The Escape of Prisoner 614", "Trollhunters: Tales of Arcadia (2016-2017)", "Jay-Z: Legacy", "Pottersville", "Howard Lovecraft & the Undersea Kingdom", "Sergio and Sergei", "Adventure Time (2011-2017)", "Hand of God (2014-2017)", "Fantastic Beasts and Where to Find Them", "Chuck", "Howard Lovecraft and the Frozen Kingdom", "Maron", "Teenage Mutant Ninja Turtles (2015-2016)", "SuperMansion", "Fallout 4", "Call of Duty: Black Ops III", "Lego Dimensions", "Stonewall", "Moonwalkers", "The Blacklist", "Poker Night", "Skin Trade", "Book of Life: Sugar Smash", "The Book of Life", "Desiree", "Elwood", "Family Guy: The Quest for Stuff", "Kid Cannabis", "Before I Disappear", "13 Sins", "Tbilisi, I Love You", "The Virginian", "Archer (2010-2014)", "Sons of Anarchy (2008-2013)", "Teen Titans Go!", "Payday 2", "Percy Jackson: Sea of Monsters", "Justice League: The Flashpoint Paradox", "Pacific Rim", "Peter Panzerfaust", "Green Lantern: The Animated Series", "New Teen Titans", "Crave", "The Punisher: Dirty Laundry", "Bad Ass", "3, 2, 1... Frankie Go Boom", "The Scorpion King 3: Battle for Redemption", "The Littlest Angel", "Pretend Time", "Conan the Barbarian", "Drive", "Season of the Witch", "Killer by Nature", "Tangled", "Disney Tangled", "Fallout: New Vegas", "The Legend of Secret Pass", "Bunraku", "H.A.W.X.2", "Sons of Anarchy: Happy Ending Roundtable", "Sons of Anarchy: The Moral Code of Sons of Anarchy", "Acts of Violence", "Chowder (2008-2010)", "Batman: The Brave and the Bold", "Dark Country", "The Job", "The Devil's Tomb", "Afro Samurai", "Robot Chicken", "Star Wars: The Clone Wars", "Fallout 3", "I Sell the Dead", "Spirit of the Forest", "Mutant Chronicles", "Outlander", "Hellboy II: The Golden Army", "Hellboy: The Science of Evil", "Uncross the Stars", "The Batman (2005-2008)", "Turok", "The Spiderwick Chronicles", "Avatar: The Last Airbender", "Conan", "Halo 3", "Battle for Terra", "Kim Possible", "Danny Phantom (2004-2007)", "Hellboy Animated: Iron Shoes", "In the Name of the King: A Dungeon Siege Tale", "Hellboy Animated: Blood and Iron", "Afro Samurai", "Welcome to Wackamo", "No. 6", "Hellboy Animated: Sword of Storms", "Masters of Horror", "5ive Girls", "Justice League Heroes", "The Last Winter", "Scooby-Doo! Pirates Ahoy!", "How to Go Out on a Date in Queens", "Desperation", "Local Color", "Justice League Unlimited", "Teen Titans (2003-2006)", "The Outfit", "Gun", "Teen Titans", "Danny Phantom: The Ultimate Enemy", "The Incredible Hulk: Ultimate Destruction", "Tarzan 2: The Legend Begins", "Missing in America", "Scooby-Doo in Where's My Mummy?", "The Second Front", "Narc", "What's New, Scooby-Doo?", "Halo 2", "Quiet Kill", "The Chronicles of Riddick: Escape from Butcher Bay", "Hellboy", "Justice League", "Looney Tunes: Back in Action", "Lords of EverQuest", "True Crime: Streets of LA", "Batman: Rise of Sin Tzu", "Hoodlum & Son", "Two Soldiers", "Boys on the Run", "Static Shock", "Absolon", "Killer Rats", "Shakedown", "Star Trek: Nemesis", "Crime and Punishment", "Blade II", "The Tick", "Night Class", "Disney's the Legend of Tarzan", "The Shaft", "Fallout Tactics: Brotherhood of Steel", "Forgotten Realms: Icewind Dale - Heart of Winter", "Enemy at the Gates", "Charmed", "Buzz Lightyear of Star Command", "Jackie Chan Adventures", "Stroke", "The Wild Thornberrys", "The King's Guard", "The Magnificent Seven (1998-2000)", "Titan A.E.", "The Trial of Old Drum", "Price of Glory", "Operation Sandman", "Men in Black: The Series", "Family Law", "Primal Force", "Supreme Sanction", "Happy, Texas", "Superman: The Animated Series (1997-1999)", "Zorro (1997-1998)", "The Outer Limits", "An American Tail: The Treasure of Manhattan Island", "Godzilla: The Series", "Fallout 2: A Post-Nuclear Role-Playing Game", "Houdini", "I Woke Up Early the Day I Died", "Hey Arnold! (1996-1998)", "A Town Has Turned to Dust", "The New Batman Adventures (1997-1998)", "Frogs for Snakes", "Betty", "Fallout: A Post-Nuclear Role-Playing Game", "Alien: Resurrection", "Tinseltown", "Prince Valiant", "Perversions of Science", "The Second Civil War", "Tracey Takes On...", "The Protector", "Skwids", "Mortal Kombat: Defenders of the Realm", "Highlander", "Wing Commander Academy", "The Island of Dr. Moreau", "Duckman: Private Dick/Family Man", "Iron Man", "Chronomaster", "The Adventures of Captain Zoom in Outer Space", "Mr. Stitch", "Picture Windows", "Fantastic Four: The Animated Series (1994-1995)", "Phantom 2040 (1994-1995)", "The Last Supper", "The Adventures of Batman & Robin", "Fluke", "Tiny Toons' Night Ghoulery", "The City of Lost Children", "Original Sins", "The Little Mermaid", "Sensation", "Mighty Max", "Aladdin", "Police Academy: Mission to Moscow", "When the Bough Breaks", "Double Exposure", "The Cisco Kid", "Arly Hanks", "Animaniacs", "Bonkers", "The Untouchables", "Batman: The Animated Series (1992-1993)", "Romeo Is Bleeding", "The Legend of Prince Valiant (1991-1993)", "Cronos", "The Adventures of Huck Finn", "Sleepwalkers", "Blind Man's Bluff", "Beauty and the Beast (1987-1990)", "A Stoning in Fulham County", "One Life to Live", "Miami Vice", "The Name of the Rose", "The Insiders", "Our Family Honor", "MacGruder and Loud", "The Fall Guy", "The Ice Pirates", "Quest for Fire", "Ryan's Hope"]}