{"name": "Barry Bonds", "current role": "Self", "birth name": "Barry Lamar Bonds", "birth date": "1964-07-24", "birth place": "Riverside, California, USA", "height": "6' 1\" (1.85 m)", "biography": "Barry Bonds was born on July 24, 1964 in Riverside, California. He is known for his outstanding abilities on the baseball diamond, where he has won the National League Most Valuable Player Award three times. While playing for the Pittsburgh Pirates he received a cameo appearance in the baseball film \"Rookie of the Year\". He played for the Pittsburgh Pirates 1986 to 1992 and San Francisco Giants, 1993 to 2007. He was one of the highest paid players in Major League Baseball.::Matt Dicker", "trade mark": " ", "trivia": ["Baseball great and Hall of Famer Willie Mays is Barry's godfather.", "Baseball great Bobby Bonds is Barry's father.", "He is the only major leauguer to reach the feat of 400 home runs and 400 steals.", "He is the 17th major-leaguer to hit 500 home runs.", "Nephew of 1964 Olympic 80-meter hurdler Rosie Bonds.", "Holds MLB record for most homeruns in a single season with 73 (breaking Mark McGwire's short-lived record). [2001]", "Named one of People Magazine's \"25 Most Intriguing People of 2001\".", "First man to win 4 MVPs, 90 and 92 with the Pittsburgh Pirates, 93 and 2001 with the San Fransisco Giants.", "Led NL in Home Runs in 93 and 2001", "has won 7 Gold Gloves", "Has played on 5 Division championship teams, 90, 91 and 92 with the Pittsburgh Pirates and 97, 2000, and 2003 with the San Fransisco Giants", "Played for the Pittsburgh Pirates 1986-1992, San Fransisco Giants 93-present", "has one son, Nikolai and 2 daughters Shikari and Aisha Lynn", "January 14, 2002: At the age of 37, after having possibly his greatest season ever in 2001, a season in which he hit 73 home runs (setting the major league single-season record), became the 17th person in history to hit 500 career home runs, passed Babe Ruth's single-season walk record of 170, and won a major-league record fourth MVP award, he re-signs with the San Francisco Giants for a five-year, $90 million contract.", "When he signed with the Giants on December 8, 1992, his six-year, $43.75 million contract made hime the highest-paid baseball player of all-time.", "As of May 2017 is one of eight players to hit 600 career home runs. Soon to be joined by Albert Pujols.", "Graduated from Junipero Serra High School in San Mateo, California. Other alumni are Tom Brady and Greg Gutfeld.", "Children by ex-wife Susann, Nikolai Lamar (18 December 1989), Shikari (March 1991)", "He is the only major leaguer to reach the feat of 500 home runs and 500 steals.", "San Francisco Giants All-Time Slugging Percentage Leader (.671).", "San Francisco Giants All-Time On Base Percentage Leader (.467).", "Recently passed godfather Willie Mays in the number of career home runs.", "In 2004, became the third player to reach 700 career home runs, joining Hank Aaron and Babe Ruth", "On August 7, 2007, became the all-time career home run record holder when he hit his 756th home run of his career off Mike Bacsik at 8:51 p.m. PT during the bottom of the fifth inning in San Francisco. Mike Bacsik became the 446th pitcher to give up one or more home runs to Bonds. The previous record was 755 home runs which was previously held by Henry Aaron.", "Has won a Major League record 7 MVP awards.", "When the Giants signed Barry Zito before the 2007 season, not only was Bonds no longer the highest paid player on the Giants, he was no longer the highest paid player on the Giants named \"Barry\".", "Retired from the San Francisco Giants [2008]", "Was once intentionally walked while the bases were loaded."], "filmography": ["Arli$$", "Nash Bridges", "Renegade", "Moment of Truth: Broken Pledges", "Beverly Hills, 90210", "The Tonight Show with Jay Leno", "Rookie of the Year"]}