{"name": "Matt Damon", "current role": "Linus Caldwell", "birth name": "Matthew Paige Damon", "birth date": "1970-10-08", "birth place": "Boston, Massachusetts, USA", "height": "5' 10\" (1.78 m)", "biography": "Matthew Paige Damon was born on October 8, 1970, in Boston, Massachusetts, to Kent Damon, a stockbroker, realtor and tax preparer, and Nancy Carlsson-Paige, an early childhood education professor at Lesley University. Matt has an older brother, Kyle, a sculptor. His father was of English and Scottish descent, and his mother is of Finnish and Swedish ancestry. The family lived in Newton until his parents divorced in 1973, when Damon and his brother moved with his mother to Cambridge. He grew up in a stable community, and was raised near actor Ben Affleck.Damon attended Cambridge Rindge and Latin School and he performed in a number of theater productions during his time there. He attended Harvard University as an English major. While in Harvard, he kept on skipping classes to pursue acting projects, which included the TNT original film, Rising Son (1990), and prep-school drama, School Ties (1992). It was until his film, Geronimo: An American Legend (1993), was expected to be a big success that he decided to drop out of university completely. Arriving in Hollywood, Matt managed to get his first break with a part in the romantic comedy, Mystic Pizza (1988). However, the film did not do too well and his film career failed to take off. Not letting failure discourage him from acting, he went for another audition, and managed to get a starring role in School Ties (1992). Up next for Matt was a role as a soldier who had problems with drug-addiction in the movie, Courage Under Fire (1996). Matt had, in fact, lost forty pounds for his role which resulted in health problems.The following year, he garnered accolades for Good Will Hunting (1997), a screenplay he had originally written for an English class at Harvard University. Good Will Hunting (1997) was nominated for 9 Academy Awards, one of which, Matt won for Best Original Screenplay along with Ben Affleck. In the year 1998, Matt played the title role in Steven Spielberg's film, Saving Private Ryan (1998), which was one of the most acclaimed films in that year. Matt had the opportunity of working with Tom Hanks and Vin Diesel while filming that movie. That same year, he starred as an earnest law student and reformed poker player in Rounders (1998), starring opposite Edward Norton and John Malkovich. The next year, Matt rejoined his childhood friend, Ben Affleck and fellow comedian, Chris Rock, in the comedy Dogma (1999).Towards the end of 1999, Matt played \"Tom Ripley\", a working-class young man who tastes the good life and will do anything to live it. Both Jude Law and Gwyneth Paltrow also starred in the movie. The Talented Mr. Ripley (1999) earned mixed reviews from critics, but even so, Matt earned praise for his performance. Matt lent his voice to the animated movie, Titan A.E. (2000) in the year 2000, which also earned mixed reviews from the public. He also starred in two other movies, All the Pretty Horses (2000) and the golf comedy-drama, The Legend of Bagger Vance (2000), starring alongside Will Smith. In the year 2003, he signed on to star in The Informant! (2009) by Steven Soderbergh and the Farrelly Brothers' Stuck on You (2003). He also starred in Gerry (2002), a film he co-wrote with his friends, Gus Van Sant and Casey Affleck. One of Matt's most recognizable work to date is his role in the \"Bourne\" movie franchise. He plays an amnesiac assassin, \"Jason Bourne\", in The Bourne Identity (2002), The Bourne Supremacy (2004) and The Bourne Ultimatum (2007). Another praised role is that as \"Linus Caldwell\" in the \"Ocean's\" movie franchise. He had the opportunity to star opposite George Clooney, Brad Pitt, Julia Roberts and Don Cheadle in Ocean's Eleven (2001). The successful crime comedy-drama eventually had two other sequels, Ocean's Twelve (2004) and Ocean's Thirteen (2007). Among other highly acclaimed movies that Matt has been a part of are Terry Gilliam's The Brothers Grimm (2005), George Clooney's Syriana (2005), Martin Scorsese's The Departed (2006) and Robert De Niro's The Good Shepherd (2006).In his personal life, Matt is now happily married to Argentine-born Luciana Barroso, whom he met in Miami, where she was working as a bartender. They married in a private civil ceremony on December 9, 2005, at the Manhattan Marriage Bureau. The couple have four daughters Alexia, Luciana's daughter from a previous relationship, as well as Isabella, Gia and Stella. Matt is a big fan of the Boston Red Sox and he tries to attend their games whenever possible. He has also formed great friendships with his Ocean's co-stars, George Clooney and Brad Pitt, whom he works on charity projects with. He and actor Ben Affleck, together with Ben's wife, Jennifer Garner, are also good family friends.::Anonymous, Dennis Lewis, and Charles Caro", "trade mark": "Often works with actors Ben Affleck and George Clooney", "trivia": ["1998: Played in $10,000 buy-in Texas Hold 'Em tournament at the World Series of Poker (www.wsop.com) in Las Vegas. He was knocked out in the first day by poker legend Doyle Brunson. Damon had kings, Brunson aces.", "Chosen as one of \"the 50 Most beautiful people in the world\" by People magazine (1998).", "Dropped 47 pounds for his role as a Gulf War vet in Courage Under Fire (1996).", "His parents divorced when he was two and he spent part of his childhood in a commune in Boston with his mother.", "Dropped out of Harvard 12 credits short of graduating to pursue his acting career.", "To perfect his Southern accent for his role as Rudy Baylor in The Rainmaker (1997), he tended bar in Knoxville, TN, for free. Later he hired one of the customers to serve as his dialect coach.", "Auditioned for a role in To Die For (1995) which was eventually given to Joaquin Phoenix.", "Audtioned for a part in Primal Fear (1996) that was eventually played by Edward Norton. He and Norton starred together two years later in Rounders (1998).", "Both he and Ben Affleck worked as extras on the film Field of Dreams (1989). At one point during the shoot, Matt took some blades of grass from the field as mementos for his father.", "Turned down a role in The Quick and the Dead (1995). Leonardo DiCaprio was cast instead.", "Turned down the lead role in The Majestic (2001).", "When his baby nephew cries, he sings \"Afternoon Delight\" for him.", "Was named as one of E!'s \"25 Most Eligible Bachelors\" in June, 2002.", "Shaved his head for the movie The Brothers Grimm (2005) (to assist in the wearing of a wig for that role). The shaved head was shown in the movie EuroTrip (2004), which was filmed in Prague at the same time.", "Started a bowling league in Berlin while making The Bourne Supremacy (2004).", "Had a cameo as a waiter in the film The Sum of All Fears (2002), but it was cut from the final film.", "Is the real-life best friend of Ben Affleck. Each has starred together or had cameos in each of the other's films.", "Has starred in 10 movies where the title contains some part of his character's name in that movie: Good Will Hunting (1997), Saving Private Ryan (1998), The Talented Mr. Ripley (1999), Gerry (2002), Spirit: Stallion of the Cimarron (2002), The Bourne Identity (2002), and The Bourne Supremacy (2004), The Brothers Grimm (2005), The Bourne Ultimatum (2007) and Jason Bourne (2016).", "While promoting The Bourne Supremacy (2004) on The Tonight Show with Jay Leno (1992), he revealed that when he was a college freshman his agent from a \"ma and pa agency\" inadvertently sent him and Ben Affleck to an audition for The New Mickey Mouse Club (1977). They were under the impression that they were going to meet the head of Touchstone Pictures.", "His uncle, George Brunstad, swam the English Channel at the age of 70. He completed the 21-mile swim in 15 hours and 59 minutes, making him the new world record holder as the oldest person to complete the swim. In the process, he raised $12,000 for a Haitian children's group (29 August 2004).", "Quit smoking after visiting a hypnotist in L.A.", "Grew up next door to radical historian Howard Zinn. Damon references Zinn's seminal work \"A People's History of the United States\" as Will in Good Will Hunting (1997).", "1998: Formed Pearl Street Productions with Ben Affleck and Chris Moore.", "Lost 30 pounds for his role in the film The Talented Mr. Ripley (1999).", "Learned to play piano for the film The Talented Mr. Ripley (1999).", "Was considered for the role of Matt Murdock/Daredevil in Daredevil (2003). The role eventually went to his best friend Ben Affleck.", "One of his first movie roles was a one-line part in Mystic Pizza (1988) starring Julia Roberts. Later, he starred with Roberts in Ocean's Eleven (2001).", "After a notable weight gain for Stuck on You (2003), he lost 22 pounds training for The Bourne Supremacy (2004), eventually having six-pack abs.", "Had never made a sequel until he made Ocean's Twelve (2004) and The Bourne Supremacy (2004), both in the same year. In 2007, the third parts of those series, Ocean's Thirteen (2007) and The Bourne Ultimatum (2007), opened, making the first trilogies he's starred in.", "Became stepfather to girlfriend Luciana Barroso's daughter, Alexia, when he married Luciana at City Hall in New York City (December 9, 2005).", "Met his wife, Luciana Barroso, in Florida, while he was filming Stuck on You (2003) and she was working as a bartender.", "Was once offered the chance at playing Daredevil when it was in production at Miramax in 1999. This version would have starred Damon and been written by Kevin Smith and directed by Robert Rodriguez. However, Marvel Comics wanted too large a budget for the filmmakers' tastes.", "Has English and Scottish ancestry on his father's side, and Finnish and Swedish ancestry on his mother's side. His maternal grandfather had changed his surname from \"Pajari\" (a Finnish surname) to \"Paige\".", "Turned down the part of Bobby Mercer in Four Brothers (2005), as he found the script to be \"ultra-violent\". The part eventually went to Mark Wahlberg.", "Francis Ford Coppola cast him in The Rainmaker (1997) after seeing him in Courage Under Fire (1996).", "Turned down the role of Harvey Dent in The Dark Knight (2008).", "Appears in two of the six summer 2007 \"threequels\": Ocean's Thirteen (2007) and The Bourne Ultimatum (2007). He also appeared in the second; movies of the \"Bourne\" and \"Ocean\" franchises in the same year (2004).", "Both he and best friend, Ben Affleck, spent Father's Day 2007 with their wives and children together on vacation in Hawaii.", "Received a star on the Hollywood Walk of Fame (26 July 2007).", "Is only 11 years older than Eddie Redmayne who plays his son in The Good Shepherd (2006).", "Named Hollywood's \"best value\" by Forbes Magazine, with his films making $29 (US) for each dollar he is paid (2007).", "Named \"Sexiest Man Alive\" by People magazine in 2007.", "He gained over 30 pounds to play Mark Whiteacre in The Informant! (2009), which he dieted off as soon as the shoot was complete.", "He and Ben Affleck lived two blocks away from each other in Cambridge, Massachusetts, when they were children.", "Has an older brother named Kyle, who is a sculptor.", "Visited Haiti with Wyclef Jean to deliver food to hurricane victims. [September 2008]", "Originally cast as Dan White in Milk (2008), but had to back out due to scheduling conflicts with Green Zone (2010).", "Participated in the Cape Argus Cycle Tour in Cape Town, South Africa. [March 2009]", "Was at some point in talks to star in a remake of Blue Thunder (1983) with John Milius directing.", "Appeared twice on the cover of GQ magazine: December '99 and August '07.", "Was, along with Jake Gyllenhaal, the studio's first choice for the role of Jake Sully in Avatar (2009), but director James Cameron chose the (back then) more unknown Sam Worthington in the lead role instead.", "When he and best friend Ben Affleck were struggling actors, they both shared a Boston bank account.", "Put his Miami Beach mansion on North Bay Rd on the market for $20 million in May 2013.", "Became a father for the 1st time at age 35 when his wife Luciana Barroso gave birth to their daughter Isabella Zavala Damon on June 11, 2006.", "Became a father for the 2nd time at age 37 when his wife Luciana Barroso gave birth to their daughter Gia Zavala Damon on August 20, 2008.", "Became a father for the 3rd time at age 40 when his wife Luciana Barroso gave birth to their daughter Stella Zavala Damon on October 20, 2010.", "Attended The Bourne Ultimatum (2007) premiere in Amsterdam, Netherlands on Aug. 23rd. [August 2007]", "New York City, USA: The documentary film which he narrated, American Teacher (2011), premiered here before opening around the country. [September 2011]", "Filming The Informant! (2009) in Decatur, Illinois (Home to ADM). Various locations. [May 2008]", "Currently shooting director Martin Scorsese's The Departed (2006) with Leonardo DiCaprio and Jack Nicholson in New York City and Boston. [August 2005]", "Is sometimes (but rarely) mistaken for actor Mark Wahlberg.", "As of 2019, has appeared in six films that were nominated for the Best Picture Oscar (not counting his unconfirmed bit part in Field of Dreams (1989)): Good Will Hunting (1997), Saving Private Ryan (1998), The Departed (2006) , True Grit (2010), The Martian (2015) and Ford v Ferrari (2019), and produced Best Picture nominee Manchester by the Sea (2016). The Departed (2006) won in the category.", "Stated that his appearance on The Graham Norton Show (2007) with Hugh Bonneville and Bill Murray was 'the best time he'd ever had on a chat show'.", "Exactly one year younger than Jeremy Davies, both appeared in Saving Private Ryan (1998) as Private Ryan and Corporal Upham. Both born on 8 October.", "Tenth cousin once removed of Ben Affleck.They are both descendants of William Knowlton Jr., a bricklayer who came to the United States from England in the 1630s.", "He has appeared in four films directed by Kevin Smith: Chasing Amy (1997), Dogma (1999), Jay and Silent Bob Strike Back (2001) and _Jersey Girl (2004).", "Jimmy Kimmel had a long running gag of ending his late night show with an apology to Matt Damon for not being able to interview him.", "He has worked with 9 directors who have won a Best Director Oscar: Francis Ford Coppola, Steven Spielberg, Anthony Minghella, Robert Redford, Steven Soderbergh, Martin Scorsese, Clint Eastwood, and Joel Coen & Ethan Coen.", "He has starred in three different films where rescuing his character is a major plot point: Saving Private Ryan (1998), Interstellar (2014) and The Martian (2015).", "He starred in two science fiction films with Jessica Chastain where his character needs to be rescued: Interstellar (2014) and The Martian (2015).", "Has starred in six films with Casey Affleck: Good Will Hunting (1997), Gerry (2002), Oceans Eleven (2002), Oceans Twelve (2004), Oceans Thirteen (2007) and Interstellar (2014). Interstellar (2014) is the only one in which They do not have any scenes together.", "He said that in 1995, he was paid $20,000 to be in Tommy Lee Jones film The Good Old Boys (1995). That money kept Damon and Ben Affleck free from having to take other jobs so that they could write Good Will Hunting (1997).", "Has stated since The Bourne Identity, when rehearsing fight scenes with stunt men, he has bought each of them a bottle of champagne for every time he struck them by accident.", "Like his best friend Ben Affleck, he was an avid fan and collector of Daredevil comics growing up.", "He was among the actors considered for the role of Batman's Sidekick Dick Grayson/Robin/Nightwing in 'Batman Forever (1995)'. His best friend Ben Affleck would go on to play Bruce Wayne/Batman over twenty years later.", "Friends with Casey Affleck, George Clooney, Brad Pitt, Joaquin Phoenix, and Wyclef Jean.", "Co-founded H20 Africa,an organization that brings clean drinking water to three million people in developing countries.", "According to articles posted in Dec. 2015 on Quora and other sources, the total cost of all the rescue missions that were mounted to save characters he played in various films (including Saving Private Ryan, Interstellar and The Martian) would exceed 900 billion in adjusted dollars.", "He has starred in three films with Alec Baldwin: The Departed (2006), The Good Shepherd (2006) and Downsizing (2017). The two also appeared in multiple episodes of 30 Rock (2006-2012) together.", "He is close friends with Chris Hemsworth.", "Has the distinction of playing two stranded astronauts in need of a rescue; the villainous Dr. Mann in Interstellar (2014) and the heroic Mark Watney in The Martian (2015).", "Although his characters have used them frequently in films, he has a strong dislike of guns in real life.", "The character Skylar in Good Will Hunting (1997), played by Minnie Driver, was inspired by Skylar Satenstein, who he used to date in College.", "Began his acting career at the Wheelock Community Theater."], "filmography": ["Thor: Love and Thunder", "No Sudden Move ()", "Stillwater ()", "The Last Duel", "Jay and Silent Bob Reboot", "Ford v Ferrari", "Saturday Night Live: Cut for Time", "Saturday Night Live (2011-2018)", "Deadpool 2", "Unsane", "Thor: Ragnarok", "Suburbicon", "Downsizing", "The Great Wall", "Jason Bourne", "The Martian", "Ares III: The Right Stuff", "Ares III: Farewell", "Jimmy Kimmel Live!", "Interstellar", "The Monuments Men", "Nespresso: In the Name of Pleasure", "The Zero Theorem", "Elysium", "Behind The Candelabra", "House of Lies", "Promised Land", "We Bought a Zoo", "Happy Feet Two", "Margaret", "Contagion", "The Adjustment Bureau", "30 Rock (2010-2011)", "True Grit", "Hereafter", "Green Zone", "Cubed", "Invictus", "Entourage", "The Informant!", "Ponyo", "Che: Part Two", "Youth Without Youth", "Arthur", "The Bourne Ultimatum", "Ocean's Thirteen", "The Good Shepherd", "The Departed", "Syriana", "Magnificent Desolation: Walking on the Moon 3D", "The Brothers Grimm", "Law & Order: Criminal Intent", "Ocean's Twelve", "The Bourne Supremacy", "Jersey Girl", "EuroTrip", "Stuck on You", "Confessions of a Dangerous Mind", "The Bernie Mac Show", "The Bourne Identity", "The Third Wheel", "Spirit: Stallion of the Cimarron", "Will & Grace", "Gerry", "The Majestic", "Ocean's Eleven", "Jay and Silent Bob Strike Back", "All the Pretty Horses", "Finding Forrester", "The Legend of Bagger Vance", "Titan A.E.", "The Talented Mr. Ripley", "Dogma", "Rounders", "Saving Private Ryan", "Good Will Hunting", "The Rainmaker", "Chasing Amy", "Courage Under Fire", "Glory Daze", "The Good Old Boys", "Geronimo: An American Legend", "School Ties", "Rising Son", "Field of Dreams", "The Good Mother", "Mystic Pizza"]}