{"name": "Karen Gillan", "current role": "Evie", "birth name": "Karen Sheila Gillan", "birth date": "1987-11-28", "birth place": "Inverness, Scotland, UK", "height": "5' 10¾\" (1.8 m)", "biography": "Karen Sheila Gillan was born and raised in Inverness, Scotland, as the only child of Marie Paterson and husband John Gillan, who is a singer and recording artist. She developed a love for acting very early on, attending several youth theatre groups and taking part in a wide range of productions at her school, Charleston Academy.At age 16, Karen decided she wanted to pursue her acting career further and, studied under the renowned theatre director Scott Johnston at the Performing Arts Studio Scotland. She later attended the prestigious Italia Conti Academy in London. During her first year, she landed a role on Rebus (2000) and soon appeared in a variety of programs including Channel 4's Stacked (2008) and The Kevin Bishop Show (2008), as well as a two-year stint on the long-running series Doctor Who (2005). Karen also stars in the film Outcast (2010), starring James Nesbitt. Her most recent starring role is as Eliza Dooley on the situation comedy Selfie (2014).::Questnl", "trade mark": "Red hair", "trivia": ["Grew up in Inverness, Inverness-shire, Scotland, Great-Britain and Northern-Ireland.", "Attended the Italia Conti Academy of Theatre Arts in London, England.", "Loves rummaging through vintage clothes shops and playing the piano.", "Used the code word 'Panic Moon' (an anagram of 'Companion'), when auditioning for the role of Doctor Who's assistant/companion.", "Cousin of Caitlin Blackwood, who plays the younger Amy Pond on Doctor Who.", "Voted Best Actress by readers of \"Doctor Who\" magazine for her stint on the 2010 season of Doctor Who (2005).", "Karen is part of the youngest pairing of Doctor Who and companion on Doctor Who (2005). In 2009, the new Doctor, Matt Smith, is 26, and she is just 21. Their combined age will be younger than that of Jon Pertwee, when he was playing the Time Lord in the 1970s.", "Karen admitted the first person she told when she got the role of Amy Pond was her mother, who the actress said was a huge fan of Doctor Who (1963).", "Is the only child and daughter of John Gillan of Clan Macnab and wife Marie Paterson of Clan Paterson, considered part of Clan MacLaren or of Clan Farquharson.", "Good friends with Katee Sackhoff.", "The Daleks on the series had to be redesigned to match her height, as she's half a foot taller than Billie Piper, who was the first companion on the revival.", "Currently resides in Manhattan, New York, New York County, New York, and in Los Angeles, Los Angeles County, California.", "Two years before she was cast as Amy Pond on Doctor Who (2005), Karen had a guest role in the episode, Doctor Who: The Fires of Pompeii (2008). She was cast as a soothsayer.", "Became a huge fan of the situation comedy Community (2009), after her flatmate told her about their Doctor Who parody, \"Inspector Spacetime\".", "Shaved her head completely bald to play Nebula in Guardians of the Galaxy (2014). Marvel Studios subsequently turned her shaved hair into a wig and presented it to her as a gift which she still keeps to this day.", "Went on record that she would like to play a female Bond antagonist in a future James Bond movie and that she wants to play the female incarnation of The Joker in a future Batman movie.", "Funko released Pop! vinyls of Karen Gillan's characters Amy Pond from Doctor Who and Nebula from the Cinematic Marvel Universe.", "Gillan shaved off her hair during Guardians of The Galaxy (2014). She revealed this during Comic-Con 2013. During the conference, she wore a wig then took it off to surprise fans.", "When she's not acting, she likes to play the piano and loves rummaging through vintage clothes shops.", "One of her golden rules of life is a minimum of 8 hours of sleep per night.", "Her father John is English and her mother Marie is Scottish and one of 8 siblings."], "filmography": ["Guardians of the Galaxy Vol. 3", "Thor: Love and Thunder", "Dual", "Gunpowder Milkshake", "What If...?", "The Hoarding", "Rory's Story", "The Call of the Wild", "Jumanji: The Next Level", "Spies in Disguise", "Neurotica.", "Avengers: Endgame", "Stuber", "All Creatures Here Below", "Avengers: Infinity War", "The Party's Just Beginning", "Jumanji: Welcome to the Jungle", "Alex & The List", "The Circle", "Guardians of the Galaxy Vol. 2", "Emo Dad", "In a Valley of Violence", "Halloween video of the Selfie cast", "The Devil You Know", "Robot Chicken", "The Big Short", "Conventional", "Fun Size Horror: Volume Two", "Warning Labels", "7 Days in Hell", "Selfie", "TV on the Radio: Happy Idiot", "Bound for Greatness", "A Touch of Cloth", "Guardians of the Galaxy", "Z'ombeal: Walking Dead Skin Care", "Doctor Who (2008-2013)", "NTSF:SD:SUV", "Oculus", "Not Another Happy Ending", "In Love With...", "Pond Life", "Doctor Who: Good as Gold", "We'll Take Manhattan", "Night and the Doctor", "Doctor Who: The Adventure Games - The Gunpowder Plot", "Doctor Who: Space and Time", "Doctor Who: The Adventure Games - Shadows of the Vashta Nerada", "Doctor Who: Return to Earth", "Doctor Who: Evacuation Earth", "Meanwhile, in the TARDIS: Part 1", "Meanwhile, in the TARDIS: Part 2", "Doctor Who: The Adventure Games - TARDIS", "Doctor Who: The Adventure Games - Blood of the Cybermen", "Doctor Who: The Adventure Games - City of the Daleks", "Outcast", "The Well", "The Kevin Bishop Show (2008-2009)", "New Town Killers", "Stacked", "Coming Up", "Harley Street", "Rebus"]}