{"name": "Carl Reiner", "current role": "Saul Bloom", "birth name": " ", "birth date": "1922-03-20", "birth place": "The Bronx, New York City, New York, USA", "height": "6' 1½\" (1.87 m)", "biography": "Carl Reiner was a legend of American comedy, who achieved great success as a comic actor, a director, producer and recording artist. He won nine Emmy Awards, three as an actor, four as a writer and two as a producer. He also won a Grammy Award for his album \"The 2,000 Year Old Man\", based on his comedy routine with Mel Brooks.Reiner was born in The Bronx, to Bessie (Mathias) and Irving Reiner, a watchmaker. His father was an Austrian Jewish immigrant and his mother was a Romanian Jewish immigrant. At the age of sixteen, while working as a sewing machine repairman, he attended a dramatic workshop sponsored by the Works Progress Administration. The direction of his life was set.In the 1970s, some sources claimed that Reiner made his movie debut in New Faces of 1937 (1937), but that is unlikely as he would have only been fifteen years old at the time. (the movie shares the same plot as his erstwhile partner Mel Brooks' classic The Producers (1967), with a crooked producer planning to fleece his \"angels\" by producing a flop and absconding with the money). He didn't appear on screen, silver or small, until he made his television debut in 1948 in the short-lived television series, The Fashion Story (1948), then became a regular, the following year, on The Fifty-Fourth Street Revue (1949), another television series with a brief life.Reiner made his Broadway debut in 1949 in the musical \"Inside U.S.A.\", a hit that ran for 399 performances. His next Broadway show, the musical revue \"Alive and Kicking\" (1950) was a flop, lasting just 43 performances. Max Liebman, the producer/director/writer/composer, had been called in to provide additional material after the show's troubled six week out-of-town preview in Boston. It didn't help -- the show closed after six weeks on Broadway -- but an important contact had been made.Leibman was a producer-director on Your Show of Shows (1950), one of the great television series, and he hired Reiner to appear on the show in the middle of its first season. Reiner's first gig on the revue-like show was interviewing The Professor, a character played by Sid Caesar. He became central to the comedy portions of the show and, in 1953, he racked up the first of six Emmy Award nominations for acting. (In all, he was nominated for an Emmy Award a total of 13 times). When, in 1954, \"Your Show of Shows\" was split up by the network into its constituent parts, Reiner continued on with Sid in Caesar's Hour (1954). (Imogene Coca was given her own show, which lasted one season, and Leibman was allowed to produce specials).\"Your Show or Shows\" had been a Broadway-style revue, featuring skits such as dancing (including a young Bob Fosse) whereas \"Caesar's Hour\" was pure comedy. \"Your Show of Shows\" had had a great cast, another other than Coca, most of the cast, including Reiner, Howard Morris, and Nanette Fabray (who went on to win an Emmy Award) moved over to \"Caesar's Hour\". In his three seasons on the show, he was nominated three more times for an Emmy Award for Best Supporting Actor, winning twice in 1957 and 1958. But it was its stable of comedy writers that was essential to the great success of both \"Your Show of Shows\" and \"Caesar's Hour\". In addition to Mel Brooks, the writing staff included Neil Simon, his brother Danny Simon, Larry Gelbart and Mel Tolkin. (There are rumors that the young Woody Allen served as the writing staff's typist).Reiner had sat in informally with the writers during \"Your Show of Shows\", but he began writing formally for \"Caesar's Hour\", having learned his craft from all of the other writers. As a self-described uncredited \"writer without portfolio\", he was able to leave writers' meetings at 6 P.M., if he wanted to. This gave him the time to work on a semi-autobiographical novel. Published in 1958, Enter Laughing (1967) is about a young man in 1930s New York trying to make it in show business. It was transformed into a play and, eventually, adapted into a movie in 1967, and a musical, many years later.In 1959, he created the pilot for a television series, \"Man of the House\", in which he would play a writer, Rob Petrie, who balanced his family life with the demands of working as a writer for a comedy show headlined by an egotistical comedic genius modeled after Sid Caesar (a \"benign despot\" who lacked social skills, according to Reiner). The series was rooted in his experience on \"Your Show of Shows\" and \"Caesar's Hour\". The network didn't pick up the pilot at first, as CBS executives claimed the main character, which was clearly autobiographical on Reiner's part, was too New York, too Jewish and too intellectual. In 1960, Reiner teamed up with Mel Brooks on The Steve Allen Plymouth Show (1951), and their routine \"The 2000 Year Old Man\" was a huge success. Reiner played the straight man to Brooks in the routine, which was spun-off into five comedy albums, bringing them a Grammy Award. They also made an animated television special based on their shtick in 1975.Though CBS turned down \"Man of the House\", with the two-time Emmy Award-winning comedian Reiner as the lead, it was still interested in the series. However, they wanted a different actor in the lead role, and the casting of the protagonist came down to Johnny Carson and Dick Van Dyke. Carson was a game show host of no great note at the time, but Van Dyke was in the smash Broadway musical Bye Bye Birdie (1963), for which he won a Tony Award. He got the role and another chapter of television history was made, when Mary Tyler Moore, Rose Marie and Morey Amsterdam all were cast in leading roles. Reiner, himself, would eventually play the role of Alan Brady, the abrasive Sid Caesar-like comic convinced of his own genius, in the last few seasons of the series' five-year run.Another milestone in television comedy, The Dick Van Dyke Show (1961), brought Reiner five more Emmy Awards, three for writing and two as the producer of the series. In 1966, Reiner and the other principals, including executive producer Sheldon Leonard and Dick Van Dyke, decided to end the series at the height of its popularity and critical acclaim. (The show won Emmy Awards as best show and best comedy in 1965 and 1966, respectively). Twenty-nine years after the show was ended, Reiner reprised the role of Alan Brady on Mad About You (1992), winning his eighth (and so far, last) Emmy Award, this time as Outstanding Guest Actor in a Comedy Series.It was on \"The Dick Van Dyke Show\" that Reiner first became a director. His feature film debut, as a director, was with the film adaptation of the play Joseph Stein had adapted from his 1958 novel, Enter Laughing (1967). His work as a writer-director, with Dick Van Dyke, in creating a Stan Laurel-type character in The Comic (1969) was not a success, but Where's Poppa? (1970) became a cult classic and Oh, God! (1977), with George Burns, and The Jerk (1979), with Steve Martin, were smash hits. The last film he directed was the romantic comedy That Old Feeling (1997).Reiner's career continued into the 21st century, when most of his contemporaries had retired or passes. He was awarded the Mark Twain Prize for American Humor in 2000 and acted in the remake of Ocean's Eleven (2001) and its two sequels. He also appeared as a voice artist in the film Good Boy (2003), and the animated series The Cleveland Show (2009) (he even wrote an episode for the series rooted in his \"Your Show of Shows\" experience). He was also a regular on the series Hot in Cleveland (2010) (with fellow nonagenarian Betty White), and appeared on an episode of Parks and Recreation (2009) in 2012. His last film role was as the voice of Carl Reineroceros in Toy Story 4 (2019), opposite his old compatriot Mel Brooks.Carl Reiner died at age 92 of natural causes on June 29, 2020, in Beverly Hills, California.::Jon C. Hopwood", "trade mark": " ", "trivia": ["Father of Rob Reiner, Sylivia Ann Reiner and Lucas Reiner.", "Portrayed Rob Petrie in his 1959 television pilot \"Head of the Family\" which eventually became the basis for The Dick Van Dyke Show (1961).", "Is the 1980 recipient of the prestigious Connor Award given by the brothers of the Phi Alpha Tau fraternity based out of Emerson College in Boston, Massachusetts. He is also an honorary brother of the fraternity.", "Inducted into the Television Academy Hall of Fame (1999) and was awarded the Mark Twain Prize for Comedy by the Kennedy Center for the Performing Arts (2000).", "He was awarded a Star on the Hollywood Walk of Fame at 6241 Hollywood Boulevard in Hollywood, California on February 8, 1960.", "Made a best-selling album with Mel Brooks called \"2000 Years with Carl Reiner and Mel Brooks\" which earned a Grammy Award nomination and ignited Carl's writing career.", "Served in the United States Army in 1942 and was trained as a radio operator. He later was assigned to Maurice Evans' Special Entertainment Unit, which included Werner Klemperer, and toured the South Pacific as a comedian in GI reviews.", "He was awarded The Annual Kennedy Centre Mark Twain Prize for Comedy.", "Father-in-law of Michele Singer and Maud Winchester. Ex-father-in-law of Penny Marshall.", "On The Tonight Show with Conan O'Brien (2009), Reiner disclosed to Conan that he had been a guest on Johnny Carson's talk show no fewer than 47 times. This was Reiner's first appearance on Conan. [December 2009]", "Four of his movies were nominated for AFI's 100 Years...100 Laughs: Oh, God! (1977), The Jerk (1979), The Man with Two Brains (1983) and All of Me (1984). \"The Jerk\" made the list at #89.", "His mother, Bessie (Mathias), was a Romanian Jewish immigrant, and his father, Irving Reiner, was an Austrian Jewish immigrant.", "The writer-director's favorite film is Romance (1930) with Greta Garbo.", "Was friends with Dick Van Dyke, Mel Brooks, Mary Tyler Moore, Kirk Douglas, Betty White, Richard Dawson, Michele Lee and Norman Lear.", "He and his son, Rob Reiner, became the first father-and-son duo to have their footprints and handprints on a concrete slab at Grauman's Chinese Theater (2017).", "He was a lifelong Democrat. He endorsed Bernie Sanders in the 2016 presidential election. He also endorsed Joe Biden in the 2020 presidential election.", "He never retired from acting and was working right up until his death at the age of ninety-eight.", "Grandfather of Jake Reiner, Nick Reiner and Romy Reiner."], "filmography": ["Home Movie: The Princess Bride", "Forky Asks a Question", "Toy Story 4", "Angie Tribeca", "Duck Duck Goose", "Young & Hungry", "Family Guy (2016-2017)", "Justice League Action", "Jake and the Never Land Pirates (2014-2015)", "Shimmer and Shine", "WordGirl", "American Dad! (2011-2015)", "Bob's Burgers", "Hot in Cleveland (2010-2014)", "Two and a Half Men (2009-2014)", "Dumbbells", "Parks and Recreation", "The Cleveland Show (2010-2011)", "The Penguins of Madagascar", "Merry Madagascar", "House", "The Adventures of Captain Cross Dresser", "Ocean's Thirteen", "The Blue Elephant", "Father of the Pride (2004-2005)", "Boston Legal", "The Bernie Mac Show (2002-2005)", "Ocean's Twelve", "The Dick Van Dyke Show Revisited", "Life with Bonnie (2002-2003)", "Good Boy", "The Alan Brady Show", "Ally McBeal", "Crossing Jordan", "The Majestic", "Ocean's Eleven", "Globehunters", "King of the Hill (1997-2000)", "The Adventures of Rocky & Bullwinkle", "Family Law (1999-2000)", "Beggars and Choosers", "Hercules", "Slums of Beverly Hills", "The Larry Sanders Show", "The Right to Remain Silent", "Duckman: Private Dick/Family Man", "Mad About You", "Frasier", "Fatal Instinct", "The Spirit of '76", "Mickey's 60th Birthday", "Summer School", "In the Mood", "Faerie Tale Theatre", "Dead Men Don't Wear Plaid", "Twilight Theater", "Skokie", "History of the World: Part I", "The Jerk", "The End", "Oh, God!", "Good Heavens", "Medical Story", "The 2000 Year Old Man", "Julie and Dick at Covent Garden", "The Carol Burnett Show", "The New Dick Van Dyke Show (1972-1973)", "Ten from Your Show of Shows", "The Bold Ones: The New Doctors", "This Week in Nemtim", "Rowan & Martin's Laugh-In (1970-1972)", "Night Gallery", "The Tim Conway Comedy Hour", "Generation", "That Girl", "The Comic", "Good Morning World", "A Guide for the Married Man", "Funny Is Funny", "The Dick Van Dyke Show (1961-1966)", "Don't Worry, We'll Think of a Title", "The Russians Are Coming the Russians Are Coming", "Alice of Wonderland in Paris", "Linus! The Lion Hearted (1964-1965)", "The Art of Love", "Burke's Law", "It's a Mad Mad Mad Mad World", "The Thrill of It All", "Anatole", "Gidget Goes Hawaiian", "The Comedy Spot", "The Violinist", "The Gazebo", "Happy Anniversary", "Westinghouse Desilu Playhouse", "Playhouse 90", "The George Burns and Gracie Allen Show", "Ponds Theater", "Campbell Summer Soundstage", "The Fashion Story"]}