{"name": "Mark Ruffalo", "current role": "Chuck Aule", "birth name": "Mark Alan Ruffalo", "birth date": "1967-11-22", "birth place": "Kenosha, Wisconsin, USA", "height": "5' 8\" (1.73 m)", "biography": "Award-winning actor Mark Ruffalo was born on November 22, 1967, in Kenosha, Wisconsin, of humble means to father Frank Lawrence Ruffalo, a construction painter and Marie Rose (Hebert), a stylist and hairdresser; his father's ancestry is Italian and his mother is of half French-Canadian and half Italian descent. Mark moved with his family to Virginia Beach, Virginia, where he lived out most of his teenage years. Following high school, Mark moved with his family to San Diego and soon migrated north, eventually settling in Los Angeles.Mark first took classes at the Stella Adler Conservatory and subsequently co-founded the Orpheus Theatre Company, an Equity-Waiver establishment, where he worked in nearly every capacity. From acting, writing, directing and producing to running the lights and building sets while building his resume.Moving into film and TV, Mark's inauspicious movie debut was the drifter role of Christian in the horror opus Mirror Mirror 2: Raven Dance (1994) and returned to the film series in the role of Joey with Mirror Mirror 3: The Voyeur (1995). He continued on through the 1990's rather indistinctly with more secondary roles in the horror film The Dentist (1996) starring madman Corbin Bernsen; an amusing perf in the obscure dramedy The Last Big Thing (1996); a third billed role in the Jerry Stiller/Anne Meara bickering senior comedy A Fish in the Bathtub (1998); and the war drama Ceremony... The Ritual of Love (1976) directed by Ang Lee.Bartending for nearly nearly a decade to make ends meet and discouraged enough to give it up, a chance meeting and resulting collaboration with playwright/screenwriter Kenneth Lonergan approaching the millennium changed everything. Ruffalo won NY success in Lonergan's 1996 off-Broadway play \"This Is Our Youth,\" a story about troubled young adults. This led to his male lead in Lonergan's Oscar-winning film drama You Can Count on Me (2000), playing the ne'er-do-well brother of Laura Linney. The performance drew rave reviews and invited comparisons to an early Marlon Brando.Ruffalo never looked back. Notable roles in The Last Castle (2001), XX/XY (2002), and Windtalkers (2002) followed, although in 2002 Ruffalo was diagnosed with an acoustic neuroma, a type of brain tumor. Though the tumor was benign, the resulting surgery led to a period of partial facial paralysis, from which he fully recovered. In 2003, Ruffalo scored leading roles alongside two popular female stars, playing a police detective opposite Meg Ryan in In the Cut (2003) and the love interest of Gwyneth Paltrow in the comedy View from the Top (2003).Though both films were high-profile box office disappointments, Ruffalo went on to four notable (if highly disparate) films in 2004 -- We Don't Live Here Anymore (2004), Eternal Sunshine of the Spotless Mind (2004), 13 Going on 30 (2004), and Collateral (2004) -- which solidified his ability to be both a popular leading man and an acclaimed ensemble player in either comedy or drama.After 2004, Ruffalo was consistently at work, with leads in popular Hollywood films and independent productions that continued to solidify him as one of film's most consistently strong actors: Just Like Heaven (2005), All the King's Men (2006), Zodiac (2007), Reservation Road (2007), and The Brothers Bloom (2008). He also made his Broadway debut as Moe Axelrod in the play \"Awake and Sing!\"In 2010 Ruffalo achieved something of a breakthrough, by directing the indie film Sympathy for Delicious (2010), which won him the Special Jury Prize at the Sundance Film Festival, and co-starring as the sperm-donor father to lesbian couple Annette Bening and Julianne Moore in The Kids Are All Right (2010). His role in the idiosyncratic domestic comedy/drama earned him Academy Award, Independent Spirit Award, Screen Actors Guild, and BAFTA nominations for Best Supporting Actor. He went on to earn two more Best Supporting Actor nominations as an Olympic-winning wrestling champion in Foxcatcher (2014) and as a journalist working to uncover the Catholic Church sex abuse scandal in Spotlight (2015). In 2017, the actor returned to Broadway in Arthur Miller's \"The Price.\"High-profile roles in Martin Scorsese's Shutter Island (2010) and Longeran's long-delayed film Margaret (2011) followed before Ruffalo's appearance as Dr. Bruce Banner, aka The Hulk, in Joss Whedon's movie blockbuster The Avengers (2012). Garnering highly positive reviews for a role in which actors Eric Bana and Edward Norton could not find success in previous films made Ruffalo a box office action star in addition to a critically-acclaimed actor. He returned to the Banner/Hulk role frequently in such Marvel movies as Iron Man 3 (2013), Avengers: Age of Ultron (2015), Thor: Ragnarok (2017), Avengers: Infinity War (2018), Captain Marvel (2019) and Avengers: Endgame (2019),Reunited with former co-star Gwyneth Paltrow in the sex-addiction comedy-drama Thanks for Sharing (2012), he went on to earn a Golden Globe nomination for playing a bipolar Dad in Infinitely Polar Bear (2014). Ruffalo also took on the lead in Ryan Murphy's adaptation of Larry Kramer's AIDS-drama play The Normal Heart (2014) and earned a SAG Award and Emmy Nomination. He later took home the Emmy playing twin brothers, one a paranoid schizophrenic, in I Know This Much Is True (2020).Ruffalo has been married to actress Sunrise Coigney since 2000; the couple has three children, a son and two daughters.::Gary Brumburgh / gr-home@pacbell.net", "trade mark": "Frequently plays likeable everyman types", "trivia": ["He was set to appear in Signs (2002) but had to drop out when he was diagnosed with a brain tumor. His part in Signs (2002) went to Joaquin Phoenix. The brain tumor Mark was diagnosed with was found to be benign. Following brain surgery, he has fully recovered after suffering from a partial facial paralysis.", "Father was a construction painter and mother a hairstylist. His three siblings (Scott Ruffalo, Tania, and Nicole) are all hairdressers.", "Studied at the Stella Adler Conservatory in Los Angeles.", "Bartended for nearly a decade while trying to break in to show business.", "In an interview with Moviemaker magazine, he claims to have made 800 auditions in his lifetime before making it big.", "Attended First Colonial High School in Virginia Beach, Virginia.", "Benicio Del Toro was a fellow student at the Stella Adler drama school in Los Angeles.", "His father is of Italian descent. His maternal grandfather was of French-Canadian ancestry, and his maternal grandmother was also of Italian descent.", "Was in attendance at Chris Penn's funeral.", "Was a close friend of Heath Ledger. He is also friends with Gael García Bernal.", "He was supposed to play the part of \"Perry Smith\" in Infamous (2006) but had other engagements and so recommended Daniel Craig, who then went on to get the job.", "His brother, Scott Ruffalo, died December 8, 2008, after being found outside his Beverly Hills home after a gunshot wound to the head. He was a 39-year-old hairdresser and was married to Luzelena. His body was cremated.", "While appearing in the drama \"Awake and Sing!\", he was nominated for the 2006 Tony Award (New York City) for Supporting or Features Actor in a Drama.", "Sold his three-bedroom, 2,957-square-foot house in Los Angeles' Hollywood Hills for $1,650,000. He bought the property in 2004 for the same price for which he later sold it. [2009]", "Sold his L.A. home in 2009 and moved his family to Callicoon, New York.", "He was diagnosed with a benign brain tumor (more specifically, an acoustic neuroma) in 2002; he subsequently had it removed and is in good health.", "Like his predecessor and friend Edward Norton, he was a fan of the \"Incredible Hulk\" comics and TV series before playing the title character.", "For his environmental advocacy, Mark Ruffalo received a Global Green Millennium Award and a Meera Gandhi Giving Back Foundation Award. Also chosen as one of the \"People Who Mattered\" in 2011 by Time magazine.", "His uncredited cameo as a snoozing Dr. Banner in Iron Man 3 (2013) makes him only the second actor - the first was Bill Bixby - to play the role twice.", "Lives in ultra trendy Los Angeles neighborhood, Los Feliz. Giovanni Ribisi, Bo Barrett, Scarlett Johansson, Chris Pine, Ryan Reynolds, Brad Pitt, Kristen Stewart, Michael Cera, Hannah Telle and Robert Pattinson are among the other actors who also call Los Feliz home.", "Anti-fracking activist.", "Currently in LA filming Sympathy for Delicious (2010). [January 2009]", "California University of Pennsylvania filming Foxcatcher (2014). [December 2012]", "Was cast as \"Brick\" in the Broadway revival of 'Tennessee Williams (I)''s \"Cat on a Hot Tin Roof\", also featuring Ashley Judd and Ned Beatty. He soon backed out to play \"Stan\" in Charlie Kaufman's Eternal Sunshine of the Spotless Mind (2004). [October 2003]", "Currently appearing on Broadway in Clifford Odets' \"Awake and Sing!\". [May 2006]", "New York, New York, USA [2002]", "Became a father for the 2nd time at age 37 when his wife Sunrise Coigney gave birth to their daughter Bella Noche Ruffalo in May 2005.", "Became a father for the 3rd time at age 39 when his wife Sunrise Coigney gave birth to their daughter Odette Ruffalo on October 20, 2007.", "Son, Keen Ruffalo, was born in June 2001.", "He was Louis Leterrier's original choice for the title role in The Incredible Hulk (2008) but the studio wanted Edward Norton. Ruffalo was later cast in the role in The Avengers (2012) and has played it since.", "He is an animal rights activist.", "He supported Bernie Sanders in the 2016 U.S. Presidential election.", "He is well-known for his far left-wing political views and activism.", "He auditioned for the role of Doctor Doom in The Fantastic Four (1994) but was turned down.", "Shares his birthday with Scarlett Johansson,Hailey Baldwin and Jamie Lee Curtis.", "Worked with Gwyneth Paltrow in 3 films. Thanks for sharing,view from the top and avengers(2012).", "Has worked with Gwyneth Paltrow, Reese Witherspoon,Jennifer Garner,Scarlett Johansson, Kate Winslet,Jim Carrey,Kirsten Dunst,Keira Knightly,Bradley Cooper."], "filmography": ["She-Hulk", "Newsflash ()", "The Adam Project ()", "What If...?", "I Know This Much Is True", "Dark Waters", "Avengers: Endgame", "Captain Marvel", "Avengers: Infinity War", "Thor: Ragnarok", "Team Thor", "Now You See Me 2", "Spotlight", "Avengers: Age of Ultron", "The Normal Heart", "Foxcatcher", "Infinitely Polar Bear", "Begin Again", "Now You See Me", "Iron Man 3", "Thanks for Sharing", "The Avengers", "Margaret", "Date Night", "Shutter Island", "The Kids Are All Right", "Sympathy for Delicious", "Where the Wild Things Are", "What Doesn't Kill You", "The Brothers Bloom", "Blindness", "Reservation Road", "Zodiac", "Chicago 10", "All the King's Men", "Rumor Has It...", "Just Like Heaven", "13 Going on 30: Bloopers", "Collateral", "13 Going on 30", "Eternal Sunshine of the Spotless Mind", "We Don't Live Here Anymore", "In the Cut", "View from the Top", "My Life Without Me", "Windtalkers", "XX/XY", "The Last Castle", "Apartment 12", "The Beat", "Committed", "You Can Count on Me", "How Does Anyone Get Old?", "Ride with the Devil", "Houdini", "54", "Safe Men", "A Fish in the Bathtub", "On the 2nd Day of Christmas", "The Last Big Thing", "Blood Money", "The Dentist", "The Destiny of Marty Fine", "Mirror Mirror 3: The Voyeur", "Due South", "There Goes My Baby", "A Gift from Heaven", "Mirror Mirror 2: Raven Dance", "A Song for You", "Rough Trade", "CBS Summer Playhouse"]}