{"name": "John Magaro", "current role": "Charlie Geller", "birth name": " ", "birth date": " ", "birth place": " ", "height": "5' 7\" (1.7 m)", "biography": "John Robert Magaro was born in 1983 in Akron, Ohio, to Wendy and James Magaro, and was raised in the local suburb Munroe Falls. He began appearing in local theatre productions in and around Cleveland and Akron.In film, Magaro has starred in Paramount's Overlord (2018), directed by Julius Avery. He was also seen in Reginald Hudlin's \"Marshall,\" alongside Chadwick Boseman, in Netflix's \"War Machine,\" starring Brad Pitt, and also in Paramount's award winning \"The Big Short.\" \"The Big Short\" was awarded Best Ensemble by the National Board of Review for 2015 and received the Ensemble Performance Award at the Palm Springs Film Festival, as well as being nominated for a Critics' Choice Award for Best Acting Ensemble and a SAG award for Outstanding Performance by a Cast in a Motion Picture. Additionally, Magaro earned a Hollywood Spotlight Award from the Hollywood Film Awards for his performance in 2012's Not Fade Away (2012).No stranger to the small screen, Magaro is known for his work in \"Tom Clancy's Jack Ryan,\" Woody Allen's \"Crisis in Six Scenes,\" and for his memorable recurring role on Netflix's \"Orange is the New Black.\"A stage actor as well, Magaro starred in the Public Theatre's premiere of \"Illyria,\" playing the Public's founder Joseph Papp. He also had a flashy supporting role in Scott Rudin's revival of \"The Front Page,\" directed by Jack O'Brien, opposite Nathan Lane, John Slattery and John Goodman. Magaro also played the male lead in the critically acclaimed production of \"Tigers Be Still,\" written by Kimberly Rosenstock and directed by Sam Gold for the Roundabout Theatre Company.::Amazon Video X-Ray", "trade mark": " ", "trivia": ["Hometown is Stow, Ohio. He is of Ashkenazi Jewish (mother) and Italian (father) descent.", "He is also famous for the Walmart/Coke commercial.", "Was taught to play drums for his role in Not Fade Away by renowned drummer Andy White.", "As of 2017, has appeared in two films that were nominated for the Best Picture Oscar: Captain Phillips (2013) and The Big Short (2015).", "Lost 40 lbs for his role of Tinker in Unbroken."], "filmography": ["18 1/2 ()", "The Birthday Cake ()", "The Mistress ()", "Lansky ()", "The Many Saints of Newark", "Sylvie's Love", "Gone Hollywood", "First Cow", "Orange Is the New Black (2015-2019)", "The Umbrella Academy", "Overlord", "Tom Clancy's Jack Ryan", "Marshall", "War Machine", "Crisis in Six Scenes", "Angie Tribeca", "The Good Wife (2015-2016)", "The Finest Hours", "The Big Short", "Law & Order: Special Victims Unit (2010-2015)", "Carol", "Don't Worry Baby", "Unbroken", "One Armed Man", "Captain Phillips", "Deep Powder", "Not Fade Away", "Person of Interest", "Liberal Arts", "Body of Proof", "Down the Shore", "My Soul to Take", "The Box", "Taking Chance", "We Pedal Uphill", "Assassination of a High School President", "The Life Before Her Eyes", "The Brave One", "Law & Order", "Bomb", "Level Red", "Bully", "Conviction", "Prisoners of War"]}