{"name": "Albert Brooks", "current role": "Bernie Rose", "birth name": "Albert Lawrence Einstein", "birth date": "1947-07-22", "birth place": "Beverly Hills, California, USA", "height": "5' 11\" (1.8 m)", "biography": "Albert Brooks was born on July 22, 1947 in Beverly Hills, California, USA as Albert Lawrence Einstein. He is an actor and writer, known for Drive (2011), Broadcast News (1987) and Defending Your Life (1991). He has been married to Kimberly Shlain since March 15, 1997. They have two children.::Anonymous", "trade mark": "Dysfunctional relationships (Real Life (1979), Modern Romance (1981) and Mother (1996)).", "trivia": ["Son, Jacob Eli, born [October 1998]", "Brother of Clifford Einstein and Bob Einstein who is best known for his character \"Super Dave\" Osbourne.", "A good friend of Debbie Reynolds.", "Turned down the lead in When Harry Met Sally... (1989) because he thought it was too much like a Woody Allen script. Albert has been described as a West Coast Woody Allen", "Son of Thelma Leeds and Harry Parke(comedian known as 'Parkyakarkus').", "daughter, Claire Elizabeth born [March 2000]", "Nephew of Zeke Manners", "Biography in: \"Who's Who in Comedy\", by Ronald L. Smith, pg.61-62. New York: Facts on File, 1992.  ISBN 0816023387", "Attended the same High School as Angelina Jolie, Michael Klesic, Nicolas Cage, Lenny Kravitz, David Schwimmer, Jonathan Silverman, Gina Gershon, Rhonda Fleming, Jackie Cooper, Rob Reiner, Antonio Sabato Jr., Pauly Shore, Michael Tolkin, Betty White, Corbin Bernsen, Elizabeth Daily and Crispin Glover.", "Has made six guest appearances on The Simpsons (1989). With one exception, he has played a different character each time, and as of 2018 has the most guest appearances on that show. Each time he has been credited as \"A. Brooks.\", no relation to James L. Brooks.", "Has starred in two movies where the song \"Beyond the Sea\" has played over the end credits. My First Mister (2001) and Finding Nemo (2003).", "Once performed a humorless, five-minute stand up comedy routine on The Tonight Show Starring Johnny Carson (1962) that didn't produce a single laugh until the punchline - when he explained to the audience that he had been working as a stand up comic for five years and had run out of material. Johnny Carson swore the hilarity which followed this set-up lasted a full minute.", "Brooks has been honored by the American Film Institute with a retrospective of his work at the first U.S. Comedy Arts Festival in Aspen Colorado.", "Brooks was romantically linked to singer Linda Ronstadt and actresses Carrie Fisher, Julie Hagerty and Kathryn Harrold before settling down and marrying Kimberly Shlain, an artist.", "Brooks attended Carnegie Tech in Pittsburgh, but dropped out after one year to focus on comedy.", "His mother, singer/actress Thelma Leeds had a brief career before marrying Albert's father and settling down to raise a family. She returned occasionally to film in son Albert's movies.", "Albert's father, vaudeville/radio/film comedian Harry Parke (aka Parkyakarkus) died of a heart attack when Albert was 11 in 1958. Parke collapsed next to Milton Berle during a Friar's roast gathering honoring Lucille Ball and Desi Arnaz in Los Angeles.", "Friend of Richard Lewis.", "Turned down the role of Edward Lewis in Pretty Woman (1990).", "Turned down the lead role in Big (1988).", "Changed his last name from \"Einstein\" because there was already an extremely well-known theoretical physicist named Albert Einstein.", "His paternal grandfather, Chaskel (Charles) Einstein, was an Austrian Jewish immigrant, and his paternal grandmother, Sarah Klayman, was a Russian Jewish immigrant. His maternal grandparents, Joseph Goodman and Katie Leventhal, were also Russian Jewish immigrants."], "filmography": ["I Love You, Daddy", "The Secret Life of Pets", "Finding Dory", "Concussion", "The Little Prince", "The Simpsons (1990-2015)", "A Most Violent Year", "This Is 40", "Drive", "Weeds", "The Simpsons Movie", "Looking for Comedy in the Muslim World", "The In-Laws", "Finding Nemo", "My First Mister", "The Muse", "Out of Sight", "Doctor Dolittle", "Critical Care", "Mother", "The Scout", "I'll Do Anything", "Defending Your Life", "Broadcast News", "Lost in America", "Unfaithfully Yours", "Terms of Endearment", "Twilight Zone: The Movie", "Modern Romance", "Private Benjamin", "Real Life", "Taxi Driver", "Saturday Night Live", "The New Dick Van Dyke Show", "Love, American Style", "The Odd Couple", "Hot Wheels", "Insight", "Docteur Marcus Welby"]}