{"name": "Laurene Landon", "current role": "Actress", "birth name": "Laurene Landon Coughlin", "birth date": "1957-03-17", "birth place": "Toronto, Ontario, Canada", "height": "5' 10\" (1.78 m)", "biography": "Tall, leggy and extremely well-built statuesque blonde actress Laurene Landon has enlivened a bunch of hugely enjoyable movies with her spunky energy, physical dexterity, bubbly, upbeat personality and considerable sex appeal. She often portrays tough, two-fisted, no-nonsense action heroines with a winning blend of fiery aplomb and cheerful good humor.Born as Laurene Landon Coughlin in Toronto, Canada, Landon's family moved to the United States when she was four. The 5'9\" Landon starred as \"Molly\", one of two female wrestlers, who are managed by 'Peter Falk', in Robert Aldrich's uproariously raucous comedy, ...All the Marbles (1981). The fiercely athletic and aggressive Landon also performed a lion's share of her own stunts in the film. Landon was very funny as a daffy stewardess in Airplane II: The Sequel (1982) and was excellent as Mike Hammer's loyal secretary \"Velda\" in I, the Jury (1982). Laurene was especially strong and impressive in two delightful action/adventure features for director Matt Cimber: she's the titular rugged warrior woman in Hundra (1983) and a gutsy half-Native American spitfire in Yellow Hair and the Fortress of Gold (1984). Landon was once again, on the money, effective and engaging as courageous policewoman \"Teresa Mallory\" in the terrific Maniac Cop (1988) and its superior 1990 sequel, Maniac Cop 2 (1990). After a regrettably lengthy absence from acting, Laurene made a return to screen with a sizable co-starring part in the Masters of Horror (2005) episode, Masters of Horror: Pick Me Up (2006).Outside of acting, Laurene Landon writes scripts in her spare time and is an award-winning gold medal lyricist, who authored rap music for an L.A. Metro Transit Authority video.::woodyanders, U.N. Owen", "trade mark": " ", "trivia": ["Often acts in movies that are written and/or directed by Larry Cohen.", "Acted in her first play in 3rd grade.", "Her character Teresa in the \"Maniac Cop\" films was named after her beloved mother.", "She's half Irish and half Polish."], "filmography": ["Pay Attention ()", "Clown Motel 2 ()", "Staycation", "Future Punks ()", "Sorrow's Way ()", "Together", "Banned, Exploited & Blacklisted: The Underground Work of Controversial Filmmaker Shane Ryan", "Agramon's Gate", "Nation's Fire", "Syndicate Smasher", "Death Game", "A Husband for Christmas", "Night Terrors", "Terror Tales", "Samurai Cop 2: Deadly Vengeance", "Hunter", "Sky", "Day Out of Days", "Knife to a Gunfight", "1313: Hercules Unbound!", "Drive", "Stand Up", "Masters of Horror", "Days of Our Lives", "Maniac Cop 2", "The Ambulance", "A Hollywood Story", "Wicked Stepmother", "Maniac Cop", "It's Alive III: Island of the Alive", "Armed Response", "America 3000", "The Stuff", "Yellow Hair and the Fortress of Gold", "Hundra", "Airplane II: The Sequel", "I, the Jury", "Full Moon High", "...All the Marbles", "Bitter Heritage", "Roller Boogie", "Scoring"]}