{"name": "Jim Cramer", "current role": "Self", "birth name": "James J. Cramer", "birth date": "1955-02-10", "birth place": "Germantown, Pennsylvania, USA", "height": " ", "biography": "Jim Cramer was born on February 10, 1955 in Germantown, Pennsylvania, USA as James J. Cramer. He is an actor, known for Iron Man (2008), Wall Street: Money Never Sleeps (2010) and The Jim Gaffigan Show (2015).::Anonymous", "trade mark": " ", "trivia": ["At 11, sold ice cream at the baseball stadium to make money.", "Son of Ken Kramer.", "Former broker at Goldman Sachs.", "Co-founder and shareholder of TheStreet.com.", "Co-anchor of CNBC's Squawk on the Street (2005) [2011].", "Release of his book, \"Confessions of a Street Addict\". [2002]", "Release of the book, \"Trading with the Enemy: Seduction and Betrayal on Jim Cramer's Wall Street\" by Nicholas W. Maier. [2002]", "Release of his book, \"You Got Screwed!: Why Wall Street Tanked and How You Can Prosper. [2002]", "Release of his book, \"Jim Cramer's Real Money: Sane Investing in an Insane World\". [2005]", "Release of his book, \"Jim Cramer's Mad Money: Watch TV, Get Rich\" by Jim and Cliff Mason. [2006]", "Release of his book, \"Jim Cramer's Stay Mad for Life: Get Rich, Stay Rich (Make Your Kids Even Richer)\" by James Cramer and Cliff Mason. [2007]", "Won a scholarship to Harvard where he edited the student newspaper the Crimson.", "Father was a gift-wrap salesman.", "Graduated from Harvard Law School where he spent more time watching the Financial News Network and investing in stocks.", "While running his hedge fund he wrote financial columns for GQ, New York, Worth and Smart Money.", "After graduating from Harvard he worked for Congressional Quarterly, the Tallahassee Democrat, the Los Angeles Herald Examiner and American Lawyer.", "In 1987 he quit Goldman Sachs to co-found the hedge fund Cramer, Berkowitz & Co. Between 1988 and 1996 the fund made an annual return of 22 percent compared to 15 percent for the S&P 500."], "filmography": ["Silicon Valley", "The Jim Gaffigan Show", "NFL Top 10", "Arrested Development", "The Good Wife", "Wall Street: Money Never Sleeps", "Iron Man"]}