{"name": "Ted Levine", "current role": "Warden", "birth name": "Frank Theodore Levine", "birth date": "1957-05-29", "birth place": "Bellaire, Ohio, USA", "height": "5' 11\" (1.8 m)", "biography": "Born in May 1957 in Bellaire, Ohio, he was among the last graduating class of the Windsor Mountain School in Lenox, Massachusetts. Attended Marlboro College in Vermont. Performed in summer stock and regional theaters in Vermont, Michigan and West Virginia before settling in Chicago and joining The Remains ensemble. Levine worked on stage at Remains, Wisdom Bridge, and The Goodman and Steppenwolf theaters throughout the 1980s before he began working in television and film.::seamonkey", "trade mark": "Deep bass voice.", "trivia": ["Like Sex and the City (1998) star Chris Noth (\"Mr. Big\"), he attended Marlboro College in Vermont for a time in the 1970s.", "After his terrifying turn as \"Buffalo Bill\" in The Silence of the Lambs (1991), he's had some trouble getting parts other than sadistic psychopaths. He generally tries to choose parts more along the lines of ordinary family men and unfriendly co-workers to get away from the creepy shadow of \"Buffalo Bill\".", "After appearing in The Silence of the Lambs (1991), he appeared in Heat (1995), which was directed by Manhunter (1986) director Michael Mann and featured Manhunter villain Tom Noonan.", "Has worked with both Clarice Starlings. He appeared in The Silence of the Lambs (1991) with Jodie Foster and, ten years later, he appeared in Evolution (2001) with Julianne Moore, who played Clarice Starling earlier that year in Hannibal (2001).", "Has worked with two Jack Crawfords. Prior to appearing in The Silence of the Lambs (1991) with Scott Glenn, he appeared in the television series Crime Story (1986), produced by Michael Mann and starring Dennis Farina, who played Jack Crawford in Manhunter (1986). Also featured in this series was Stephen Lang, who played Freddy Lounds in Manhunter (1986).", "The voice of Chris Griffin in Family Guy (1999) is based on him.", "Has a daughter named Melissa (b. 1976) and a son named Mac (b. 1988) with different women.", "Over the years, he has co-starred with four actors from TV's Prison Break (2005) - with William Fichtner in Heat (1995), Dominic Purcell in Moby Dick (1998), Wade Williams in Ali (2001) and Paul Adelstein in Memoirs of a Geisha (2005).", "He was nominated for a 1996 Joseph Jefferson Award for Actor in a Supporting Role in a Play for \"Buried Child\" at the Steppenwolf Theatre Company in Chicago, Illinois.", "Has been friends with Sam Shepard and William Petersen since their early theater collaborations in the late 1970s.", "His father was of Russian Jewish descent. His mother had English ancestry.", "Ted and his The Silence of the Lambs co-star, Scott Glenn, have both portrayed America's first man in space, Alan Shepard; Levine in the Tom Hanks-produced HBO mini series \"From the Earth to the Moon,\" and Glenn in the 1984 Philip Kaufman film \"The Right Stuff.\".", "Appeared in two films with Will Smith: Wild Wild West (1999) and Ali (2001).", "Starred in a movie called Ellen Foster (1997). He also costarred with Jodie Foster in The Silence of the Lambs (1991). The one scene that they had together was when Buffalo Bill had night vision goggles and was hunting her in his own house, was spoofed in Monk: Mr. Monk and the Blackout (2004)(#3.3).", "Starred with Debra Monk in Ellen Foster (1997). He later starred as Captain Leland Stottlemeyer in Monk (2002).", "While filming The Silence of the Lambs (1991), he and Brooke Smith, who played his hostage, became close friends due to having so many scenes together without any other cast members. Consequently, costar Jodie Foster began referring to Smith as \"Patricia Hearst\", a reference to the heiress who was abducted by a domestic terrorist organization in 1974 and eventually turned to the side of her captors."], "filmography": ["Starbright", "Big Sky", "The Alienist: Angel of Darkness (2018-2020)", "On Becoming a God in Central Florida", "A Violent Separation", "The Report", "Jurassic World: Fallen Kingdom", "Here and Now", "A Midsummer Night's Dream", "Swing State", "Bottom of the World", "Dr. Del", "Lethal Weapon", "Bleed for This", "Ray Donovan", "Mad Dogs", "The Spoils Before Dying", "Little Boy", "Dig Two Graves", "Gutshot Straight", "The Bridge (2013-2014)", "Child of Grace", "Big Game", "Effed!", "Tommy Benjamin", "Banshee Chapter", "Jimmy", "Deep Dark Canyon", "A Single Shot", "Luck", "Hell on Wheels", "Shutter Island", "Monk (2002-2009)", "American Gangster", "The Assassination of Jesse James by the Coward Robert Ford", "The Hills Have Eyes", "Justice League Unlimited", "Memoirs of a Geisha", "The L.A. Riot Spectacular", "Birth", "The Manchurian Candidate", "Static Shock", "Justice League (2002-2003)", "Wonderland", "The Truth About Charlie", "Third Watch", "Ali", "Joy Ride", "The Fast and the Furious", "Evolution", "Wonderland", "Harlan County War", "Wild Wild West", "Superman: The Animated Series (1997-1999)", "You Can Thank Me Later", "From the Earth to the Moon", "Moby Dick", "Ellen Foster", "Flubber", "Switchback", "Mad City", "Wiseguy", "Bullet", "Heat", "Nowhere Man", "Georgia", "The Mangler", "Todo cambia", "Broken Promises: Taking Emily Back", "The Last Outlaw", "Detonator", "Nowhere to Run", "The Paint Job", "Dead and Alive: The Race for Gus Farace", "Murder in High Places", "The Silence of the Lambs", "Midnight Caller", "Love at Large", "Next of Kin", "The Fulfillment of Mary Gray", "Betrayed", "Crime Story (1986-1988)", "Ironweed", "One More Saturday Night", "Two Fathers' Justice", "American Playhouse", "Through Naked Eyes"]}