{"name": "Mark Falvo", "current role": "Lawyer", "birth name": " ", "birth date": " ", "birth place": " ", "height": "5' 10\" (1.78 m)", "biography": "Mark Falvo was born in Boston to Carl and Thelma Falvo. After bouncing around Western and Northeest Pennsylvania, the family settled in Northwest Pa. where Carl Falvo became general manager of a radio station. Mark started working at the radio station when he was 13 doing everything from emptying the garbage cans to on-air broadcasting, including news and sporting events. Mark was very athletic in school, however, after a sports injury sidelined his sports career he became very interested in the arts. He developed his artistic side painting in acrylics, watercolors, pen and ink, oils, winning several local juried art shows. At the same time, he was also writing short stories and experimenting with acting and the inner workings of the movie industry. Mark graduated from Penn State and worked in radio - selling advertising, doing voice-overs and writing copy. He also began his modeling career in print and local television commercials. Shortly thereafter, he was accepted into law school and three years later graduated from Ohio Northern Law School. While attending law school, Mark was hired by the theater department to develop campaigns, and promote and advertise theatrical productions. He was also the house manager and became a mainstay in the theater department. law, he continued to write copy and announce sporting events on the radio for his father at night. Mark was also very involved in the community, coaching several sports and volunteering for several organizations. He was chairman of the Young Lawyers Division of the local bar association. During this time, Mark used his expertise in broadcasting, media and his coaching skills and applied everything to the organizations he was involved in, but mostly toward his bar association duties. In 2001-2002, all of Mark's efforts came together when he created a program called \"Legal Eagles.\" The program, which brought professionals from various fields into the school districts to speak with the students, became recognized locally, by the state and nationally earning him accolades from various governors of Pennsylvania and two former U.S. presidents (Clinton and Bush). The American Bar Association ranked the program in the top 10 of public service programs in the 50 states in all U.S. Territories. The program continues today but on a limited basis due to Mark investing more time into his creative ventures - photography for the local newspaper, acting (locally and throughout the mid-Atlantic states), working as an extra in educational films, feature films and made-for-TV movies. Mark's younger brother, passed away in 2017.::Mark Falvo", "trade mark": " ", "trivia": ["Mark Falvo became the youngest Head Coach for Clearfield Senior Little League in 1978, when he was 18 years old, coaching players that were aged 13-15 years old. Falvo has coached in some capacity, whether it be head coach or assistant coach since 1978 when took over as an 18 year old head coach. He has coached all levels of baseball from T-Ball to Senior Little League (now Babe Ruth). Falvo has also coached girl's softball, while coaching baseball. Falvo has coached several All-Star Teams as well as Championship Teams since 1978.", "In 1990, Mark, who became a new member of the Clearfield County Bar Association (Clearfield, PA) developed and implemented a \"mentoring\" program for local high school students to chose a \"mentor\" and work with that particular attorney. The \"mentoring\" program was not very successful locally, but, Mark was also a Member of the Board of Directors of Penn State DuBois Alumni Society and developed the program for the University. It became a success with former local alumni of Penn State DuBois in the DuBois Community and is still a success today with students and alumni.", "Mark was honored by the US Congressman William F. Clinger of the US Congress (Congressional Record), State Representatives (Rep. Herman) and State Senator (Corman) for his hard work and dedication to the citizens of Central Pennsylvania for his work helping the Pennsylvania State Police (namely, Trooper William F. Madden of the Rockview Barracks in PA) and local FBI for aiding in the investigation of finding and apprehending an escaped murderer and his accomplishment in 1988. He was also given credit for helping \"Unsolved Mysteries\" with their research and many communications among the parties involved in the investigation and \"Unsolved Mysteries\" in 1988."], "filmography": ["Unsinkable ()", "Leaf Me Alone ()", "Zombiemom ()", "Wonder Woman 1984", "Mank", "The Trial of the Chicago 7", "Homeland", "Law & Order: Special Victims Unit", "BulletProof Cowboys", "Dark Waters", "The Irishman", "Joker", "Mindhunter", "Men in Black: International", "The Lonesome Trail", "Loophole", "Glass", "The Christmas Chronicles", "Creed II", "House of Cards (2014-2018)", "One Dollar", "Junior Chainz", "Paterno", "The Perfect Suspect (2017-2018)", "The Catcher Was a Spy", "Den of Thieves", "Outsider", "The Post", "Gone", "Last Flag Flying", "Molly's Game", "The Upside", "American Made", "Logan Lucky", "Outsiders (2016-2017)", "Logan", "Fences", "Hidden Figures", "The Founder", "Patriots Day", "The Sultan and the Saint", "The Accountant", "Jackie", "Sully", "Suicide Squad", "Ghostbusters", "The American West", "NASCAR: The Rise of American Speed", "The Nice Guys", "Banshee", "Tri", "Captain America: Civil War", "Batman v Superman: Dawn of Justice", "Mercy Street", "Criminal Activities", "Creed", "The Big Short", "Concussion", "My All-American", "Love the Coopers", "The Last Witch Hunter", "Fathers & Daughters", "I Saw the Light", "Black Mass", "Spotlight", "Pups United", "The Making of the Mob", "American Genius", "Southpaw", "Veep (2012-2015)", "Run All Night", "McFarland, USA", "The Bronze", "The Judge", "Guardians of the Galaxy", "The World Wars", "Foxcatcher", "The Fault in Our Stars", "Draft Day", "Spirit in the Woods", "Captain America: The Winter Soldier", "American Hustle", "The Wolf of Wall Street", "Hell at Heathridge", "Out of the Furnace", "Young Harvest", "Now You See Me", "Lovestruck: The Musical", "42", "Olympus Has Fallen", "Jack Reacher", "Promised Land", "The Men Who Built America", "Here Comes the Boom", "Lincoln", "Stand Up Guys", "Silver Linings Playbook", "Argo", "The Dark Knight Rises", "Super 8", "The Avengers", "Moneyball", "Warrior", "The Ides of March", "Awakenings", "Super 8", "The Next Three Days", "Unstoppable", "The Town", "Leap Year", "Law Abiding Citizen", "Public Enemies", "The Taking of Pelham 123", "The Express", "Fred Claus", "American Gangster", "Live Free or Die Hard", "Zodiac", "Rocky Balboa", "We Are Marshall", "The Departed", "Invincible", "The Break-Up", "Glory Road", "Cinderella Man", "Fever Pitch", "Friday Night Lights", "Gods and Generals", "Signs", "The Sum of All Fears", "The Rookie", "61*", "Remember the Titans", "For Love of the Game", "The Sixth Sense", "Runaway Bride", "Enemy of the State", "The Waterboy", "Gotti", "Twister", "Happy Gilmore", "Apollo 13", "Banshee", "Gettysburg", "Rudy", "Hoffa", "Bull Durham", "Unsolved Mysteries", "Hoosiers", "The Natural", "All the Right Moves", "Slap Shot"]}