{"name": "Chris Muto", "current role": "Caterer", "birth name": " ", "birth date": "1977-03-03", "birth place": "USA", "height": "6' (1.83 m)", "biography": "Chris Muto was born and raised in upstate New York. He started out professionally modeling in New York and Milan. After working with various top fashion designers including Tommy Hilfiger, Prada and Zegna, Chris moved to Los Angeles to transition into acting. In 2005 he landed his first on-screen job on Days of Our Lives playing opposite Allison Sweeney. Following this, he landed his first stage role in The Graduate. Next came the lead in the play Brooklyn USA, and soon after that, he performed as the lead in Blinded. He has also landed several national commercials including McDonald's, Walmart, Gateway, Charter Communications, Craftsman, NFL and Discover Card, which was directed by Peter Berg. He recently recurred on ABC's hit drama Grey's Anatomy playing Nurse Michael. Chris was cast again by Shonda Rhimes in Scandal. He continues to work with ABC as he recurs on the hit soap opera General Hospital. Chris has frequently worked with director Armand Mastroinni in several TV Movies and actor James Remar in Dexter, Sharpshooter and Decommissioned. You can catch him playing opposite Robert Patrick and Bruce Davison in the hit indie drama Last Rampage on Netflix. Chris landed a role on CBS' pilot The Get, which Stars Amy Brenneman and Brad Garrett. You can catch him this year in the Amazon hit series Bosch. He has worked opposite some of Hollywood's top actors such as Ryan Gosling in Drive. Chris continues to work hard, writing and producing his own pilots, as well as starring in the multi award winning web series Frank James.::AP", "trade mark": " ", "trivia": ["In 2005, first break on television was a role on Days of Our Lives.", "Started acting in 2005, making the transition from modeling to acting.", "Moved to Los Angeles in 2000. Landed a national print campaign ad for Rembrandt toothpaste.", "Has modeled for Prada, Tommy Hilfiger and Zegna.", "Started professionally modeling out of high school. Landed first modeling job with Seventeen Magazine. Modeled in Milan, represented by Why Not Modeling Agency.", "Turned down full ride scholarships from Division 1 Sacred Heart University in basketball and football.", "One of Frankfort-Schuyler High School's all time leading scorers in basketball with 1021 career points."], "filmography": ["Coming Home ()", "Frank James (2020-2021)", "Bosch", "General Hospital (2019-2020)", "The Orville", "Hey Jersey", "The Get", "Grey's Anatomy (2015-2017)", "The Last Rampage", "The Saint", "Scandal", "Accidental Reality Star", "The Neon Demon", "Decommissioned", "Moctress", "Persecuted", "Zen Lady", "My Roommate the", "Grow", "Island Song", "Tagged", "Dark Desire", "Brothers", "The Finalist", "Drive", "Perils of an Active Mind", "Citizen Jane", "Sharpshooter", "Dexter", "Days of Our Lives"]}