{"name": "Aiden Flowers", "current role": "Young Michael Burry", "birth name": " ", "birth date": "2004-12-13", "birth place": "Gulfport, Mississippi, USA", "height": "5' 7\" (1.7 m)", "biography": "Aiden James Flowers was born on December 13, 2004, in Gulfport, Mississippi. From a very young age, anytime Aiden was asked what he wanted to be when he grew up, he always responded, \"I want to be an actor.\"After he and his family relocated to Brandon, MS, Aiden officially began making his acting dream come true. In his first ever audition, he was cast in the supporting role of Peter Pinkerton in the musical adaptation of Victoria Kann's \"Pinkalicious,\" a role for which he would later win, \"Best Supporting Youth Actor,\" for the 2012 Actor's Playhouse season. Later in 2012, Aiden was asked to audition at New Stage Theatre in Jackson, MS for their much-celebrated Christmas production, and was cast as the lead role of Buddy in Truman Capote's, \"A Christmas Memory,\" which ran November 29th - December 16th of that year.Aiden quickly turned his attention to feature films where he landed role after role, acting alongside such Hollywood stars as Arnold Schwarzenegger, Abigail Breslin, Katherine Heigl, Patrick Wilson, and John Schneider. He has flown coast to coast working on films and television from Tampa, FL to Los Angeles, CA and everywhere in between. He has spread his wings outside of the US working under the direction of Tim Burton in London, England while filming 'Peregrine's Home for Peculiar Children'.Aiden's fan base though, mostly recognizes him for his recurring portrayal of Young Klaus on the CW's \"The Originals\". Here is where he met Joseph Morgan and Danielle Campbell; two actors who he looks up to and respects not only for their acting talents, but also for their humble nature and kind spirits.Aside from acting, Aiden enjoys spending time with friends and family, writing stories, playing video games, and is also a solid student where he is in 'Venture' (gifted program) at his local school.::A. Flowers", "trade mark": " ", "trivia": ["Aiden is 17 months older than his twin little sisters, Camden Flowers and Carsen Flowers, who appear with him in the film, 2 Bedroom 1 Bath (2014).", "Best friends with Kennedy Brice, who he met on the set of \"June.\".", "Is transformed into an animated character for his role as the face of Hollywood South.", "Got stuck in an elevator for twenty minutes at his first fan event at the Mystic Grill in Covington, GA.", "Member of the Mississippi Brat Pack alongside Stella Allen, Cannon Bosarge, Reagan Bosarge, Brady Permenter, Camden Flowers, Carsen Flowers, and Emerson Rhinewalt."], "filmography": ["Hypnotized ()", "Robin: Watch for Wishes", "The Originals (2014-2017)", "Miss Peregrine's Home for Peculiar Children", "Race to Win", "Abattoir", "Smothered", "The Birth of a Nation", "The Big Short", "June", "Maggie", "A Gift Horse", "Home Sweet Hell", "2 Bedroom 1 Bath", "Salem"]}