{"name": "Bernie Mac", "current role": "Frank Catton", "birth name": "Bernard Jeffrey McCullough", "birth date": "1957-10-05", "birth place": "Chicago, Illinois, USA", "height": "6' 2½\" (1.89 m)", "biography": "Bernard Jeffrey McCollough was born in 1957 in Chicago, the son of Mary McCullough and Jeffery Harrison. He grew up in the city, in a rougher neighborhood than most others, with a large family living under one roof. This situation provided him with a great insight into his comedy, as his family, and the situations surrounding them would be what dominated his comedy. Mac worked in the Regal Theater, and performed in Chicago parks in his younger days. He became a professional comedian in 1977, at the age of 19. He refused to change his image for television and films, and therefore was not very well known for most of the eighties. In 1992 he made his film debut with a small part with Mo' Money (1992). This started a plethora of small parts in a string of movies, mostly comedies, including Who's the Man? (1993), House Party 3 (1994) and The Walking Dead (1995). 1995 proved to be a turning point in his career. He did an HBO Special called Midnight Mac (1995), and took a part as Pastor Clever in the Chris Tucker comedy Friday (1995). Bernie Mac developed a cult following due to the film. In 1996. he starred in the memorable Spike Lee movie Get on the Bus (1996), and was very funny in Don't Be a Menace to South Central While Drinking Your Juice in the Hood (1996). About this time he had a recurring role in the TV series Moesha (1996). Bernie Mac's star was slowly rising from this point. His next couple of movie parts were more substantial, including How to Be a Player (1997) and The Players Club (1998). In 1999 Bernie Mac got his most high profile part up to that point in the film Life (1999) starring Eddie Murphy.The new century started a new era for the brash Chicago comedian. He was a featured comedian in The Original Kings of Comedy (2000). This performance made him more of a household name, and led to many more major parts. In 2001 he played Martin Lawrence's uncle in What's the Worst That Could Happen? (2001) and later that year, was in the star studded remake of Ocean's Eleven (2001). However his biggest success was The Bernie Mac Show (2001), which debuted in 2001 to instant acclaim. However, soon after the series ended, Mac's health took a turn for the worse. He developed sarcoidosis, an autoimmune disease which causes inflammation in the lungs. On August 9, 2008, after weeks of unsuccessful treatments, Bernie Mac died at Northwestern Memorial Hospital in Chicago. He was 50.Bernie Mac was a comedian who refused to change his image for Hollywood and said that his life in Chicago was who he was, and there was nothing that could change that. He was a mature comedian who was very intelligent and engaging in his television, film and stand-up appearances.::Scott msa0510@mail.ecu.edu.", "trade mark": "Wore a hat at least once in almost all of his films", "trivia": ["Started his career in stand-up comedy in 1977. His first professional comedy gig was at The Cotton Club in Chicago. He was so broke, he had to borrow a suit from his brother.", "His daughter, Je'Niece McCullough, was born in 1978. She has a master's degree in mental health counseling. She also had a daughter who was born in 2006.", "His mother and both siblings died before he did. His mother died of breast cancer his sophomore year of high school. One brother died as a baby, the other died of a heart attack in his 20s.", "He used to be a boxer.", "His character on The Bernie Mac Show (2001), was ranked #47 in TV Guide's list of the \"50 Greatest TV Dads of All Time\" [20 June 2004 issue].", "Is mentioned in Christina Aguilera's single Dirrty.", "February 2005 - revealed that he had suffered from sarcoidosis, an inflammatory lung disease, since 1983. He said it had no effect on his daily life.", "Is seen getting a pedicure in both Ocean's Twelve (2004) and Bad Santa (2003).", "Sampled on Prince's song, \"Pope\", from his appearance on Russell Simmons' Def Comedy Jam (1992). Prince's song can be found on his 1993 album \"The Hits\".", "He was hospitalized with pneumonia on August 1, 2008. False rumors of his death spread widely. His publicist, Danica Smith insisted he would make a full recovery. Unfortunately, Mac took a turn for the worst. He died August 9, 2008, from complications of pneumonia.", "He was in two movies that opened on the same day in the U.S. Madagascar: Escape 2 Africa (2008), and Soul Men (2008) both opened November 7, 2008.", "He was a close friend of Robin Harris.", "Release of his book, \"Maybe You Never Cry Again\". [2003]", "Release of his book, \"I Ain't Scared of You: Bernie Mac on How Life Is\". [2001]", "Starred in Soul Men alongside Isaac Hayes. Hayes died on August 10th, 2008 the day after Bernie's death 9th August, 2008.", "Cousin of Kimberly Bonner.", "Son-in-law of Mary Simmons.", "Friends with Chris Rock, Cedric the Entertainer, D.L. Hughley, Joe Torry, and Steve Harvey."], "filmography": ["Old Dogs", "Starting Under", "Soul Men", "Madagascar: Escape 2 Africa", "Transformers", "Ocean's Thirteen", "Pride", "The Bernie Mac Show (2001-2006)", "Inspector Gadget's Biggest Caper Ever", "Guess Who", "Lil' Pimp", "Ocean's Twelve", "Mr 3000", "Bad Santa: Outtakes", "Bad Santa", "Charlie's Angels: Full Throttle", "King of the Hill", "Head of State", "Ocean's Eleven", "What's the Worst That Could Happen?", "Moesha (1996-1999)", "Life", "The Players Club", "Don King: Only in America", "How to Be a Player", "B*A*P*S", "Booty Call", "The Wayans Bros.", "Reasons", "Get on the Bus", "Don't Be a Menace to South Central While Drinking Your Juice in the Hood", "Friday", "The Walking Dead", "Above the Rim", "House Party 3", "Who's the Man?", "Mo' Money"]}