{"name": "Barry Brandt", "current role": "Technician #1", "birth name": " ", "birth date": " ", "birth place": " ", "height": "6' (1.83 m)", "biography": "Barry Brandt is known for his work on Parker (2013), Ocean's Eleven (2001) and Miami Heat.::Anonymous", "trade mark": " ", "trivia": ["His father's ancestry was from Germany and Ireland. His mother's ancestry was from the Ukraine and Ireland. His mother (Olga Maria Veronica Brandt) and father (Robert Emmet Joseph Brandt) were born and raised in the City of Brotherly Love aka Philadelphia, Pennsylvania.", "Robert (Bobby) Red's Brandt taught, trained, mentored, and educated Barry on the systems, forms, styles, techniques, rhythm, synchronicity, hand coordination, eye coordination, conditioning, stamina, and footwork of boxing. Barry is nicknamed the Body Snatcher for his phenomenal ability to punish, pulverize, and annihilate his opponents body inside and outside of the ring.", "Barry's father, Robert (Bobby) Red's Brandt, was a professional boxer that fought in Madison Square Garden, J.F.K. Stadium, and many other venues across the U.S.A. Robert (Bobby) Red's Brandt also attended and graduated with a Bachelor of Arts (BA) degree in Accounting from Temple University in Philadelphia, Pennsylvania.", "Served as a Local Board Member with the Legacy AFTRA Miami Local Board from 2009-2012, and also served as a Board Member-At-Large and Convention Delegate/Alternate National Board Member with the SAG-AFTRA Miami Local Board from 2012 onward. Barry has created, designed, developed, formulated, pitched, and proposed numerous Convention Resolutions for the 2013, 2015, 2017, and 2019 SAG-AFTRA National Conventions.", "Attended and graduated with a Bachelor of Arts (BA) degree in Performing Arts (Film, Television, and Theatre) from the University of Hawaii at Manoa in Honolulu, Hawaii.", "Attended and graduated with a high school diploma from McKinley High School in Honolulu, Hawaii.", "Barry is highly trained in using automatic and semi-automatic pistols, rifles, firearms, weapons, and has a current and valid Carrying Concealed Weapons (CCW) permit and license.", "His certifications from the American Red Cross include lifeguard/professional rescuer, water safety instructor, first aid, and AED/CPR for the Professional Rescuer (adult, child, infant).", "Studied and trained in modern dance, movement, and musical theatre with Merium (Mimi) Wisnosky at Kapiolani Community College in Honolulu, Hawaii.", "Studied and trained in voice, breathing, resonation, projection, diction, notation, and musical theatre with Lina Doo at Kapiolani Community College in Honolulu, Hawaii.", "Studied and trained in stage combat, unarmed combat, sword fighting, quarterstaff fighting, stick fighting, Tai Chi Chu'an, and movement with Gregory Hoffman. Hoffman is the Founder and former President of Dueling Arts International (DAI).", "Studied and trained in method acting, improvisation, scene study, scansion, voice, and movement with Sandra Perez at Kapiolani Community College in Honolulu, Hawaii.", "Barry teaches his Masked Acting, Thespians Breaking Free, and Physicality: The Methodology of Nonverbal Communication workshops and classes at various colleges, universities, and conservatories throughout many cities in the USA as well as abroad."], "filmography": ["Boxed ()", "Scales of Balance", "Betty en NY", "Sleepless", "Ruta 35", "Spy Land", "The Trisket", "Semper Paratus", "The Dive", "Burn Notice", "The Fugitive Chronicles", "The Grand", "Lost", "North Shore", "Tides of War", "Haunted", "Spy TV", "Ocean's Eleven", "Me, Myself & Irene", "The Strip", "Come On, Get Happy: The Partridge Family Story", "For Love of the Game", "The Debtors", "Snow Falling on Cedars", "The Breaks", "Hollywood Safari", "Girl", "Love Boat: The Next Wave", "Bikini Traffic School", "Dilemma", "Dogtown", "413 Hope St.", "Fathers' Day"]}