{"name": "Casey Groves", "current role": "Fund Manager", "birth name": " ", "birth date": " ", "birth place": " ", "height": " ", "biography": "Casey's television credits include roles on 'Law & Order,' 'Damages,' 'As the World Turns,' and recurring roles on the ABC series, 'Astronaut Wives Club,' and on 'One Life to Live.' He has played film roles recently in 'LBJ,' 'The Big Short,' 'Life at These Speeds,' & 'I Saw the Light.' In the summer of 2015, Casey played supporting lead roles in the feature films, 'A Quiet Storm' & 'Help! My Gumshoe's an Idiot;' and he played lead roles in the short films 'Noir'leans,' 'The Clock,' 'Shape Matters,' and 'The Miles Were Many' which are Official Selections of the New Orleans Film Festival.He has appeared in several productions at the Shakespeare Theatre in Washington, DC and has had two successful Off Broadway productions and a national tour of the one man play, 'Damien.' He wrote a one man play called 'Seelos: Doctor of Souls' which he toured nationally in 2013 and which was nominated for a Big Easy Award for best original theater script. The filmed version of the Seelos play aired on WYES, the New Orleans PBS affiliate station throughout the fall of 2014. He appeared in 'Merry Wives' and in 'Romeo and Juliet' with the Shakespeare Festival at Tulane in 2013. He was nominated in 2014 for a Big Easy Award for Best Actor for his portrayal of the title character in the play, 'Lombardi,' at Le Petit Theatre. He played the role of Jim Tyrone in O'Neill's 'A Moon for the Misbegotten' with Inner Compass Theatre in New Orleans in January of 2014. He played the role of Dysart in 'Equus' with Promethean Theatre Co. in March of 2014 and Antonio in 'The Tempest' with Promethean this summer. He played Charley in 'Death of a Salesman' with Le Petit Theatre last May. He is a full time talented theater teacher at Grace King High School, and an adjunct theater professor at Delgado Community College. He directed 'The Skin of Our Teeth' at Delgado this spring. Casey has his BFA from the College of Santa Fe in New Mexico and his MFA in Acting and Playwriting from Goddard College in Vermont. He has trained at the Royal Academy of Dramatic Arts and the British American Drama Academy in London.\"The unevenness of the acting is sometimes distracting, especially any time that Casey Groves (who plays Censor, Beaufort's counselor and the sanest character in the tale) is around, because he's so much better than everyone else.\" The New York Times- a review of the Off Broadway production of 'The Witlings.'\"::Casey Groves", "trade mark": " ", "trivia": " ", "filmography": ["With One Mind ()", "Shape Matters", "Bitter Rose", "Easy Does It", "Hot Date", "Cloak & Dagger", "Gumshoe!", "1 Mile to You", "If You Can't Fly, Then Run", "A Quiet Storm", "LBJ", "The Big Short", "I Saw the Light", "The Astronaut Wives Club", "The Miles Were Many", "Seelos: Doctor of Souls", "Fourth Date", "One Last Chance", "The Clock", "Under the Gun", "Keys to Happiness", "Almaz", "Damages", "Law & Order", "One Life to Live (2004-2008)"]}