{"name": "Jackie Earle Haley", "current role": "George Noyce", "birth name": "Jack Earle Haley", "birth date": "1961-07-14", "birth place": "Northridge, California, USA", "height": "5' 5½\" (1.66 m)", "biography": "Jackie Earle Haley was born on July 14, 1961 in Northridge, California, USA as Jack Earle Haley. He is an actor and director, known for Watchmen (2009), Little Children (2006) and A Nightmare on Elm Street (2010). He has been married to Amelia Cruz since August 6, 2004. He was previously married to Jennifer Hargrave and Sherry Vaughan.::Anonymous", "trade mark": "Blue-tinted glasses", "trivia": ["Was number 87 on VH1's The Greatest: 100 Greatest Kid Stars (2005).", "Was actually only 17 years old when he played 19-year-old Moocher in Breaking Away (1979); he was the only teenager of the group, as co-stars Dennis Christopher, Dennis Quaid and Daniel Stern were all in their twenties.", "Met his third wife, Amelia Cruz, in San Antonio, Texas.", "Initially a late 1970s teen character star who played tough, angry, pimply misfit types, notably in The Bad News Bears (1976) and Breaking Away (1979).", "His father Haven Earle Haley was a radio show host and actor.", "Began appearing in television commercials at age 6.", "Has earned rave reviews in 2006 in an unanticipated comeback with his roles in All the King's Men (2006) and Little Children (2006). Having not done a movie since 1993 and moonlighting here and there as a commercial director, limousine driver, furniture refinisher, security officer and pizza deliverer in Texas, Haley happened to be \"just remembered\" for his earlier films by director Steven Zaillian for his role in All the King's Men and the ball started rolling.", "Has two children: Chris Haley (born 1986) and Olivia Haley (born 1998).", "Has co-starred opposite Kate Winslet in both of his 2006 return-to-acting film appearances: Little Children (2006) and All the King's Men (2006).", "Is one of 115 people invited to join the Academy of Motion Picture Arts and Sciences (AMPAS) in 2007.", "Has a black belt in Kempo and Tae Kwon Do. (http://www.craveonline.com/site/147512-jackie-earle-haley-is-rorschach).", "In 1984, his friend Johnny Depp accompanied him to the auditions for A Nightmare on Elm Street (1984). Instead of being chosen for a role, it was Depp who was spotted by director Wes Craven, who asked him if he would like to read for a role. However, Haley would go on to play Freddy Krueger in the remake 26 years later (A Nightmare on Elm Street (2010)).", "Haley starred in a failed pilot of \"Oh, No! Not THEM!\", an American remake of the British comedy \"The Young Ones\".", "Executive vice president for Shootz Production Group in San Antonio, Texas. [October 2001]", "Television producer/director and president of his production company, JEH Productions, Inc. in San Antonio, Texas (2007).", "Has appeared in two movies with Patrick Wilson: Little Children (2006) and Watchmen (2009).", "As a child, he often did imitations of Mae West and James Cagney.", "Attended and graduated from Canoga Park High School in Canoga Park, California."], "filmography": ["Death of a Telemarketer", "No Future", "Alita: Battle Angel", "Narcos: Mexico", "The Tick (2016-2018)", "The Dark Tower", "Preacher", "London Has Fallen", "The Birth of a Nation", "Criminal Activities", "The Evil Within", "RoboCop", "Parkland", "Lincoln", "Dark Shadows", "Human Target (2010-2011)", "Louis", "A Nightmare on Elm Street", "Shutter Island", "Watchmen: The End Is Nigh", "Watchmen", "Fragments", "Semi-Pro", "All the King's Men", "Little Children", "Prophet of Evil: The Ervil LeBaron Story", "Nemesis", "Maniac Cop 3: Badge of Silence", "Renegade", "Dollman", "Get a Life", "Gravedale High", "Oh, No! Not THEM!", "Murder, She Wrote", "MacGyver", "The Zoo Gang", "Whiz Kids", "Losin' It", "American Playhouse", "Every Stray Dog and Kid", "Breaking Away (1980-1981)", "Insight", "The Love Boat", "Breaking Away", "The Bad News Bears Go to Japan", "Damnation Alley", "The Bad News Bears in Breaking Training", "The Bad News Bears", "The Waltons", "The Day of the Locust", "Shazam!", "Planet of the Apes", "Valley of the Dinosaurs", "Docteur Marcus Welby", "The Partridge Family", "The Outside Man", "Wait Till Your Father Gets Home", "The Carol Burnett Show"]}