{"name": "Lance Armstrong", "current role": "Self", "birth name": "Lance Edward Gunderson", "birth date": "1971-09-18", "birth place": "Dallas, Texas, USA", "height": "5' 9½\" (1.77 m)", "biography": "Lance Armstrong was born on September 18, 1971 in Dallas, Texas, USA as Lance Edward Gunderson. He was previously married to Kristin Richard.::Anonymous", "trade mark": " ", "trivia": ["His heart is one-third larger than normal.", "Named Sports Illustrated's Sportsman of the Year. [2002]", "He has never met his father, Edward Gunderson, and has not expressed an interest in doing so. He was adopted by his stepfather, Terry Armstrong.", "Won the Iron Kids Triathlon at 13, and became a professional triathlete when he was 16.", "His children were conceived with sperm that Armstrong banked before he began chemotherapy for testicular cancer.", "Announced separation from wife Kristin. [February 2003]", "Son Luke David born (12 October 1999)", "Twin girls Isabelle Rose weighing 5lbs 12oz and Grace Elizabeth weighing 5lbs 2oz born (20 November 2001)", "Reconciled with wife Kristin Armstrong. [June 2003]", "Filed for divorce from wife Kristin (September 2003)", "Was with United States Postal Service from 1998-2004, before that he was with Team Motorola.", "Became the second man to win the Tour de France five times in the row. Joined other five-time Tour de France winners Jacques Anquetil, Bernard Hinault, Eddy Merckx and Miguel Induráin when he won the 2003 Tour de France. The following year he beat them all by becoming the only man to win the Tour six times.", "Winner of the Tour de France in 1999, 2000, 2001, 2002, 2003, 2004 and 2005. He was stripped of these titles in 2012 due to doping allegations.", "Rode with Team Discovery Channel during the 2005 Tour.", "Winner of the ESPY award for Best Male Athlete twice (2004) and (2005)", "Is a good friend of actor and cycling fan Robin Williams who usually visits him during Tour de France", "Lives in a mansion in Spain part of the year. The estate was originally several separate apartments, which he bought and had renovated into a house.", "Through his foundation, has sold yellow \"Live Strong\" bracelets to raise money for cancer research. He has sold over 40 million of them worldwide at $1 each.", "Armstrong's \"Tour de Lance\" (i.e., winning his first Tour de France on 25 July 1999) was ranked #1 in TV Guide's list of the \"25 Most Awesome Sports Moments (of the last 15 years)\". [17 July 2005 issue]", "Announced he was retiring after the Tour De France 2005. He ended his career by winning his seventh Tour De France, which has never been done.", "Engaged to Sheryl Crow [September 5, 2005]", "Broke off engagement to Sheryl Crow [February 3, 2006].", "Won the ESPY Award for \"Best Male Athlete\" four consecutive times from 2003 to 2006. In 2006, he also hosted the show.", "Considers Eddy Merckx the greatest cyclist ever.", "Good friend of Matthew McConaughey, Tyler Hamilton and Jake Gyllenhaal.", "Seventh cousin of Katie Couric and Emily Couric, and sixth cousin of Hilary Duff and Haylie Duff.", "In 2006, he donated $500,000 to the Lance Armstrong Foundation.", "Son Max Armstrong (b. June 4th 2009). Mother is Anne Hansen.", "1993, became World Champion Cycling.", "2010, will be cycling for: Team Radio Shack from Forth Worth Texas, USA.", "On July 9, 2012, Armstrong filed a lawsuit in federal court in Austin, Texas against the United States Anti-Doping Agency, which a judge threw out later the same day.", "August 2012: All of his competitive results from August 1, 1998 through the present were deemed ineligible and were disqualified by the United States Anti-Doping Agency. This is as the result of his anti-doping rule violations stemming from his involvement in the United States Postal Service (USPS) Cycling Team Doping Conspiracy (USPS Conspiracy).", "Announced on The Oprah Winfrey Show (1986) that he plans to enter this year's Tour de France. [February 2005]", "finished 3rd at Le Tour De France after 3.5 year retirement from cycling [July 2009]", "Cycling team: Team Radio Shack. [January 2010]", "Won his seventh consecutive Tour de France and announced his retirement from professional cycling. [July 2005]", "Portrayed by Ben Foster in The Program (2015).", "In 2012, a United States Anti-Doping Agency investigation concluded that Armstrong had used performance-enhancing drugs over the course of his whole career.", "Was concluded guilty for using performance-enhancing drugs. As a result, he received a lifetime ban from competing in all sports that follow the World Anti-Doping Agency code-effectively ending his athletic career.", "Paid Kristin Richard $14 million for their divorce settlement.", "Son of Linda Armstrong Kelly."], "filmography": ["Tour de Pharmacy", "The Simpsons", "Dodgeball"]}