{"name": "Jeff Caperton", "current role": "Wall Street Journal Reporter", "birth name": " ", "birth date": " ", "birth place": " ", "height": "6' 2\" (1.88 m)", "biography": "Caperton is the Managing Partner and an Executive Producer at Bitter End Media Group in Los Angeles California which develops properties for feature films and documentaries. In 2016 Caperton and his partner Mark Burman produced \"Dog Eat Dog\", directed by 4 time Oscar winner Paul Schrader and starring fellow Oscar winners Nicolas Cage and Willum Defoe. \"Dog\" premiered worldwide at the \"Cannes International Film Festival\" and won the \"Directors Fortnight\" Award! \"Dog\" opened in theaters nationwide on November 8th.In the same year, this great duo also produced the multiple award-winning documentary \"South Bureau Homicide\" based on the Los Angeles Police Department's 77th Precinct. In September Sony Television signed a deal to develop \"South Bureau\" into a dramatic television series. Caperton and his team are currently developing several projects including a film based on the book \"Devils Soldier\" by Caleb Carr and have attached Oscar winning Director Antoine Fuqua.Also an actor, Caperton has appeared alongside such actors as Mark Wahlberg, Will Ferrell, Curt Russel, Kate Hudson, Tommy Lee Jones, Kevin Hart, Woody Harrelson, Brad Pitt, and many others in blockbuster films such as \"Deepwater Horizon\", \"The Big Short\", \"Daddy's Home\" and many more. Caperton also had a reoccurring part on \"NCIS New Orleans\" for two seasons.Caperton began his career in 1984 at ABC News in Los Angeles covering and producing stories for \"World News Tonight\", \"Nightline\", \"20/20\" and \"Good Morning America\". In 1986 Caperton won an Emmy Award and a Los Angeles Press Club Award for his coverage of the Mexico City Earthquake. Years later in 2015, Caperton's team produced the TV movie \"The Heart of Christmas\" which was nominated for an Emmy Award.Caperton is the Producer of the dramatic urban crime series \"Be Someone\" staring Tisha Campbell-Martin, Jamal Dennis, Khalil Kain and others which will premier in Fall 2021. He also makes a brief appearance in the show as Captain Johnson. After many years in Los Angeles, Caperton now lives in his hometown of Houston Texas.::Magan Hunt", "trade mark": " ", "trivia": " ", "filmography": ["Raquel's Legacy the Revenge", "Sponsors ()", "His Stretch of Texas Ground", "Raquel's Legacy ()", "Shayquethadoniss Johnson", "Be Someone", "Both Eyes Open", "Both Eyes Open", "The Last Laugh", "The First", "Apocalypse Rising", "Murder Made Me Famous", "Blaze", "Scandal Made Me Famous", "Trap Plane", "Shock and Awe", "Queen of the South (2016-2017)", "Mamma Dallas", "Quarry", "Deepwater Horizon", "LBJ", "When the Bough Breaks", "Scream: The", "Roots", "Elvis & Nixon", "11.22.63", "NCIS: New Orleans (2015-2016)", "Second Chance", "Extracurricular Activities", "Daddy's Home", "The Big Short", "I Saw the Light", "Zoo", "Pitch Perfect 2", "Get Hard", "Who's the Boss?", "Mr. Belvedere", "Remington Steele", "Moonlighting"]}