{"name": "Emily Mortimer", "current role": "Rachel 1", "birth name": "Emily Kathleen Anne Mortimer", "birth date": "1971-12-01", "birth place": "London, England, UK", "height": "5' 7½\" (1.71 m)", "biography": "English actress Emily Kathleen Anne Mortimer was born in Hammersmith, London, England, to writer and barrister Sir John Mortimer and his second wife, Penelope (née Gollop). She was educated at St Paul's Girls' School in West London, and it was whilst there she began acting. Mortimer moved on from school to Lincoln College, Oxford University, where she studied English Literature and Russian, and spent two terms at the Moscow Arts Theater Drama School, studying acting.While appearing in an Oxford University student production, Mortimer was spotted by a TV producer who cast her in an adaptation of Catherine Cookson' s The Glass Virgin (1995). She made her feature film debut in 1996 alongside Val Kilmer in The Ghost and the Darkness (1996). Roles in various projects have followed, including Elizabeth (1998), Love's Labour's Lost (2000), Match Point (2005), Lars and the Real Girl (2007), Shutter Island (2010) and Hugo (2011).During the making of Love's Labour's Lost (2000), Mortimer met her husband Alessandro Nivola. The couple have two children, Samuel and May.::Anonymous", "trade mark": "high meek voice", "trivia": ["Studied English & Russian at Lincoln College, Oxford (1990-1994). Daughter of John Mortimer and Penelope Gollop Mortimer.", "Has one younger sister, Rosie Mortimer.", "Gave birth to her son Samuel John Nivola, with husband Alessandro Nivola, at London's Portland Hospital, weighing in at 7lbs 10oz (26 September 2003).", "A Mexican punk band played at her wedding to Alessandro Nivola.", "Discovered an older half-brother, Ross Bentley, as a result of a past relationship between actress Wendy Craig and her father Sir John Mortimer. [September 2004]", "Lives in Los Angeles, California, USA. [2004]", "Attended St. Paul's Girls' School in London.", "Attended Moscow Arts Theatre School.", "The name of her mother, Penelope, was also the name of her father's first wife.", "Fluent in Russian", "Educated at the prestigious St Paul's Girls School in London. Was in the same class as fellow actress Rachel Weisz.", "Was chosen to voice the young Sophie in the English language version of Howl's Moving Castle (2004) because the producers felt that her voice resembled that of the young Jean Simmons, who voiced the old Sophie.", "Has two older half-siblings from her father's first marriage, Sally Silverman and Jeremy Mortimer.", "Gave birth to her daughter May Rose Nivola, with husband Alessandro Nivola, in New York City, via Caesarean section (15 January 2010).", "Her younger sister Rosie Mortimer gave birth to her son John just three days after Emily gave birth to her daughter May.", "Returned to work ten months after giving birth to her son Samuel in order to begin filming Match Point (2005).", "Returned to work six months after giving birth to her daughter May in order to begin filming Our Idiot Brother (2011).", "Was three months pregnant with her daughter May when she completed filming on Shutter Island (2010).", "Has become part of Martin Scorsese's acting company, working for him on three films.", "Lives in Brooklyn, N.Y. USA [December 2012]", "Auditioned for The Black Dahlia (2006).", "She bears a striking facial resemblance to Miranda Otto, who is Australian."], "filmography": ["The Pursuit of Love ()", "With/In ()", "Don't Look Deeper", "Relic", "Mary", "Good Posture", "Phil", "Lost Holiday", "Mary Poppins Returns", "Head Full of Honey", "One Cambodian Family Please for My Pleasure", "Write When You Get Work", "The Bookshop", "Broken Night", "The Party", "The Sense of an Ending", "Wig Shop", "Spectral", "Disney Infinity 3.0", "Doll & Em (2013-2015)", "Ladygrey", "Ten Thousand Saints", "The Newsroom (2012-2014)", "Disney Infinity: Marvel Super Heroes", "Rio, I Love You", "Disney Infinity", "Kinect Rush: A Disney-Pixar Adventure", "Hugo", "Cars 2: The Video Game", "Cars 2", "Our Idiot Brother", "Leonie", "Shutter Island", "Harry Brown", "City Island", "The Pink Panther 2", "Chaos Theory", "Redbelt", "Transsiberian", "Lars and the Real Girl", "30 Rock", "Rabbit Fever", "Paris, je t'aime", "The Pink Panther", "Match Point", "Howl's Moving Castle", "Dear Frankie", "Bright Young Things", "Young Adam", "The Sleeping Dictionary", "Nobody Needs to Know", "A Foreign Affair", "Jeffrey Archer: The Truth", "Formula 51", "Lovely & Amazing", "The Kid", "Il était une fois Jésus", "Love's Labour's Lost", "Scream 3", "Noah's Ark", "Killing Joe", "Notting Hill", "Cider with Rosie", "Elizabeth", "Coming Home", "A Dance to the Music of Time", "The Saint", "Midsomer Murders", "The Last of the High Kings", "The Ghost and the Darkness", "No Bananas", "Jack and Jeremy's Real Lives", "Lord of Misrule", "Silent Witness", "Ruth Rendell Mysteries", "Sharpe", "Screen Two", "The Glass Virgin", "Under the Hammer"]}