{"name": "Wladimir Klitschko", "current role": "Boxing Opponent", "birth name": "Wladimir Wladimirovich Klitschko", "birth date": "1976-03-25", "birth place": "Semipalatinsk, Kazakh SSR, USSR [now Semey, Kazakhstan]", "height": "6' 6\" (1.98 m)", "biography": "Wladimir Klitschko was born on March 25, 1976 in Semipalatinsk, Kazakh SSR, USSR as Wladimir Wladimirovich Klitschko. He is an actor, known for Ocean's Eleven (2001), Pain & Gain (2013) and Devotion.::Anonymous", "trade mark": " ", "trivia": ["WBO heavyweight champion (2000-).", "Younger brother of Vitali Klitschko, former WBO heavyweight champion, and companion of István Kovács, WBO featherweights champion.", "Former WBO Heavyweight Champion (2000-2003).", "Lost WBO Heavyweight title by way of knockout to Corrie Sanders (2003).", "Speaks 4 languages: Russian, Ukranian, German and English.", "His highest achievement in the amateur ring was the gold medal he received for winning the Super Heavyweight title at the Olympic games (Atlanta, USA, 1996).", "Received his doctorate in sports science and philosophy from the University of Kiev, Ukraine in January 2001.", "He and his brother, Vitali, grew up as the sons of a helicopter pilot in the Soviet Union's armed forces.", "Was in a relationship with Hayden Panettiere from 2009 to 2018; they got engaged from 2013 to 2018.", "Currently residing in both Los Angeles, USA and Hamburg, Germany. [January 2005]", "Mannheim Germany, beat IBF world champion Chris Byrd. [April 2006]", "New York, beat Sultan Ibragimov in the first unification fight since 1998 (Lennox Lewis vs Evander Holyfield). He is now holder of 2 world champion belts in the heavy weight division. [February 2008]", "Beat Ruslan Chagaev in a title fight before 61,000 at a soccer stadium in Gelsenkirchen, Germany. Chagaev was to fight Nikolay Valuev for the WBA title in May, but it was called off when doctors found Hepatitis-B antigens in his blood. But because the rules are different in Germany, he was allowed to fight Klitschko. [June 2009]", "It is also possible to transliterate his name as Vladimir Vladimirovich Klichko. The more recognizable spelling gets used because he settled in Germany.", "Became a first time father on December 9, 2014 when his fiancée (now ex-fiancée) Hayden Panettiere gave birth to their daughter Kaya Evdokia Klitschko she weighed 7 lbs 14 oz and was 20 in long at birth."], "filmography": ["Devotion ()", "Pain & Gain", "Zweiohrküken", "Chris Cornell: Part of Me", "Rabbit Without Ears", "Ocean's Eleven"]}