{"name": "Brad Pitt", "current role": "Ben Rickert", "birth name": "William Bradley Pitt", "birth date": "1963-12-18", "birth place": "Shawnee, Oklahoma, USA", "height": "5' 11\" (1.8 m)", "biography": "An actor and producer known as much for his versatility as he is for his handsome face, Golden Globe-winner Brad Pitt's most widely recognized role may be Tyler Durden in Fight Club (1999). However, his portrayals of Billy Beane in Moneyball (2011), and Rusty Ryan in the remake of Ocean's Eleven (2001) and its sequels, also loom large in his filmography.Pitt was born William Bradley Pitt on December 18th, 1963, in Shawnee, Oklahoma, and was raised in Springfield, Missouri. He is the son of Jane Etta (Hillhouse), a school counselor, and William Alvin Pitt, a truck company manager. He has a younger brother, Douglas (Doug) Pitt, and a younger sister, Julie Neal Pitt. At Kickapoo High School, Pitt was involved in sports, debating, student government and school musicals. Pitt attended the University of Missouri, where he majored in journalism with a focus on advertising. He occasionally acted in fraternity shows. He left college two credits short of graduating to move to California. Before he became successful at acting, Pitt supported himself by driving strippers in limos, moving refrigerators and dressing as a giant chicken while working for \"el Pollo Loco\".Pitt's earliest credited roles were in television, starting on the daytime soap opera Another World (1964) before appearing in the recurring role of Randy on the legendary prime time soap opera Dallas (1978). Following a string of guest appearances on various television series through the 1980s, Pitt gained widespread attention with a small part in Thelma & Louise (1991), in which he played a sexy criminal who romanced and conned Geena Davis. This led to starring roles in badly received films such as Johnny Suede (1991) and Cool World (1992).But Pitt's career hit an upswing with his casting in A River Runs Through It (1992), which cemented his status as an multi-layered actor as opposed to just a pretty face. Pitt's subsequent projects were as quirky and varied in tone as his performances, ranging from his unforgettably comic cameo as stoner roommate Floyd in True Romance (1993) to romantic roles in such visually lavish films as Interview with the Vampire: The Vampire Chronicles (1994) and Legends of the Fall (1994), to an emotionally tortured detective in the horror-thriller Se7en (1995). His portrayal of frenetic oddball Jeffrey Goines in 12 Monkeys (1995) won him a Globe for Best Performance by an Actor in a Supporting Role.Pitt's portrayal of Achilles in the big-budget period drama Troy (2004) helped establish his appeal as an action star and was closely followed by a co-starring role in the stylish spy-versus-spy flick Mr. & Mrs. Smith (2005). It was on the set of Mr. & Mrs. Smith that Pitt, who married Jennifer Aniston in a highly publicized ceremony in 2000, met Angelina Jolie. Pitt left Aniston for Jolie in 2005, a break-up that continues to fuel tabloid stories years after its occurrence.He continues to wildly vary his film choices, appearing in everything from high-concept popcorn flicks such as Megamind (2010) to adventurous critic-bait like Inglourious Basterds (2009) and The Tree of Life (2011). He has received two Best Actor Oscar nominations, for The Curious Case of Benjamin Button (2008) and Moneyball (2011). In 2014, he starred in the war film Fury (2014), opposite Shia LaBeouf, Logan Lerman, Jon Bernthal, and Michael Peña.Pitt and Jolie have six children, including two sons and a daughter who were adopted.::Anonymous and JJH", "trade mark": "Chiseled good looks", "trivia": ["Chosen by Empire magazine as one of the 100 Sexiest Stars in film history (#23) (1995).", "Turned down a role as an astronaut in Apollo 13 (1995) to accept his role in Se7en (1995).", "Posed for a campus calendar in college.", "A girl went to Pitt's Hollywood-area home shortly after midnight January 7, 1999 and crawled in through an open window, dressed herself in his clothes and stayed for 10 hours before the alarm went off. Athena Rolando, 19, was ordered not to contact the actor and to stay 100 yards away from him for three years (1999).", "Ranked #32 in Empire (UK) magazine's \"The Top 100 Movie Stars of All Time\" list. [October 1997]", "Banned from entering China because of his role in Seven Years in Tibet (1997) (1997).", "Chosen by People (USA) magazine as one of the 50 Most Beautiful People in the World (1997).", "(December 20, 1996) Engaged to actress Gwyneth Paltrow.", "Donated $100,000 to the Discovery Center - a children's learning museum in his hometown of Springfield, Missouri. [June 1996]", "Chosen by People (USA) magazine as one of the 50 Most Beautiful People in the World (1996).", "His first starring role in a feature film was in The Dark Side of the Sun (1988), shot in pre-war Yugoslavia during the summer of 1988. As editing neared completion, civil war broke out in the region and much of the footage was lost. In 1996, after a five-year search, all of the lost footage was found and returned to producer Andjelo Arandjelovic, who is working on getting a distribution deal. Pitt was paid $1,523 per week for seven weeks. He played a young American taken by his family to the Adriatic Sea to search for a cure for a rare skin disease.", "Purchased a mansion in Southern California from the actress who portrays Elvira, Mistress of the Dark (Cassandra Peterson). He reportedly paid $1.7 million for the house. This mansion is filled with antiques and has a \"vampirish\" look to it (1996).", "Resided in Southern California with friend Buck Simmonds, who starred with him in A River Runs Through It (1992). [May 1992]", "He was the third choice for the role of J.D. in Thelma & Louise (1991). William Baldwin, the first choice, left to star in Backdraft (1991).", "Had to learn to fly-cast for his role in A River Runs Through It (1992). He practiced on top of buildings in Hollywood. During these practices, he frequently hooked himself in the back of his head.", "Voted \"Best Actor\" by viewers of MTV's The Big Picture (1988) (1995).", "Was a journalism major in college with an advertising focus.", "Listed as one of twelve \"Promising New Actors of 1991\" in John Willis' Screen World, Vol. 43 (1991).", "Attended and graduated from Kickapoo High School in Springfield, Missouri (1982).", "Dropped out of the University of Missouri School of Journalism (Columbia, Missouri).", "In high school, he was a member of the golf, swim and tennis teams.", "Belonged to the Key Club and the Forensics Club in High School.", "Listed in People Weekly magazine's \"Most Intriguing People\" list (December 25, 1995/January 1, 1996 issue).", "Has a younger brother, Doug Pitt (born in 1966), and a younger sister, Julie Pitt (born in 1969).", "He was considered for the lead role in The Matrix (1999), which went to Keanu Reeves.", "Has his teeth capped.", "(July 18, 2001) Sued Damiani International, the company which created the wedding ring he gave Jennifer Aniston. According to Pitt, the ring was his design and was to be exclusive. The company has since been selling replicas and indicating Pitt/Aniston's endorsement of the ring.", "He and ex-wife Jennifer Aniston spent $1 million on their wedding (2000).", "For the last couple of years, he has been the spokesman for Edwin Jeans commercials in Japan. In 2001, he was also the face of the ads for a current Japanese canned coffee which is named Roots. Was replaced in these television commercials (2002) by Kevin Costner.", "Studied acting with the late Roy London.", "Did a television commercial for Toyota (Altis model) that aired only in Asia. The car became very popular and its sales resulted in Toyota getting an almost 32% share of the passenger car market.", "Has a home at Lake Mohawk in Sparta, New Jersey.", "Auditioned for the role of J.D. in the black comedy Heathers (1989) and, though he showed talent, casting directors thought him to be \"too sweet\" for the role, which later went to Christian Slater. He would later go on to a very similar role in the horror film Cutting Class (1989).", "Is a member of the Sigma Chi Fraternity. The Xi Xi chapter at the University of Missouri, Columbia.", "After watching Lock, Stock and Two Smoking Barrels (1998), Pitt asked director Guy Ritchie if he could be in his next film. He could not master the English accent, so Ritchie gave him the role of Mickey the One Punch Pikey, an Irish fighter, in Snatch (2000).", "With Brad Grey's departure for Paramount Pictures and after the divorce settlement with ex-wife Jennifer Aniston, he now solely owns Plan B Entertainment.", "Tore his Achilles tendon during the production of Troy (2004), in which he plays, coincidentally, Achilles. His injury caused the production of Ocean's Twelve (2004) to be pushed back to April 2004 (2003).", "Is the first man ever to be named \"Sexiest Man Alive\" twice by People magazine (1994 and 2000).", "He and ex-wife Jennifer Aniston campaigned in the United States to save EastEnders (1985) from being axed there (2003).", "Showed his parents the \"Chemical Burn\" scene to convince them not to watch Fight Club (1999).", "Got into better shape and eventually gained over 20 pounds of muscle for Troy (2004).", "Has appeared in three movies with the number seven in the title (Se7en (1995), Seven Years in Tibet (1997) and Sinbad: Legend of the Seven Seas (2003)). Has also appeared in three movies with the number twelve in the title (12 Monkeys (1995), Ocean's Twelve (2004) and 12 Years a Slave (2013)).", "He was ranked #6 on VH1's \"100 Hottest Hotties\".", "His high school nickname was Brad the \"Pitt-bull\".", "He took Greek language lessons in secret to surprise his then-wife Jennifer Aniston who is of Greek ancestry.", "Voted #1 in Company magazine's annual \"100 Sexiest Men\" poll (2004).", "His favorite movies are Planet of the Apes (1968), Saturday Night Fever (1977) and the Bosnian war film Remake (2003).", "Announced on January 7, 2005 that he and Jennifer Aniston are separating after 4 1/2 years of marriage.", "Was listed as a potential nominee on the 2005 Razzie Award nominating ballot. He was listed as a suggestion in the Worst Actor category for his performance in the film Troy (2004). However, he did not receive a nomination.", "Dianne Wiest is his favorite actress.", "Premiere magazine ranked him as #50 on a list of the Greatest Movie Stars of All Time in their Stars in Our Constellation feature (2005).", "A short while after completing A River Runs Through It (1992), he fled to Amsterdam where he briefly resided for three months by himself in a small basement apartment before returning to the United States to film Kalifornia (1993).", "He and his ex-wife Jennifer Aniston met on a blind date, which was arranged by their agent.", "He and his Ocean's Eleven (2001) / Ocean's Twelve (2004) co-stars, Julia Roberts, George Clooney and Elliott Gould, all have guest-starred on the sitcom Friends (1994), though not in the same episodes.", "Owns and plays Taylor Guitars.", "In 2001, renowned architect Frank Gehry renovated the wine cellar in the home in which Pitt and wife Jennifer Aniston resided. Pitt subsequently did an informal apprenticeship in Gehry's Los Angeles office.", "Owns the rights to the Hong Kong thriller Infernal Affairs (2002). He wanted it to be remade with he and Tom Cruise in the leading roles. The movie was eventually remade as The Departed (2006). Pitt served as a producer on the movie.", "On the invitation of Virgin CEO Richard Branson, he visited over 100 orphans affected by HIV at a facility run by The Salvation Army in South Africa as well as personally meeting Nelson Mandela and discussing Mandela's 46664 campaign (named for his prison ID number) to call attention to South Africa's devastating AIDS epidemic. After South Africa, he then flew to Ethiopia on behalf of DATA, a third-world lobby group co-founded by U2's Bono. [November 2004]", "As of 2014, has appeared in 10 movies with a number in the title - though only two of them use an actual number rather than spelling the word out: Se7en (1995), which is a combination of the two, and 12 Years a Slave (2013). He has appeared in one movie with zero in the title, one with the number two in the title, three with the number seven in the title, one with the number eleven and three with number twelve.", "Is a huge fan of MTV's reality show Jackass (2000). He even asked the cast if he could join them during one of their stunt jokes. He eventually made an appearance dressed in an ape outfit, in order not to be recognized, which would have ruined the joke.", "Raised in Springfield, Missouri, and is an alumni of Kickapoo High School. Other alumni include Adrienne Wilkinson and Jay Kenneth Johnson.", "Broke his arm during the filming of Se7en (1995). The injury was written into the movie.", "Adoptive father of Maddox Jolie-Pitt and Zahara Jolie-Pitt with Angelina Jolie.", "Wanted to play Darcy in Bride & Prejudice (2004), but was not able to work out the filming dates.", "Ranked #15 on Premiere magazine's 2006 \"Power 50\" list. Had ranked #31 (2005).", "Was considered for two roles which went to Johnny Depp: Ichabod Crane in Sleepy Hollow (1999) and Willy Wonka in Charlie and the Chocolate Factory (2005). Both were directed by Tim Burton.", "The first commercial that Brad Pitt ever booked was through Matrix Talent Agency, Los Angeles. His agent was Linda Olhava, sister of film director Jody Lee Olhava.", "Has Single Engine Land pilot license.", "Occasionally flies a Cessna 208B Caravan belonging to Chivan Productions.", "Initially did not want to appear in Mr. & Mrs. Smith (2005), although he was the one who gave the screenplay to director Doug Liman.", "Originally cast as Colin Sullivan in The Departed (2006), but later dropped out. He continued to produce the film under his (and his then wife Jennifer Aniston's) production company, Plan B.", "His first job was dancing in a chicken suit to draw in customers at an El Pollo Loco restaurant on Sunset Boulevard in Hollywood.", "He and girlfriend Angelina Jolie adopted a three-year-old boy named Pax Thien from Vietnam (born November 29, 2003). [March 2007]", "Made a cameo appearance with Matt Damon for free in Confessions of a Dangerous Mind (2002) as a favor to Ocean's Eleven (2001) co-star and close friend George Clooney - the film was Clooney's directorial debut.", "Has been in six movies where the title contains the name of the character he plays: Johnny Suede (1991), Meet Joe Black (1998), Sinbad: Legend of the Seven Seas (2003), Mr. & Mrs. Smith (2005), The Assassination of Jesse James by the Coward Robert Ford (2007) and The Curious Case of Benjamin Button (2008).", "He was considered for the lead role in Crimson Tide (1995), which eventually went to Denzel Washington.", "Voted #6 in Elle (France) magazine's \"15 Sexiest Men\" poll. [June 2007]", "Mentioned in the song \"High School Never Ends\" by Bowling for Soup, as \"the quarterback\".", "He was trained to handle weapons by renowned Hollywood gun coach Thell Reed, who has also trained such actors as Val Kilmer, Leonardo DiCaprio, Russell Crowe, Sam Elliot, Girard Swan, Ben Foster and Kurt Russell.", "He and Russell Crowe were director Ridley Scott's first two choices for the lead in American Gangster (2007). Crowe was eventually cast.", "Used to act at the Vandevort Theater in Springfield, Missouri. He still visits and donates to the theater.", "Donated five million dollars of his own money to rebuild homes in Katrina-ravaged New Orleans.", "In 2005, he earned $4,500,000 for a Heineken commercial that aired during the 2005 Super Bowl.", "In 2007, Forbes magazine estimated his earnings for the year to be $35 million.", "Is a patron of the Mineseeker Foundation and the Sole of Africa, a campaign dedicated to detecting and removing land mines in Africa. The Foundation's patrons include Nelson Mandela, Sir Richard Branson, Queen Noor, Graça Machel and John Paul DeJoria.", "Ranked #10 in the 2008 Forbes The Celebrity 100 list. His girlfriend, Angelina Jolie, ranked #3.", "In November 2005, he visited Pakistan with Angelina Jolie to see the impact of the 2005 Kashmir earthquake. In 2006, Jolie and Pitt also went to Haiti where they visited a school supported by Yéle Haïti, a charity founded by Haitian-born hip hop musician Wyclef Jean.", "Was officially in the BAFTA long-list for Best Actor in a Supporting Role for his performance in Babel (2006). However, he did not received the nomination.", "Considers One Flew Over the Cuckoo's Nest (1975), Fitzcarraldo (1982) and The Assassination of Jesse James by the Coward Robert Ford (2007) among his personal favorite movies.", "He auditioned for the role of Mike in Phantasm II (1988), but director Don Coscarelli instead chose James Le Gros.", "Along with Angelina Jolie, he traveled to Syria and Jordan on a United Nations Goodwill visit to displaced Iraqi civilians. [October 2009]", "Resides in Los Angeles, Malibu, Goleta, California, Benerville, France and New Orleans, Louisiana.", "Ex-son-in-law of John Aniston and Nancy Dow. Ex-stepson-in-law of Sherry Rooney.", "Has appeared in two films that took place in the Northwest during the first decades of the 20th Century, and in which he defends a Native American's right to be served alcohol in a bar: A River Runs Through It (1992) and Legends of the Fall (1994).", "When he and Juliette Lewis began their relationship in 1989, she was 16 years old while Pitt was 26. They met on the set of the TV movie Too Young to Die? (1990), in which they played a couple, and worked together again in Kalifornia (1993). They resided together and the relationship ended after four years, in 1993.", "He has English, some Scots-Irish/Northern Irish, and small and/or remote (to varying degrees) amounts of German, Scottish, Welsh, Irish, Swedish, Dutch, French, Cornish, and Channel Islander/Jersey, ancestry. His family has lived in the U.S. since the 1600s on many family lines. In 2012, Brad stated on Inside the Actors Studio (1994) that he might have Seminole and Cherokee roots. These lineages are unverified.", "The longest he has gone without an Academy Award nomination is 13 years, between 12 Monkeys (1995) and The Curious Case of Benjamin Button (2008).", "Owns multiple houses in ultra trendy Los Angeles neighborhood, Los Feliz. Giovanni Ribisi, Bo Barrett, Scarlett Johansson, Chris Pine, Ryan Reynolds, Mark Ruffalo, Kristen Stewart and Robert Pattinson are among the other actors who also call Los Feliz home.", "Girlfriend Angelina Jolie gave birth to the couple's second daughter, Shiloh Nouvel Jolie-Pitt, on May 27, 2006 in Namibia, Africa.", "Girlfriend Angelina Jolie gave birth to the couple's fifth and sixth children, son Knox Leon and daughter Vivienne Marcheline, on July 12, 2008 in Nice, France.", "Mentioned in the song Shania Twain: That Don't Impress Me Much (1998).", "As of 2019, has appeared in eight films that were nominated for the Best Picture Oscar: Babel (2006), The Curious Case of Benjamin Button (2008), Inglourious Basterds (2009), The Tree of Life (2011), Moneyball (2011), 12 Years a Slave (2013), The Big Short (2015) and Once Upon a Time... In Hollywood (2019). Of those, 12 Years a Slave (2013), won the Oscar in the category. In addition, Pitt produced the Oscar winning The Departed (2006).", "He appeared on the last episode of Jackass (2000), where the crew \"kidnapped\" him.", "(May 29, 2014) Was attacked by Vitalii Sediuk and a restraining order was issued, ordering him to stay away from Brad.", "Despite an announcement that they would only marry when gay marriage was legal in all American States, Brad Pitt and Angelina Jolie married in August 2014.", "Once visited Simba River Camp in Kenya, a safari lodge.", "He and Angelina Jolie married in California on August 14, 2014 and in southern France on August 23, 2014.", "Angelina Jolie filed for divorce from Brad on September 20, 2016.", "As of 2016, he is the only actor to work on two films each with Ridley Scott, and his brother Tony Scott.", "Has worked with seven directors who have won a Best Director Oscar: Robert Redford, Barry Levinson, Steven Soderbergh, Alejandro G. Iñárritu, Joel Coen & Ethan Coen, and Robert Zemeckis.", "He was scheduled to star in Urban Townies (2001) for director Mike Figgis, but pulled out to star in Spy Game (2001), causing Mike to then walk away.", "He was scheduled to make Waking Up in Reno (2002) with Juliette Lewis but the date kept being moved which meant he was available when director Guy Ritchie asked him to do Diamonds which was retitled Snatch (2000) on release. By the time Waking Up was ready, he and Jennifer were unavailable so their roles went to Billy Bob Thornton and Natasha Richardson.", "Paid $29 million in a divorce settlement to Jennifer Aniston.", "His favorite football team is the New Orleans Saints.", "Friends with George Clooney, Julia Roberts, Matt Damon, Cate Blanchett and Edward Norton.", "As of 2018, was producer or executive producer of eight films nominated for Best Picture Oscars: The Departed (2006), The Tree of Life (2011), Moneyball (2011), 12 Years a Slave (2013), Selma (2014), The Big Short (2015), Moonlight (2016) and Vice (2018). The Departed, 12 Years a Slave and Moonlight all won Best Picture, but Brad Pitt was only awarded the Oscar for producing 12 Years a Slave.", "Is mentioned by name in Travie McCoy's 2010 song \"Billionaire\" (featuring Bruno Mars).", "Manager is Cynthia Pett-Dante.", "Says his children are home schooled so they can have more freedom with their education.", "Brad Pitt met with the director to discuss the role of Cable in Deadpool 2 (2018), but could not commit due to scheduling conflicts, so the role was given to Josh Brolin. Although he was cast as Vanisher instead.", "According to an E! News story published on January 3, 2018, the actor humorously went by his first name, William, when flirting with a young lady in line at a coffee shop.", "He was engaged to actress Jill Schoelen for three months, before she broke off the engagement in Budapest (1989).", "Speaks French fluently.", "Has twice played soldiers who fought the Germans and scalped them, in Legends of the Fall (1994), and Inglourious Basterds (2009).", "Remake (2003) is one of his favorite films.", "He has appeared in one film that has been selected for the National Film Registry by the Library of Congress as being \"culturally, historically or aesthetically\" significant: Thelma & Louise (1991).", "Was scheduled to star in 'Urban Townes' to be directed by Mike Figgis but pulled out to do 'Spy Game' with Robert Redford."], "filmography": ["Babylon", "Bullet Train ()", "Ad Astra", "Once Upon a Time... In Hollywood", "Deadpool 2", "War Machine", "Allied", "Voyage of Time: The IMAX Experience", "The Big Short", "By the Sea", "The Audition", "Fury", "The Counselor", "12 Years a Slave", "World War Z", "Killing Them Softly", "8", "Touch of Evil", "Happy Feet Two", "Moneyball", "The Tree of Life", "Megamind", "Beyond All Boundaries", "Inglourious Basterds", "The Curious Case of Benjamin Button", "Burn After Reading", "SoftBank Commercial", "The Assassination of Jesse James by the Coward Robert Ford", "Ocean's Thirteen", "Babel", "Mr. & Mrs. Smith", "Ocean's Twelve", "Troy", "Freedom: A History of US", "Sinbad and the Cyclops Island", "King of the Hill", "Sinbad: Legend of the Seven Seas", "Confessions of a Dangerous Mind", "Ocean's Eleven", "Friends", "Spy Game", "The Mexican", "Snatch", "Fight Club", "Being John Malkovich", "Meet Joe Black", "Seven Years in Tibet", "The Devil's Own", "Sleepers", "12 Monkeys", "Se7en", "Legends of the Fall", "Interview with the Vampire: The Vampire Chronicles", "The Favor", "True Romance", "Kalifornia", "Contact", "A River Runs Through It", "Tales from the Crypt", "Cool World", "Two-Fisted Tales", "Johnny Suede", "Thelma & Louise", "Glory Days", "Across the Tracks", "Too Young to Die?", "The Image", "Thirtysomething", "Happy Together", "Cutting Class", "Growing Pains (1987-1989)", "Freddy's Nightmares", "Head of the Class", "The Dark Side of the Sun", "A Stoning in Fulham County", "21 Jump Street", "Dallas (1987-1988)", "Less Than Zero", "No Man's Land", "No Way Out", "Another World", "Hunk"]}