{"name": "David Cleveland Brown", "current role": "Financial Planner", "birth name": " ", "birth date": " ", "birth place": " ", "height": "6' 1\" (1.85 m)", "biography": "David Cleveland Brown plays a recurring character on the television series Yellowstone, written by Taylor Sheridan, starring in scenes opposite Kevin Costner and Kelly Reilly. He has a master's degree in acting from the University of New Orleans where he gained early experience on big-budget film sets such as Terminator Genesys, Fantastic Four, and The Big Short. Being on set observing professionals was some of his best schooling. He has starred in several commercials, music videos, short films, and has spent over a decade on stage improvising his little heart out. (PSA: his heart is probably average sized)David began acting in student films in College for his friends while studying his undergraduate degrees in psychology and Korean. He ended up majoring in Korean (the language) with a minor in psychology. After graduating he attended local acting classes. He later completed a Master's degree in Acting (MFA) and since becoming a master actor, he now pursues acting full-time.David is married to his beautiful wife with whom they have 4 children with big personalities. David enjoys being outdoors and playing competitive sports such as: basketball, football, table tennis, disc golf, and chess, to name a few. He can dunk (rim height is proprietary information). Occasionally he hosts family and friends over for pizza in their backyard pizza oven. To unwind he enjoys watching good television series with his wife or playing role playing games. Chess is a sport.David finds acting very fulfilling and meaningful. It uplifts his soul.Here's a poem he memorized in his first acting class.'Twas brillig, and the slithy toves Did gyre and gimble in the wabe: All mimsy were the borogoves, And the mome raths outgrabe.\"Beware the Jabberwock, my son! The jaws that bite, the claws that catch! Beware the Jubjub bird, and shun The frumious Bandersnatch!\"He took his vorpal sword in hand; Long time the manxome foe he sought- So rested he by the Tumtum tree And stood awhile in thought.And, as in uffish thought he stood, The Jabberwock, with eyes of flame, Came whiffling through the tulgey wood, And burbled as it came!One, two! One, two! And through and through The vorpal blade went snicker-snack! He left it dead, and with its head He went galumphing back.\"And hast thou slain the Jabberwock? Come to my arms, my beamish boy! O frabjous day! Callooh! Callay!\" He chortled in his joy.'Twas brillig, and the slithy toves Did gyre and gimble in the wabe: All mimsy were the borogoves, And the mome raths outgrabe.That's a poem he memorized.Also this website does not allow you to delete parts of your biography or make it smaller. Since David isn't the brightest star in the big bluish-black thing he may or may not have put more personal details in the first several iterations of this than reason might suggest. Yes, this all might have been written by him, and he may be speaking in third person. You might be wondering why there is more words down here or why this biography didn't end at \"David finds acting very fulfilling and meaningful. It uplifts his soul.\" Well as stated before, I can't delete all this mumbo jumbo down here. Wish I could. Maybe if my star meter gets above 1k I'll have special access to get rid of this garbage. Or maybe I'm just dreaming and making up more stuff to fill this biography void.A word count website tells me this is at least as long as the previous entry...::David Cleveland Brown", "trade mark": " ", "trivia": " ", "filmography": ["Honey Bunny ()", "The Book of Snake", "Romance in the Air", "Prescription for Love", "Yellowstone (2018-2019)", "Boyfriend's Deceit", "To Have and to Hold", "Andi Mack", "The Big Short", "Fantastic Four", "Terminator Genisys", "The Good, the Bad and the Coyote", "The Masonic Map"]}