{"name": "David Kallaway", "current role": "Guy in Game Jersey", "birth name": " ", "birth date": " ", "birth place": " ", "height": "6' 4\" (1.93 m)", "biography": "David Kallaway is an accomplished stage, screen and television actor .His most notable movie roles include \"Ray\" in the Academy Award winning film Green Book, \"Turner\" in The Magnificent Seven, \"Edward Covey\" in Roots and as \"John Kruesi\" in the upcoming film Tesla with Ethan Hawke.At 8 years old Kallaway got his start in a string of television commercials, at age eleven he landed his first film role in Making The Grade opposite Judd Nelson (Breakfast Club) & Gordon Jump (WKRP In Cincinnati).He went on to work in a slew of projects filmed in his hometown of Memphis, including \"The Rainmaker\" with Francis Ford Coppola & Matt Damon and \"The People Vs. Larry Flynt\" with Woody Harrelson & Edward Norton. After attending the University of Memphis Theatre Program, Kallaway moved to Los Angeles and soon landed a guest spot on the Sci-Fi series \"Sliders\" and a recurring role on Aaron Spelling's hit daytime soap \"Sunset Beach.\"Kallaway recently held recurring television roles on NBC's The Blacklist, Amazon's Sneaky Pete and WGN's series Underground. He portrayed the infamous slave breaker \"Edward Covey\" in the TV mini-series Roots. Kallaway stared opposite Denzel Washington, Chris Pratt, Ethan Hawke & Vincent D'Onofrio in MGM's remake of The Magnificent Seven directed by Antoine Fuqua and played opposite Mahershala Ali & Viggo Mortensen in the Academy Award Winning film Green Book directed by Peter Farrelly. He played opposite Hugh Jackman in \"Logan, he also made an appearance in Adam McKay's Academy Award nominated The Big Short and the Academy award nominated Hidden Figures opposite Kevin Costner.::J. Miller", "trade mark": " ", "trivia": " ", "filmography": ["Wrong Place Wrong Time ()", "The Collected ()", "The Underground Railroad ()", "Son", "Emperor", "Money Plane", "South of Sanity (2018-2020)", "The Blacklist (2019-2020)", "Tesla", "Jumanji: The Next Level", "Gothic Harvest", "Feast of the Seven Fishes", "Swamp Thing", "The Dirt", "MacGyver", "Gotham", "Green Book", "One Dollar", "13 Reasons Why", "Sneaky Pete", "Blaze", "An Accidental Zombie", "Trailer Park Shark", "Dark Meridian", "Logan", "NCIS: New Orleans", "Office Christmas Party", "Hidden Figures", "Forced Move", "The Magnificent Seven", "The Neighbor", "Roots", "Bloodline", "Underground", "The Big Short", "Salem", "Figure 8", "Revelation Road 2: The Sea of Glass and Fire", "Knife to a Gunfight", "Last Girl", "Apostle Peter and the Last Supper", "Nipples & Palm Trees", "For a Good Time, Call...", "I Didn't Know I Was Pregnant", "Love Is Retarded", "Kidnap & Rescue", "The Black Keys: Howlin' for You", "Miss Nobody", "Chain Link", "Night & Day", "Garfield: A Tail of Two Kitties", "Mammoth", "Alien Lockdown", "Stringers", "Angel", "The Moment After", "The Settlement", "Pups", "Sliders", "Confessions of a Call Girl", "Sunset Beach", "The Devil's Child", "Friction", "The People vs. Larry Flynt", "Making the Grade"]}