{"name": "Andy Garcia", "current role": "Terry Benedict", "birth name": "Andrés Arturo García Menéndez", "birth date": "1956-04-12", "birth place": "Havana, Cuba", "height": "5' 9\" (1.75 m)", "biography": "One of Hollywood's most private and guarded leading men, Andy Garcia has created iconic characters while at the same time staying true to his acting roots and personal projects.Garcia was born Andrés Arturo García Menéndez on April 12, 1956, in Havana, Cuba, to Amelie Menéndez, a teacher of English, and René García Núñez, an attorney and avocado farmer. Garcia's family was relatively affluent. However, when he was two years old, Fidel Castro came to power, and the family fled to Miami Beach. Forced to work menial jobs for a while, the family started a fragrance company that was eventually worth more than a million dollars. He attended Natilus Junior High School and later at Miami Beach Senior High School. Andy was a popular student in school, a good basketball player and good-looking. He dreamed of playing professional baseball. In his senior year, though, he contracted mononucleosis and hepatitis, and unable to play sports, he turned his attention to acting.He studied acting with Jay W. Jensen. Jensen was a South Florida legend, counting among his numerous students, Brett Ratner, Roy Firestone, Mickey Rourke, and Luther Campbell. Following his positive high school experiences in acting, he continued his drama studies at Florida International University.Soon, he was headed out to Hollywood. His first break came as a gang member on the very first episode of the popular TV series Hill Street Blues (1981). His role as a cocaine kingpin in 8 Million Ways to Die (1986) put him on the radar of Brian De Palma, who was casting for his gangster classic The Untouchables (1987). At first, he envisioned Garcia as Al Capone's sadistic henchman Frank Nitti, but fearing typecasting as a gangster, Garcia campaigned for the role of \"George Stone\", the Italian cop who gets accepted into Eliot Ness' famous band of lawmen. Garcia's next notable role came in Black Rain (1989) by acclaimed director Ridley Scott, as the partner of police detective Michael Douglas. He then co-starred with Richard Gere in Internal Affairs (1990), directed by Mike Figgis. In 1989, Francis Ford Coppola was casting for the highly anticipated third installment of his \"Godfather\" films. The Godfather: Part III (1990) included one of the most sought-after roles in decades, the hot-headed son of \"Sonny Corleone\" and mob protégé of \"Michael Corloene\", \"Vincent Mancini\". A plum role for any young rising star, the role was campaigned for by a host of actors. Val Kilmer, Alec Baldwin, Vincent Spano, Charlie Sheen, and even Robert De Niro (who wanted the role changed to accommodate his age) were all beaten out by the up-and-coming Garcia. His performance was Oscar-nominated as Best Supporting Actor, and secured him international stardom and a place in cinematic history. Now a leading man, he starred in such films as Jennifer 8 (1992) and Hero (1992). He won raves for his role as the husband of Meg Ryan in When a Man Loves a Woman (1994) and gave another charismatic gangster turn in Things to Do in Denver When You're Dead (1995). He then returned in Night Falls on Manhattan (1996), directed by Sidney Lumet, as well as portraying legendary mobster Lucky Luciano in Hoodlum (1997). In perhaps his most mainstream role, he portrayed a cop in the action film Desperate Measures (1998). Garcia then starred in a few lower-profile projects that didn't do much for his career, but things turned around in 2001, with the first of many projects being his role as a cold casino owner in Ocean's Eleven (2001), directed by Steven Soderbergh. Seeing his removal from Cuba as involuntary, Garcia is proud of his heritage which influences his life and work. One such case is his portrayal of renowned Cuban trumpet player Arturo Sandoval in For Love or Country: The Arturo Sandoval Story (2000). He is an extremely private man, and strong believer in old-fashioned chivalry. Married to his wife, Maria Victoria, since 1982, the couple has three daughters. One of the most talented leading men around, Garcia has had a unique career of staying true to his own ideals and thoughts on acting. While some would have used some of the momentum he has acquired at different points in his career to get rich off lightweight projects, Garcia has stayed true to stories and films that aspire to something more. But with a presence and style that never seem old, a respect from directors and film buffs, alike, Andy Garcia will be remembered for a long time in film history.::Brian Stewart and Chase Rosenberg", "trade mark": " ", "trivia": ["Chosen by Empire magazine as one of the 100 Sexiest Stars in film history (#65). [1995]", "Family emigrated to the US in 1961, when Andy was 5 years old.", "Father of three girls and one boy.", "Was born as a conjoined twin. His twin was no bigger than a tennis ball and was surgically removed. All that remains is a scar on his shoulder.", "Refuses to do nude scenes. He once walked out of a audition when asked to remove his shirt.", "Gained weight when his wife was pregnant with three of their children.", "Children: Dominik Garcia, Daniella Garcia, Alessandra Garcia-Lorido, and Andrés Garcia-Lorido.", "Fact: Owns 25 conga drums, collects hats, and wears a beret in the winter.", "Son, Andrés Garcia-Lorido, was born Monday, January 28, 2002, in Los Angeles, tipping the scales at 7 pounds, 13 ounces.", "His daughter, Alessandra Garcia-Lorido, was born on June 20, 1991, in Los Angeles, California.", "Daughter, Daniella Garcia, was born on January 3, 1988.", "Filmed scenes as LouAnne's (Michelle Pfeiffer) love interest in Dangerous Minds (1995), but they were cut from the final print.", "Son of Rene Garcia (attorney who died in 1993) and Amelie Garcia (English teacher).", "Daughter Dominik Garcia born in 1984.", "Has an older brother named Rene Garcia.", "His niece is Jackie Garcia. She was the fiancée of slain Washington Redskins safety Sean Taylor at the time of his death.", "Turned down the role of \"Detective Mac Taylor\" (The character played by Gary Sinise) on the popular CBS crime drama CSI: NY (2004).", "Longtime friend of actor Mickey Rourke. Has said that Rourke was his high school baseball coach.", "Currently lives in Toluca Lake, California, with his wife and children. [December 2004]", "Garcia has worked with all 3 actors who played Bruce Wayne/Batman in the Burton/Schumacher 'Batman' films. He and Michael Keaton appeared in \"Desperate Measures\" (1998). He and Val Kilmer appeared in \"5 Days of War\" (2011). He and George Clooney appeared in \"Ocean's Eleven\" (2001), \"Ocean's Twelve\" (2004), and \"Ocean's Thirteen\" (2007).", "Starred in two different films where he played the protagonist who, upon arriving on horseback, shot and killed an antagonist. The two films were \"The Godfather: Part III\" and \"For Greater Glory\"."], "filmography": ["Hemingway & Fuentes ()", "Rebel", "The Ark: An Iron Sky Story ()", "Big Gold Brick", "What About Love", "Redemption Day", "Elena of Avalor", "Words on Bathroom Walls", "Flipped", "Ana", "Modern Love", "3Below: Tales of Arcadia (2018-2019)", "Headlock", "The Mule", "My Dinner with Hervé", "Mamma Mia! Here We Go Again", "Book Club", "Bent", "Nespresso: Comin' Home", "Geostorm", "Seven Bucks Digital Studios", "Passengers", "True Memoirs of an International Assassin", "Max Steel", "Ballers", "Ghostbusters", "Valley of the Wolves: Ambush", "Kill the Messenger", "Let's Be Cops", "Rio 2", "Rob the Mob", "Christmas in Conway", "Doll & Em", "At Middleton", "Open Road", "Dora's Royal Rescue", "Dora the Explorer", "A Dark Truth", "Cristeros", "The Simpsons", "5 Days of War", "Across the Line: The Exodus of Charlie Wright", "The Line", "City Island", "The Pink Panther 2", "Beverly Hills Chihuahua", "New York, I Love You", "Ocean's Thirteen", "The Air I Breathe", "Smokin' Aces", "George Lopez", "The Valley of the Wolves", "The Lost City", "Ocean's Twelve", "Modigliani", "The Lazarus Child", "Twisted", "Just Like Mona", "JoJo's Circus", "Confidence", "Will & Grace", "Frasier", "Ocean's Eleven", "The Man from Elysian Fields", "The Unsaid", "For Love or Country: The Arturo Sandoval Story", "Lakeboat", "Swing Vote", "Gary & Linda", "Desperate Measures", "Hoodlum", "Death in Granada", "Night Falls on Manhattan", "Steal Big Steal Little", "Things to Do in Denver When You're Dead", "When a Man Loves a Woman", "Gloria Estefan: I See Your Smile", "Jennifer 8", "Hero", "Dead Again", "The Godfather: Part III", "A Show of Force", "Internal Affairs", "Black Rain", "Blood Money", "American Roulette", "Stand and Deliver", "The Untouchables", "8 Million Ways to Die", "Foley Square", "Alfred Hitchcock Presents", "The Mean Season", "Brothers", "Murder, She Wrote", "Hill Street Blues (1981-1984)", "The Lonely Guy", "A Night in Heaven", "Guaguasi", "For Love and Honor", "Blue Skies Again", "Archie Bunker's Place", "¿Qué pasa, U.S.A.?"]}