{"name": "Max von Sydow", "current role": "Dr. Naehring", "birth name": "Carl Adolf von Sydow", "birth date": "1929-04-10", "birth place": "Lund, Skåne län, Sweden", "height": "6' 3¼\" (1.91 m)", "biography": "Max von Sydow was born Carl Adolf von Sydow on April 10, 1929 in Lund, Skåne, Sweden, to a middle-class family. He was the son of Baroness Maria Margareta (Rappe), a teacher, and Carl Wilhelm von Sydow, an ethnologist and folklore professor. His surname traces back to his partial German ancestry.When he was in high school, he and a few fellow students, including Yvonne Lombard, started a theatre club which encouraged his interest in acting. After conscription, he began to study at the Royal Dramatic Theatre's acting school (1948-1951), together with Lars Ekborg, Margaretha Krook and Ingrid Thulin. His first role was as Nils the crofter in Alf Sjöberg's Only a Mother (1949). After graduation, he worked at the city theatres in Norrköping and Malmö.His work in the movies by Ingmar Bergman (especially The Seventh Seal (1957), including the iconic scenes in which he plays chess with Death) made him well-known internationally, and he started to get offers from abroad. His career abroad began with him playing Jesus in The Greatest Story Ever Told (1965); Hawaii (1966) and The Quiller Memorandum (1966). Since then, his career includes very different kind of characters, like Karl Oskar Nilsson in The Emigrants (1971); Father Lankester Merrin in The Exorcist (1973); Joubert the assassin in Three Days of the Condor (1975), Emperor Ming in Flash Gordon (1980); the villain Ernst Stavro Blofeld in the Never Say Never Again (1983); Liet-Kynes in Dune (1984) the artist Frederick in Hannah and Her Sisters (1986); Lassefar in Pelle the Conqueror (1987), for which he received his first Academy Award nomination; Dr. Peter Ingham in Awakenings (1990); Lamar Burgess in Minority Report (2002) and The Renter in Extremely Loud & Incredibly Close (2011), which earned him his second Academy Award nomination.He became one of Sweden's most admired and professional actors, and is the only male Swedish actor to receive an Oscar nomination. He was nominated twice: for Pelle the Conqueror (1987) in 1988 and for Extremely Loud & Incredibly Close (2011) in 2012. He received the Guldbagge Award for Best Director in his directing debut, the drama film Katinka (1988). In 2016, he joined the sixth season of the HBO series Game of Thrones (2011) as the Three-eyed Raven, which earned him his Primetime Emmy Award nomination.Max von Sydow died on March 8, 2020, in Provence, France, and was survived by his wife Catherine Brelet and four children. He was 90.::Mattias Thuresson", "trade mark": "Deep commanding voice", "trivia": ["Had four sons, Clas S. von Sydow and Henrik von Sydow with his first wife; and Cédric and Yvan with his second wife. In 1951, von Sydow married actress Christina Olin with whom he had two sons, Claes and Henrik. His children appeared with him in the film Hawaii (1966), playing his son at different ages. He and Olin divorced on 26 February 1979 then he married French filmmaker Catherine Brelet in April 1997 in the Provence, France. He had two sons, Yvan and Cedric, with his second wife. Cédric has appeared and has worked with him since 1994. von Sydow resided in Paris, France with his second wife.", "He was offered the title role in the first James Bond film Dr. No (1962), which went to Joseph Wiseman.", "One of his favorite movies was Pelle the Conqueror (1987).", "Had resided in Los Angeles, California, Rome, Italy and Paris, France.", "Father of Henrik von Sydow and Clas S. von Sydow.", "He was one of the few actors to have played both God (in The Greatest Story Ever Told (1965)) and the Devil (in Needful Things (1993)).", "Distant relative of Swedish speaker of parliament and ex-minister of defence, Björn von Sydow.", "Had appeared in two films as a leading villain, in which plots include the use of eye replacement surgery as a means of fooling security eye scanners; as Blofeld in Never Say Never Again (1983) and Lamar Burgess in Minority Report (2002).", "He appeared in 13 films directed by Ingmar Bergman: The Seventh Seal (1957), Wild Strawberries (1957), Mr. Sleeman Is Coming (1957), Brink of Life (1958), The Magician (1958), Rabies (1958), The Virgin Spring (1960), Through a Glass Darkly (1961), Winter Light (1963), Hour of the Wolf (1968), Shame (1968), The Passion of Anna (1969) and The Touch (1971).", "He was co-head of the jury at the Berlin International Film Festival in 1985.", "After not appearing in an Ingmar Bergman film since The Touch (1971), von Sydow was reunited with the master, playing his grandfather in The Best Intentions (1991). While the film was directed by Bille August, the screenplay was written by Ingmar Bergman. Ironically, despite all the classic work von Sydow did with Ingmar Bergman such as the Knight in The Seventh Seal (1957), the eponymous role in The Magician (1958), and the father in The Virgin Spring (1960), his first Oscar nomination came under the hand of Bille August, for Pelle the Conqueror (1987).", "He was one of very few actors to be nominated for an Oscar for a role in a foreign language film, for his performance in Pelle the Conqueror (1987).", "His performance as Lasse Karlsson in Pelle the Conqueror (1987) is ranked #57 on Premiere magazine's 100 Greatest Performances of All Time (2006).", "Fluent in a number of languages, including Swedish, English, French and Italian.", "In 2002, he received his French citizenship, at which time he had to renounce his Swedish citizenship.", "Most of his ancestry was Swedish. His parents also both had more distant German roots, and his mother had a remote Scottish ancestor.", "He was among the actors in the running for Dr. Hans Fallada in the horror film Lifeforce (1985). Frank Finlay was cast instead.", "As of 2015, had appeared in five films that were nominated for the Best Picture Oscar: The Emigrants (1971), The Exorcist (1973), Hannah and Her Sisters (1986), Awakenings (1990) and Extremely Loud & Incredibly Close (2011).", "His second Oscar nomination (Best Supporting Actor for Extremely Loud & Incredibly Close (2011)) came at age 82, which was the same age as front-runner Christopher Plummer who was competing with him in the category (also in a second nomination). Plummer won the Oscar for Beginners (2010), in a role previously turned down by von Sydow.", "He and his The Greatest Story Ever Told (1965) co-stars Donald Pleasence and Telly Savalas all later played the Bond villain Ernst Stavro Blofeld: Pleasence in You Only Live Twice (1967), Savalas in On Her Majesty's Secret Service (1969) and von Sydow in Never Say Never Again (1983).", "He was one of six Swedish actors to be nominated for an Academy Award. The others are Greta Garbo, Ingrid Bergman, Ann-Margret, Lena Olin and Alicia Vikander. von Sydow is the only male Swedish actor to be nominated for an Oscar.", "In his career, he had played Jesus, Satan, and was also the title character in the horror classic The Exorcist (1973).", "He was considered for the role of William Fawcett Robinson in Somewhere in Time (1980) before Christopher Plummer was cast.", "Adoptive father of Yvan and Cédric Brelet von Sydow, children of Catherine Brelet from a prior marriage.", "Max von Sydow passed away on March 8, 2020, one month away from what would have been his 91st birthday on April 10. He never retired from acting."], "filmography": ["Echoes of the Past ()", "The Command", "Lego Star Wars: The Force Awakens", "Game of Thrones", "Les premiers les derniers", "Star Wars: Episode VII - The Force Awakens", "The Simpsons", "The Letters", "Dragons 3D", "Branded", "Extremely Loud & Incredibly Close", "The Elder Scrolls V: Skyrim", "Le Dernier Troll Norvégien", "Moomins and the Comet Chase", "Robin Hood", "Shutter Island", "The Wolfman", "Oscar and the Lady in Pink", "Solomon Kane", "Ghostbusters", "The Tudors", "A Man and His Dog", "Emotional Arithmetic", "Rush Hour 3", "The Diving Bell and the Butterfly", "The Final Inquiry", "Heidi", "Sword of Xanten", "Night of the Living Dorks", "La fuite des innocents", "Les amants de Mogador", "Minority Report", "Intacto", "Druids", "Sleepless", "Nuremberg", "Snow Falling on Cedars", "What Dreams May Come", "Professione fantasma", "Solomon", "La princesse et le pauvre", "En frusen dröm", "Screen One", "Truck Stop", "Private Confessions", "Samson and Delilah", "Jerusalem", "Hamsun", "Lumière et compagnie", "Capture - Meet Robert A. Robinson Photographer", "Depth Solitude", "Atlanten", "Judge Dredd", "Citizen X", "La marche de Radetzky", "Onkel Vanja", "A che punto è la notte", "Time Is Money", "Needful Things", "Morfars resa", "The Young Indiana Jones Chronicles", "Och ge oss skuggorna", "The Touch", "The Best Intentions", "The Best Intentions", "The Ox", "Until the End of the World", "Europa", "A Kiss Before Dying", "Awakenings", "Father", "Hiroshima: Out of the Ashes", "Cellini, l'or et le sang", "The Bachelor", "Carl Jung: Wisdom of the Dream", "Red King, White Knight", "Ghostbusters II", "Familjen Schedblad", "Pelle the Conqueror", "The Second Victory", "Duet for One", "Oviri", "Gösta Berlings saga", "Hannah and Her Sisters", "The Fascination", "The Last Place on Earth", "The Repenter", "Code Name: Emerald", "Christopher Columbus", "Quo Vadis?", "Kojak: The Belarus File", "Le dernier civil", "Dune", "Dreamscape", "The Soldier's Tale", "Samson and Delilah", "The Ice Pirates", "Never Say Never Again", "Strange Brew", "Le cercle des passions", "Jugando con la muerte", "The Flight of the Eagle", "Conan the Barbarian", "Victory", "She Dances Alone", "Flash Gordon", "Death Watch", "Footloose", "Hurricane", "Brass Target", "Black Journal", "March or Die", "Exorcist II: The Heretic", "Voyage of the Damned", "The Desert of the Tartars", "The Far Side of Paradise", "Illustrious Corpses", "Dog's Heart", "The Ultimate Warrior", "Three Days of the Condor", "Trompe l'oeil", "Egg! Egg! A Hardboiled Story", "Steppenwolf", "The Exorcist", "Kvartetten som sprängdes", "NET Playhouse", "Embassy", "The New Land", "I havsbandet", "The Apple War", "I själva verket är det alltid något annat som händer", "The Touch", "The Emigrants", "The Night Visitor", "The Kremlin Letter", "The Passion of Anna", "Made in Sweden", "Shame", "Black Palm Trees", "Hour of the Wolf", "The Diary of Anne Frank", "Here Is Your Life", "The Quiller Memorandum", "Hawaii", "The Reward", "4 x 4", "Interlude in the Marshland", "The Greatest Story Ever Told", "Winter Light", "The Mistress", "Wonderful Adventures of Nils", "Through a Glass Darkly", "Bröllopsdagen", "The Virgin Spring", "The Magician", "Rabies", "Spion 503", "Brink of Life", "The Minister of Uddarbo", "Wild Strawberries", "Mr. Sleeman Is Coming", "The Seventh Seal", "Rätten att älska", "Ingen mans kvinna", "Miss Julie", "Only a Mother"]}