{"name": "Margot Robbie", "current role": "Margot Robbie", "birth name": "Margot Elise Robbie", "birth date": "1990-07-02", "birth place": "Dalby, Queensland, Australia", "height": "5' 6\" (1.68 m)", "biography": "Margot Elise Robbie was born on July 2, 1990 in Dalby, Queensland, Australia to Scottish parents. Her mother, Sarie Kessler, is a physiotherapist, and her father, is Doug Robbie. She comes from a family of four children, having two brothers and one sister. She graduated from Somerset College in Mudgeeraba, Queensland, Australia, a suburb in the Gold Coast hinterland of South East Queensland, where she and her siblings were raised by their mother and spent much of her time at the farm belonging to her grandparents. In her late teens, she moved to Melbourne, Victoria, Australia to pursue an acting career.From 2008-2010, Robbie played the character of Donna Freedman in the long-running Australian soap opera, Neighbours (1985), for which she was nominated for two Logie Awards. She set off to pursue Hollywood opportunities, quickly landing the role of Laura Cameron on the short-lived ABC series, Pan Am (2011). She made her big screen debut in the film, About Time (2013).Robbie rose to fame co-starring alongside Leonardo DiCaprio, portraying the role of Naomi Lapaglia in Martin Scorsese's Oscar nominated film, The Wolf of Wall Street (2013). She was nominated for a Breakthrough Performance MTV Movie Award, and numerous other awards.In 2014, Robbie founded her own production company, LuckyChap Entertainment. She also appeared in the World War II romantic-drama film, Suite Française (2014). She starred in Focus (2015) and Z for Zachariah (2015), and made a cameo in The Big Short (2015).In 2016, she married Tom Ackerley in Byron Bay, New South Wales, Australia.She starred as Jane Porter in The Legend of Tarzan (2016), Tanya Vanderpoel in Whiskey Tango Foxtrot (2016) and as DC comics villain Harley Quinn in Suicide Squad (2016), for which she was nominated for a Teen Choice Award, and many other awards.She portrayed figure skater Tonya Harding in the biographical film I, Tonya (2017), receiving critical acclaim and a Golden Globe Award nomination for Best Actress - Motion Picture Comedy or Musical.::Pedro Borges", "trade mark": "Striking blue eyes", "trivia": ["Featured in Inside Film magazine's 2012 Rising Talent issue. The special feature profiled 25 rising young Australian actors including Jai Courtney, Alex Russell, Adelaide Clemens and David Ludlow.", "Is the third of four children of Doug Robbie and Sarie Kessler.", "Ranked #22 on Maxim magazine's Hot 100 Women of 2014 list.", "Is a fan of the New York Rangers hockey team. The first placed she lived when she moved to America was New York.", "Was originally cast as Penelope Lanier in A Bigger Splash (2015) but dropped out to do The Legend of Tarzan (2016) instead. She was replaced by Dakota Johnson.", "Was voted \"Sexiest Eyes\" by Victoria's Secret's annual What is Sexy List (2015).", "Counts True Romance (1993) as one of her all-time favorite movies.", "Met her boyfriend and current husband Tom Ackerley on the set of Suite Française (2014) in 2013 and they have been in a relationship since then until their marriage. He was the third assistant director on that film.", "Robbie learned to hold her breath for up to five minutes while filming Suicide Squad (2016).", "She took three shots of tequila prior to filming her sex scenes with Leonardo DiCaprio in The Wolf of Wall Street (2013).", "She had a chunk of her right eyebrow shaved off by Suicide Squad (2016) director David Ayer on the first day of filming the super-villains film.", "She turned down the role of Sam Thomson in the Oscar-winning film Birdman or (The Unexpected Virtue of Ignorance) (2014). The role ultimately went to Emma Stone which earned her a nomination for Best Supporting Actress.", "Robbie began dabbling in the world of tattooing while filming Suicide Squad (2016). In addition to giving fellow cast members a tattoo reading \"SKWAD\" (which she accidentally misspelled as SWKAD), she has given over 20 tattoos including one she gave herself. During filming, she opened Harley's Tattoo Parlour and gave tattoos to fellow cast members, members of the crew, and director David Ayer.", "Is often more than a full decade younger than her male romantic counterpart; Alexander Skarsgård was 13 years older than Robbie when they played opposite in The Legend of Tarzan (2016), Leonardo DiCaprio was 15 years her senior in The Wolf of Wall Street (2013), while Will Smith was more than 20 years older than her, when she played his love interest in Focus (2015).", "She did not need to submit a demo reel or audition for the role of Harley Quinn (aka Dr. Harleen Quinzel) in Suicide Squad (2016) because this was offered to her.", "She performed a majority of the stunts in Suicide Squad (2016) herself. Director David Ayer stated that her stunt double spent more time sitting around in the trailers than actually performing stunts because Robbie wanted to do them herself.", "She had auditioned for the role of Sue Storm in Fantastic Four (2015), but the role was given to Kate Mara instead. Robbie was later cast as Harley Quinn (aka Dr. Harleen Quinzel) in Suicide Squad (2016).", "Director David Ayer said during San Diego Comic-Con International 2016 that it was a blessing to have Robbie on board as Harley Quinn because not many actresses would have tolerated what she went through to prepare for and perform the role.", "Robbie did not go through any sort of rehearsal process, with Jared Leto, for Suicide Squad (2016). She and director David Ayer felt not going through rehearsals added to the unpredictability and madness of Harley Quinn and the Joker.", "After shooting for Suicide Squad (2016) ended, Robbie kept the jacket worn by Harley Quinn and her baseball bat.", "Robbie began training six months prior to shooting Suicide Squad (2016). Her training routine included gymnastics, boxing, weapons training, aerial silk training, and learning to hold her breath underwater for extended periods of time.", "Robbie's role as Donna Freedman in the Australian soap opera Neighbours (1985), was only supposed to be a guest role. The series writers and production were so impressed with her that she quickly became a series regular. She appeared on the series from 2008-2011.", "Robbie refused to lose weight for the role of Jane Porter in The Legend of Tarzan (2016) and has said she would rather focus on being healthy than being skinny.", "She dressed up as James Franco's character from Spring Breakers (2012) for Halloween, complete with cornrows.", "Her favorite professional sports team is the New York Rangers and the New Orleans Saints.", "Her younger brother, Cameron Robbie, felt inspired to pursue acting after seeing the success his older sister was able to achieve. Her older brother, Lachlan Robbie, also works in the film industry as a stuntman.", "While living in London, Robbie attended a party with Suicide Squad (2016) co-star Cara Delevingne and unknowingly took a photobooth photo with Prince Harry of Wales. She mistook him for British singer/songwriter, Ed Sheeran.", "Robbie bought her tattoo gun on eBay.", "She refers to her huge fan base as \"Robbers\".", "She named the rat that Jared Leto gifted her \"Rat-Rat\".", "Robbie's character, Donna Freedman, on Neighbours (1985) was one of the first bisexual characters portrayed on Australian television. She even shared an on-screen kiss with female co-star, Hany Lee. The portrayal of Robbie's character was criticized by the Australian Family Association for normalizing same-sex relationships.", "Robbie is a natural brunette, but started sporting blonde hair after this became apparent that the film industry preferred blonde actresses.", "She has an older sister named Anya Robbie, an older brother named Lachlan Robbie, and a younger brother named Cameron Robbie. She and her siblings were raised by a single mother with minimal contact from their father.", "She was roommates with Christina Ricci, while filming the short-lived ABC series Pan Am (2011).", "Despite a growing net worth, Robbie does not spent a great deal of her money and prefers to live with roommates to save money. She claims growing up knowing what it was like to not have access to everything is continually humbling for her.", "She worked three jobs simultaneously while studying at Somerset College in Queensland including retail, secretary work, selling surfboards, and making sandwiches at Subway. After graduating at age 17, she moved to Melbourne to pursue acting full-time.", "She got her first two film roles in Vigilante (2008) and I.C.U. (2009) without an agent.", "Upon leaving the Australian soap opera Neighbours (1985), Robbie wanted to have her character killed in a dramatic way. Instead, the series writers chose to send her character to college, so she had the option to return to the series in case her move to the United States was unsuccessful.", "She turned down an offer to pose for Playboy magazine citing she won't go nude unless it's for artistic purposes.", "She has been characterized as a tomboy because she likes surfing, riding motorcycles and DIY (Do it yourself).", "She had taken circus classes when she was 8 years old in Australia and earned a trapeze certificate at the age of eight. She revisited the skill for her role as Harley Quinn in Suicide Squad (2016).", "She gave columnist Jonathan Van Meter a \"V\" tattoo, during her interview for the May 2016 issue of Vogue magazine.", "Robbie was backpacking in Europe when she got the call for a final audition with Will Smith for Focus (2015). She went from the island of Hvar to Croatia to Paris to New York City in 48 hours to arrive with just hours to spare. The airline lost her luggage along the way, so she had to buy brand new outfits just before the audition.", "In 2014, she started a production company, LuckyChap Entertainment, with Tom Ackerley, Josey McNamara, and her childhood friend Sophia Kerr. Kerr also serves as her personal assistant.", "Robbie describes her origins in Dalby, Queensland as simple, outdoorsy and very rural.", "She likes to send friends and family letters and postcards from around the world because she thinks people don't get enough mail that isn't a bill.", "She moved to California to begin auditioning for film roles, five days after her Neighbours (1985) contract ended.", "She used a portion of her The Wolf of Wall Street (2013) paycheck to pay off her mother's home mortgage.", "Robbie originally auditioned for a role in the Charlie's Angels reboot, but was offered a role in Pan Am (2011), instead.", "To prepare for her role as Dr. Harleen Quinzel in Suicide Squad (2016), she researched Minnesota Multiphasic Personality Inventory (MMPI) testing to understand how mental illnesses are diagnosed. She used the information gathered from the testing to try and apply it to her reactions and how she dealt with a character like the Joker.", "Robbie signed a first-look partnership deal with Warner Bros. in September 2016. The deal includes upcoming films from her production company, LuckyChap Entertainment, including a Harley Quinn spin-off for the DC Extended Universe and Queen of the Air.", "There is a 19-year age difference between Robbie and her Suicide Squad (2016) co-star, Jared Leto. They portray the iconic DC Comics super-villain couple, Harley Quinn and the Joker.", "She confirmed in September 2016 that she is executive producing and starring in a Harley Quinn spin-off movie for the DC Extended Universe. Robbie had lobbied for the project at Warner Bros. since filming wrapped for Suicide Squad (2016) in 2015.", "Robbie was revealed as the face of the Calvin Klein Deep Euphoria fragrance campaign. [June 2016]", "Although Robbie tattooed a majority of the cast of Suicide Squad (2016), she did not perform tattoos on Will Smith or Jared Leto.", "In order to prepare for the role of Harley Quinn, she researched relationship codependency and treated Harley's relationship to the Joker as an addiction.", "Robbie moved from her shared house in London, England to Los Angeles, California. [November 2016]", "Paul Dini, the creator of Harley Quinn, thought very highly of Margot's performance in Suicide Squad (2016). In his own words, she \"nailed it perfectly\".", "Robbie spoke with a Brooklyn accent in both The Wolf of Wall Street (2013) and Suicide Squad (2016). Her character, Naomi Lapaglia, originated from Bay Ridge, Brooklyn, while Harley Quinn's comic book origins put her a few neighborhoods over in Bensonhurst, Brooklyn.", "She attended a Slipknot concert while she was still a series regular on the Australian soap opera Neighbours (1985). She was surprised to see how many fans of the metal group recognized her and asked her about the series.", "She enjoys surfing and worked at a surf shop on the Gold Coast in Queensland, Australia prior to becoming an actress.", "Robbie spent over three hours in the makeup chair to be transformed into Harley Quinn for Suicide Squad (2016). Her physical transformation included She having her skin painted white, applying 20 temporary tattoos, applying Harley Quinn's wig, and actually getting into her costume.", "Robbie hosted the 42nd season premiere of Saturday Night Live (1975) on October 1, 2016, with the musical guest, The Weeknd.", "She appeared on the cover of Vanity Fair's 20th Anniversary Hollywood Edition, alongside George Clooney, Julia Roberts, Léa Seydoux, Chiwetel Ejiofor, 'Lupita Nyongo, Idris Elba, Naomie Harris, and her Suicide Squad (2016) co-star, Jared Leto.", "Her mother, Sarie, gave her away at her wedding due to her estrangement from her father, Doug. Her sister, Anya, served as her maid of honor.", "In 2013, she met her boyfriend, Tom Ackerley, on the set of Suite Française (2014), who was working as the third assistant director. They married on December 19, 2016 in Byron Bay, New South Wales, Australia.", "Merited a place in Time magazine's \"100 Most Influential People\" issue with an homage written by Martin Scorsese. [May 2017]", "Has been tied up and had her mouth gagged in four separate movies: I.C.U. (2009), Focus (2015), The Legend of Tarzan (2016) and Suicide Squad (2016).", "She learned how to skate for three months to film I, Tonya (2017). Since stunt doubles couldn't be relied upon and only 8 women in history have landed the triple axel jump in competition, CGI was used to replicate it.", "Has three tattoos: an anchor on her ankle, a smile face under her foot, and \"skwad\" on her foot.", "She always carries a quartz with her for luck that her mother gave her.", "Her brother, Cameron Robbie, is a television presenter and is sometimes assigned to interview her.", "She was Josh Trank's first choice for the role of Sue Storm in Fantastic Four (2015) but the studio cast Kate Mara instead.", "Is of Scottish and German descent.", "Is an amateur tattoo artist and has given over a hundred to different people.", "Good friends with Cara Delevingne and Saoirse Ronan.", "As of 2020, she has been in 3 films that were Oscar nominated for Best Picture: The Wolf of Wall Street (2013), The Big Short (2015), and Once Upon a Time... In Hollywood (2019).", "Robbie had a say in what tattoos her character Harley Quinn has in both Suicide Squad and Birds of Prey. The tattoo of a dolphin jumping over a rainbow was important to Robbie because she felt Dr. Harleen Quinzel would have seen a tattoo as being super rebellious, but didn't want to be too edgy (at the time).", "According to Robbie, the most stressful aspect of producing films is box office performance.", "Robbie learned tricks from the \"gentleman thief\" Apollo Robbins for her role in Focus. Robbins taught her so well that production told her to slow down because cameras weren't capturing her pick-pocketing other characters.", "Robbie joined an amateur hockey league when she first moved to the United States. She always wanted to play ice hockey because she loved The Mighty Ducks, but she played field hockey instead due to Australia's lack of ice. Similar to The Mighty Ducks character Luis Mendoza, she could skate fast but was unable to stop.", "She is allergic to chicken egg whites. For her scenes in Birds of Prey (2020) where Harley Quinn eats an egg sandwich, the production had to provide duck eggs to avoid an allergic reaction.", "Thinks of her name as a \"weird, formal, old-lady name\".", "The only time she has acted out giving birth in a movie was in Goodbye Christopher Robin (2017).", "She auditioned for the title role in Cinderella (2015) before Lily James was cast.", "She earned two Academy Award nominations before her thirtieth birthday."], "filmography": ["Ruin ()", "Barbie ()", "Gotham City Sirens ()", "Marian ()", "Untitled Joker/Harley Quinn Project ()", "Babylon", "Untitled David O. Russell Project ()", "The Suicide Squad", "Peter Rabbit 2", "Birds of Prey", "Megan Thee Stallion & Normani: Diamonds", "Bombshell", "Dollface", "Once Upon a Time... In Hollywood", "Dreamland", "Mary Queen of Scots", "Slaughterhouse Rulez", "Terminal", "Flopsy Turvy", "Tourism Australia: Dundee - The Son of a Legend Returns Home", "Peter Rabbit", "Goodbye Christopher Robin", "I, Tonya", "Suicide Squad", "The Legend of Tarzan", "Australian Psycho", "Whiskey Tango Foxtrot", "The Big Short", "Focus", "Z for Zachariah", "Suite Française", "The Wolf of Wall Street", "About Time", "Pan Am (2011-2012)", "Neighbours (2008-2011)", "I.C.U.", "Son Altesse Alex", "Vigilante", "Review with Myles Barlow", "City Homicide"]}