{"name": "Kristen Scott", "current role": " ", "birth name": " ", "birth date": " ", "birth place": " ", "height": "5' 5\" (1.65 m)", "biography": "Kristina \"Kristen\" Scott is an actress, writer, model, and entrepreneur from New Orleans, La. As the first girl in her familial generation group, Kristina adored athletic activities. She enrolled in gymnastics at the age of four. From that same year until middle school, she moved between cities; and transferred schools at least once every year (due to divorce.) Being the \"new girl\" left her vulnerable to bullying. At the age of seven, Kristina enrolled in karate classes; and eventually earned a black belt in Shotokan.At 13, Kristina discovered her love of acting when she began competing in her high school's Speech and Debate Team. In tournaments, she consistently placed in acting events. In her first year on the team, she was the youngest member to qualify for the Catholic National Forensic League tournament. Consequently, she had to share a room with her coaches in Chicago.The following year, Kristina and her duet acting partner placed 1st in Louisiana's State Tournament of Champions. She also qualified for nationals with her own self-written original oratory. During this year, she was also appointed the role of her team's \"Spirit Chair-Person.\"After receiving her diploma, Kristina enrolled in the University of Louisiana. Once completing the requirements for her first degree, she postponed graduation in order to acquire a second degree. During this time, she relocated to Spain; where she dual-enrolled at the Universidad de Granda's Centro de Lenguas Modernas (CLM,) a program specializing in foreign languages. Because she traveled to a foreign country alone, she joined a student acting improv group in order to make friends.Before graduating, Kristina published her first fictional short story in the University of Louisiana's Southwestern Review. She graduated as a Psi Chi member (National Honor Society for Psychology) with a Bachelor of Science in Psychology, a Bachelor of Arts in Spanish, and a minor in English.Following in the footsteps of her mother, Kristina also began dabbling into modeling for extra money while still in college. During this time, she met a film crew member who booked her first audition. This led to Kristina's first feature role; and the acting bug was back. After she began booking local roles, Kristina enrolled in classes at the Louisiana Academy of Performing Arts; and signed with FAME agency.::FAME", "trade mark": " ", "trivia": " ", "filmography": ["Zippo Girl", "Murderous Affairs", "Aztec Warrior", "Bad Moms", "Keanu", "Into the Badlands", "The Big Short", "Invisible Sister", "Scream: The", "NCIS: New Orleans", "White Rabbit", "Suit Up"]}