{"name": "George Clooney", "current role": "Danny Ocean", "birth name": "George Timothy Clooney", "birth date": "1961-05-06", "birth place": "Lexington, Kentucky, USA", "height": "5' 11\" (1.8 m)", "biography": "George Timothy Clooney was born on May 6, 1961, in Lexington, Kentucky, to Nina Bruce (née Warren), a former beauty pageant queen, and Nick Clooney, a former anchorman and television host (who was also the brother of singer Rosemary Clooney). He has Irish, English, and German ancestry. Clooney spent most of this youth in Ohio and Kentucky, and graduated from Augusta High School. He was very active in sports such as basketball and baseball, and tried out for the Cincinnati Reds, but was not offered a contract.After his cousin, Miguel Ferrer, got him a small part in a feature film, Clooney began to pursue acting. His first major role was on the sitcom E/R (1984) as \"Ace\". More roles soon followed, including \"George Burnett\", the handsome handyman on The Facts of Life (1979); \"Booker Brooks\", a supervisor on Roseanne (1988); and \"Detective James Falconer\" on Sisters (1991). Clooney had his breakthrough when he was cast as \"Dr. Doug Ross\" on the award-winning drama series, ER (1994), opposite Anthony Edwards, Noah Wyle, and Julianna Margulies.While filming \"ER\", Clooney starred in a number of high profile film roles, such as Robert Rodriguez's From Dusk Till Dawn (1996), and One Fine Day (1996), opposite Michelle Pfeiffer. In 1997, Clooney took on the role of \"Batman\" in Joel Schumacher's Batman & Robin (1997). The film was a moderate success in the box office, but was slammed by critics, notably for the nipple-laden Bat suit. Clooney went on to star in Steven Soderbergh's Out of Sight (1998), Terrence Malick's The Thin Red Line (1998), and David O. Russell's Three Kings (1999).In 1999, Clooney left \"ER\" (though he would return for the season finale) and appeared in a number of films, including O Brother, Where Art Thou? (2000), The Perfect Storm (2000), and Ocean's Eleven (2001). Collaborating once again with Steven Soderbergh, \"Ocean's Eleven\" received critical acclaim, earned more than $450 million at the box office, and spawned two sequels: Ocean's Twelve (2004) and Ocean's Thirteen (2007).In 2002, Clooney made his directorial debut with Confessions of a Dangerous Mind (2002), an adaptation of TV producer Chuck Barris's autobiography. This was the first film under the banner of \"Section Eight Productions\", a production company he founded with Steven Soderbergh. The company also produced many acclaimed films, including Far from Heaven (2002), Syriana (2005), A Scanner Darkly (2006), and Good Night, and Good Luck. (2005). Clooney won his first Oscar for Best Supporting Actor in \"Syriana\", and was nominated for Best Director and Best Original Screenplay for \"Good Night, and Good Luck\".In 2006, \"Section Eight\" was shut down so that Soderbergh could concentrate on directing, and Clooney founded a new production company, \"Smokehouse Productions\", with his friend and long-time business partner, Grant Heslov.Clooney went on to produce and star in Michael Clayton (2007) (which earned him an Oscar nomination for Best Actor), directed and starred in Leatherheads (2008), and took leading roles in Burn After Reading (2008), The Men Who Stare at Goats (2009), Fantastic Mr. Fox (2009), and Jason Reitman's Up in the Air (2009). Clooney received critical acclaim for his performance in \"Up in the Air\" and was nominated for several awards, including a Golden Globe and Academy Award. He didn't win that year, but took home both Best Actor awards (as well as countless nominations) for his role as a father who finds out his wife was unfaithful as she lay in a coma in Alexander Payne's The Descendants (2011). Throughout his career, Clooney has been heralded for his political activism and humanitarian work. He has served as one of the \"United Nations Messengers of Peace\" since 2008, has been an advocate for the Darfur conflict, and organized the \"Hope for Haiti\" telethon, to raise money for the victims of the 2010 earthquake. In March of 2012, Clooney was arrested for civil disobedience while protesting at the Sudanese embassy in Washington, D.C.Clooney was married to actress Talia Balsam, from 1989 until 1993. After their divorce, he swore he would never marry again. Michelle Pfeiffer and Nicole Kidman bet him $10,000 that he would have children by the age of 40, and sent him a check shortly after his birthday. Clooney returned the funds and bet double or nothing he wouldn't have children by the age of 50. Although he has remained a consummate bachelor, Clooney has had many highly publicized relationships, including with former WWE wrestler Stacy Keibler. In 2014, he married lawyer and activist Amal Clooney.::Anonymous and Tom Zoerner <Tom.Zoerner@informatik.uni-erlangen.de>", "trade mark": "Often plays scoundrels that are likable and have redeeming qualities", "trivia": ["Best man at the wedding of Richard Kind.", "Tried out for a position on the Cincinnati Reds baseball team.", "During the 1990s, Clooney often publicly asserted that he would never get remarried or have any children, but Michelle Pfeiffer and Nicole Kidman both bet $10,000 each that he would be a father before he turned 40. They were both wrong, and each sent him a check. He returned the money, betting double or nothing that he wouldn't have kids by age 50. At age 53, he broke his vows to never marry again when he wed human rights lawyer Amal Clooney (née Alamuddin) in 2014. In early 2017, news broke that the couple were pregnant with twins.", "Waged war against the paparazzi by boycotting Entertainment Tonight (1981), the sister show of Hard Copy (1989), which had filmed Clooney without his permission.", "Was voted \"Sexiest Man Alive\" by People Magazine. [1997]", "Was voted \"Best Dressed Male Television Star.\" [1997]", "Chosen by People (USA) magazine as one of the \"50 Most Beautiful People in the World.\" [1996]", "Cousin of Miguel Ferrer, Rafael Ferrer, Gabriel Ferrer, Monsita Ferrer, Maria Providencia Ferrer Murdock, Carlos Campo, Cathi Campo, Cari Leary, and Cristina Stretz. Half-cousin of Mica Darley. Cousin-in-law of Debby Boone and Terry Botwick.", "Uncle is the late actor José Ferrer.", "Nephew of singer/actress Rosemary Clooney and Betty Clooney. Half-nephew of Gail Stone.", "Educated at Northern Kentucky University.", "Owned a pet pig named Max, given to him by Kelly Preston, for eighteen years. Max died on December 1, 2006.", "Studied acting at The Beverly Hills Playhouse.", "Coincidentally, his first steady TV role was in the medical sitcom E/R (1984) that was based in Chicago and co-starred Elliott Gould, Mary McDonnell and Jason Alexander. Ten years later it would take another TV series ER (1994) (also based in Chicago) to finally launch him into the galaxy of superstardom.", "He was talk-show host 'Rosie ODonnell's very first guest when her TV show debuted (The 'Rosie ODonnell Show: Episode dated 10 June 1996 (1996)) and Stephen Colbert's first in September 2015 on The Late Show with Stephen Colbert: George Clooney/Governor Jeb Bush/Mavis Staples & Friends (2015).", "Committed to O Brother, Where Art Thou? (2000) before even reading a script, because of his wish to work with the Coen brothers. He even accepted a significantly lower salary than usual.", "Reportedly got into a fistfight with Three Kings (1999) director David O. Russell on the set. Russell had yelled and derided a few extras out of frustration and Clooney didn't appreciate it. Russell has since said, \"I wouldn't make another George Clooney movie if they paid me $20 million.\"", "Good friends with actor Mark Wahlberg and Ben Weiss.", "Has stated in several interviews that he has suffered from bleeding stomach ulcers and is still on medication for stomach pain.", "Ranked #27 on Premiere's 2002 Power 100 List.", "Frequently stars in so-called \"heist movies\" that revolve around some type of robbery: Out of Sight (1998), From Dusk Till Dawn (1996), Three Kings (1999), O Brother, Where Art Thou? (2000), Ocean's Eleven (2001), Welcome to Collinwood (2002), Ocean's Twelve (2004), Ocean's Thirteen (2007), and Fantastic Mr. Fox (2009).", "Ex-son-in-law of Martin Balsam and Joyce Van Patten while he was married to Talia Balsam.", "First cousin once removed of Gabi Ferrer.", "One of People Magazine's \"Top 50 Bachelors\" (2002).", "Was a pallbearer at the funeral of his late aunt, Rosemary Clooney.", "He got his start in a movie starring his cousin, Miguel Ferrer. Later, after Clooney had established himself on ER (1994), Ferrer made a guest appearance on the very first show. George's aunt, Rosemary Clooney, made guest appearances on two shows the first month ER (1994) aired.", "Ranked #29 in Premiere's 2003 annual Power 100 List.", "Is the sixth actor to play Batman.", "No. 3 of 10 Top Sexiest Men in People magazine. (2003)", "His voice was dubbed for the singing moments in O Brother, Where Art Thou? (2000).", "Heads his own film and television production company, Maysville Pictures.", "Shared an apartment with actor Thom Mathews during the early 1980s.", "Was the second man, after Richard Gere, to make an appearance on the cover of Vogue magazine.", "Ranked #16 on VH1's \"100 Hottest Hotties.\"", "Rode a bicycle to get to auditions as a struggling actor.", "Son of actor and AMC host Nick Clooney and Nina Warren Clooney.", "He loves the show South Park (1997). He got a hold of Trey Parker, the creator of the series, and asked for a part in an episode. He was given the role of \"Sparky,\" the gay dog, which involved little more than panting and yelping. However, when it was time for South Park to go to the big screen, Clooney got a full speaking part, as an ER surgeon.", "He has Irish, English, German, and smaller amounts (to varying degrees) of Scots-Irish, Scottish, Welsh, Dutch, and French Huguenot, roots.", "At 43, he was voted sexiest male celebrity in a 'Naughty Forties' poll conducted for UK television station FX.", "Shared an L.A. home with Kelly Preston when both were struggling actors.", "Auditioned five times for Ridley Scott for the role of J.D. in Thelma & Louise (1991), a role that ultimately went to future friend Brad Pitt and catapulted Pitt to super-stardom.", "Born 2:48 AM, EST.", "He loves beer. He does voiceovers for Budweiser TV commercials and allegedly had a beer keg installed in his dressing room during filming of Ocean's Eleven (2001).", "Lived in a friend's closet while struggling as an actor in L.A., early in his career.", "Is a Dallas Mavericks fan.", "Received the first \"Spirit of Independence Award\" of the Los Angeles Film Festival and Find Independent (FIND). [June, 2005]", "He and his Ocean's Eleven (2001) and Ocean's Twelve (2004) co-stars, Julia Roberts, Brad Pitt and Elliott Gould, and Bruce Willis who did a cameo in Ocean's Twelve as himself, all have guest-starred on the TV show Friends (1994), though not in the same episodes.", "Appears on the cover of the first Men's Vogue. (2005)", "In October 2005, after an accident on the set of his movie Syriana (2005), he suffered from back pain, bad headaches, and memory loss. After several spine surgeries, he fully recovered.", "Sought the role of Jack in Sideways (2004). However, the film's director, Alexander Payne, felt that he was too big a star, and turned him down in favor of Thomas Haden Church.", "Owns a villa in Laglio at Lake Como, Italy, where he lives several months of the year.", "In winning the Best Supporting Actor Oscar for Syriana (2005), he becomes the second generation of his family to win an Oscar. His uncle, José Ferrer, won a Best Actor Oscar for playing in Cyrano de Bergerac (1950). Also appearing in Syriana (2005) was Christopher Plummer, who once played Christian to Ferrer's Cyrano in a subsequent production, and later succeeded Ferrer as Cyrano as well.", "Is the first actor who played Batman (in Batman & Robin (1997) to win an Oscar (for Best Supporting Actor in Syriana (2005)). Five years later, Christian Bale won the Oscar for Best Supporting Actor in The Fighter (2010).", "Frequently involves himself in projects involving the \"Golden Age\" of television. For example, he produced and starred in Fail Safe (2000), a throwback to the live television plays of the 1950s and 1960s; he directed and appeared in Confessions of a Dangerous Mind (2002), a movie about Chuck Barris' career in early game shows; and he directed, wrote, and appeared in Good Night, and Good Luck. (2005), a movie about Edward R. Murrow's battle with Senator Joseph McCarthy.", "Ranked #21 on Premiere's 2006 \"Power 50\" list. Had ranked #43 in 2005.", "Turned down the role of Sgt. John McLoughlin in World Trade Center (2006).", "As of 2006, he is the only regular cast member from ER (1994) to win an Oscar (for Best Supporting Actor in Syriana (2005)).", "Was originally to star in Jack Frost (1998) but chose to do Batman & Robin (1997) instead. His part went to Michael Keaton, who had previously starred as Batman in Batman (1989) and in Batman Returns (1992).", "Played a gangster in seven movies: From Dusk Till Dawn (1996), Out of Sight (1998), O Brother, Where Art Thou? (2000), Ocean's Eleven (2001), Welcome to Collinwood (2002), Ocean's Twelve (2004), and Ocean's Thirteen (2007).", "In August 2006, he and his producing partner Steven Soderbergh decided to close down their Section Eight production company after a 6-year working partnership.", "He and Grant Heslov founded production company Smoke House after his production company Section Eight closed down.", "He auditioned for the role of Mr. Blonde/Vic Vega in Reservoir Dogs (1992), but was turned down.", "In 2006, voted People Magazine's \"Sexiest Man Alive\".", "From 1996 through 2003, stuntman Brad Martin served as Clooney's personal stunt double.", "His famed \"Roman haircut\" was actually an accident. While filming From Dusk Till Dawn (1996), he wanted to make his character Seth Gecko look really crazy with a chopped off hairstyle. But the haircut became popular and turned into a positive.", "Suffered from Bell's palsy for a time while he was in high school.", "In December 2006, he traveled to China and Egypt to make a personal plea to Chinese and Egyptian officials to use their ties with the Sudanese government to help stop the violence in the Darfur region.", "Was considered for the part of Reed Richards in Fantastic Four (2005).", "His The Peacemaker (1997) co-star Nicole Kidman presented him his Best Supporting Actor Oscar in 2006.", "In 2001 was voted Most Eligible Bachelor by People Magazine.", "Clooney grew up working in tobacco fields. In his late teens, he took up smoking and continued to do so through his late 20's. A decision he regrets and has discussed in numerous interviews. He finally decided to quit when his favorite Uncle died after a long battle with lung cancer. Clooney's parents were non-smokers, although many of his Aunts and Uncles smoked.", "In September 2006 he addressed the United Nations Security Council, urging it to act over Darfur.", "Helped celebrate a plan to rebuild a hospital in hurricane-devastated Louisiana alongside former President George Bush. The pair appeared outside the courthouse in Cameron Parish, the only surviving building in the town following Hurricane Rita. Bush presented local officials with a check for $2 million from the Bush-Clinton Katrina fund. The money will help run South Cameron Memorial Hospital once it has been rebuilt. Former ER (1994) star Clooney quipped, \"There is good news in all of this, which is that when the hospital gets up and running, I will not be doing any of the medical procedures\" (20 December 2006).", "In 2007, he was ranked #13 on Entertainment Weekly's 'The 50 Smartest People in Hollywood'.", "In 2007, Forbes Magazine estimated his earnings for the year at $25 million.", "Supported Senator Barack Obama's bid to win the Democratic nomination for the 2008 presidential election.", "He and his girlfriend, Sarah Larson, had an accident in 2007 while riding a motorcycle. She broke some toes, and Clooney broke a rib.", "Turned down two roles which went to Kevin Kline: \"Artemus Gordon\" in Wild Wild West (1999) and \"Guy Noir\" in A Prairie Home Companion (2006).", "Merited a place in Time magazine's \"100 Most Influential People in the World\" (Artists & Entertainers section) with a tribute written by Roseanne Barr (Issue May 12, 2008).", "His palatial estate \"Villa Oleandra\" in Laglio overlooking Italy's Lake Como comprises 15 rooms, a wine cellar, and a master bedroom suite atop three floors. In his garage, Clooney keeps his collection of Piaggio motorbikes. Docked at his pier is a Colombo classic powerboat. Previously owned by philanthropist Drue Heinz, the former mother-in-law of Teresa Heinz Kerry, wife of US Secretary of State John Kerry, Clooney discovered the property when the was tossed from his Harley-Davidson motorcycle near the gates of the villa while touring the region in 2001. He purchased the estate for a reported EUR11.7 million in 2002.", "Quit the WGA in April 2008 after the union turned down his wish to be credited as a co-writer for Leatherheads (2008). He felt that he was let down by the union.", "His favorite song is \"Destination Moon\" by Dinah Washington.", "Friend of Rande Gerber.", "On the DVD commentary for Good Night, and Good Luck. (2005), George Clooney says that shortly after he met Grant Heslov in 1982, Heslov loaned Clooney $200.00 to buy his first set of headshots, and they have been friends ever since (and later writing and producing partners).", "His production company, Section 8 Productions, is named after Jamie Farr's M*A*S*H (1972) character \"Maxwell Q Klinger\" (Klinger tried to get out of the army via a section 8).", "Lives in Los Angeles, California.", "He is known for his self-mocking sense of humor. The creators of South Park (1997) spoofed his Oscar acceptance speech in a South Park episode, and his political views in Team America: World Police (2004). Clooney commented that he would have been really disappointed, had he not been spoofed in the latter.", "Has an older sister named Adelia \"Ada\" Clooney Zeidler. She married the late Norman Monroe Zeidler, an artist and U.S. Army captain, who died of a heart attack in 2004. They have two children, Allison and Nick, who (until the 2017 birth of Amal and George Clooney's twins) were the only grandchildren of Nina Clooney and Nick Clooney.", "Appeared on the cover of GQ magazine four times: March '95, October '97, November '98 (with Harrison Ford and Chris Rock) and January '03.", "His role as Danny Ocean in the Ocean's Eleven (2001) trilogy was parodied on Robot Chicken (2005), and the character was voiced by his cousin Miguel Ferrer.", "Three of the films he has directed are concerned with jobs held by himself or his father. Nick Clooney was a news anchor, and Good Night, and Good Luck. (2005) is about television reporters. Nick later ran an unsuccessful campaign for Congress. George plays a man running for President in The Ides of March (2011). Leatherheads (2008) was about college football. Before becoming an actor, George pursued a career as a professional athlete.", "Was in a 2-year relationship with Italian actress Elisabetta Canalis (2009-2011).", "Relationship with Stacy Keibler [2011-2013].", "During the 2012 Newsweek Magazine Oscar roundtable, Clooney told a story about working for the women's shoe department of a Cincinnati, Ohio, department store in 1979. He said that it was fashionable at that time for some women to have their fourth toe surgically removed so that they could more easily fit into tight pumps and heels. He came to know which women had had this procedure done, and he always tried to pass those customers of onto his coworkers, since he found the sight of the deliberately missing toe so disturbing.", "He and his father, Nick Clooney, were arrested, on March 16, 2012, for participating in a staged protest outside the Sudanese embassy in Washington, D.C.", "Is supporting President Barack Obama's 2012 reelection campaign, and hosted a fundraiser for the President at his home on May 10, 2012. A record $15 million in contributions was raised.", "Has been friends with Sandra Bullock for around 25 years. They appear in a movie together for the first time in Gravity (2013).", "Suffers from a form of malaria that surfaces from time to time; he has to live with it for the rest of his life.", "Directed one Oscar nominated performance: David Strathairn in Good Night, and Good Luck. (2005).", "In Amsterdam (Netherlands) filming for Ocean's Twelve (2004). [May 2004]", "Appointed a U.N. \"Messenger of Peace\". [January 2008]", "As of 2014, has appeared in 6 films that were nominated for the Best Picture Oscar: The Thin Red Line (1998), Good Night, and Good Luck. (2005), Michael Clayton (2007), Up in the Air (2009), The Descendants (2011) and Gravity (2013), and produced the Oscar- winning Argo (2012). He was nominated for Best Actor for Michael Clayton, Up in the Air and The Descendants, and Best Director and Best Original Screenplay for Good Night, and Good Luck. Thus, he joins Orson Welles and Warren Beatty in being nominated for producing, directing, writing and lead acting in an Oscar Best Picture nominee, but did it for different films.", "In 2002, he made a controversial joke about Charlton Heston getting Alzheimer's disease; for which he refused to apologize.", "He and his cousin, Miguel Ferrer, have both shared a role with their respective fathers. Nick Clooney plays the aged version of George's character in The Monuments Men (2014). Miguel Ferrer played the younger version of José Ferrer's character on the Magnum, P.I. (1980) episode, Magnum, P.I.: Lest We Forget (1981).", "Among the guests at his wedding to Amal Alamuddin were Bono, Matt Damon, Cindy Crawford, Richard Kern and Anna Wintour.", "In the process of setting the mood at his home for his marriage proposal to fiancée Amal, George programmed a playlist of his legendary aunt Rosemary Clooney's records including the apt, \"Why Shouldn't?\" (first verse: Why shouldn't I take a chance when romance passes by? / Why shouldn't I know of love? / Why wait around when each age has a sage who has sung / That upon this earth love is all that is really worth thinking of?).", "Is very closely related to the noted Republican president Abraham Lincoln. Lincoln's aunt is George Clooney's great-great-great-great grandmother. Which also makes him a distant cousin of Tom Hanks, via Lincoln's mother Nancy Hanks.", "He gained 30 pounds for his Oscar winning role as Bob Barnes in Syriana (2005).", "His wedding to Amal Clooney (Amal Alamuddin) cost an estimated $4.6 million.", "Continued to be good friends with Charlotte Rae until Charlotte's death in 2018.", "Expecting twins with his wife, Amal Clooney [February 2017].", "Close friends with Michelle Pfeiffer, Matt Damon, Julianna Margulies, Don Cheadle, Tina Fey, Anthony Edwards, Nicole Kidman, Cindy Crawford, Brad Pitt, and Julia Roberts.", "Is the only person to have been nominated for an Oscar in 6 different categories. Best Picture for Argo (2013), Best Actor for The Descendents (2011), Up In The Air (2009) and Michael Clayton (2007), Best Adapted Screenplay for The Ides Of March (2011), Best Supporting Actor for Syriana (2005), and finally Best Director and Best Original Screenplay for Good Night And Good Luck (2005).", "Co-founded the popular drink brand \"Casamigos Tequila\" (house of friends) with friend and business partner Rande Gerber in 2013.", "At 8 weeks he unknowingly and accidentally broke the \"12 week pregnancy rule\" when he told friend Matt Damon that he and his wife were expecting twins.", "Announced that he will co produce with John Madden, who will direct, Gates of Fire, based on the epic Greek Battle of Thermopylae in 480BC when 300 Spartan warriors held back rampaging soldiers from the Persian Empire for six days before being slaughtered.", "Played two unrelated movie characters with the last name Gates. Portrayed Lee Gates in \"Money Monster\" (2016) and Archie Gates in \"Three Kings\" (1999).", "George and Amal Clooney welcomed 2 babies on 6th June 2017, daughter, Ella, and son, Alexander.", "A renowned practical joker, of whom Brad Pitt is often a target, George Clooney revealed on The Graham Norton Show, that he had replaced the license plate frame on Brad Pitt's car with one that said, \"Fuck Cops.\" Of course, Pitt was pulled over by the LAPD.", "With his partners sold their tequila brand Casamigos to Diageo Plc, a British multinational alcoholic beverages company for $1 Billion. [June 2017]", "He is the only actor to have played Batman who hasn't also played a figure from The Bible.", "He is close friends with Ben Affleck. Both have played Batman in live-action films.", "Has been romantically linked with Jennifer Siebel Newsom, Mariella Frostrup, Céline Balitran, Lisa Snowdon, Linda Thompson, Charlize Theron, Frances Fisher, Karen Duffy, Vendela Kirsebom, Kimberly Russell and Cameron Diaz.", "His cousin Miguel Ferrer was known for his role on Twin Peaks (1990). Clooney has worked with some of the other cast members. He appeared in From Dusk Till Dawn (1996) with Michael Parks, The Descendants (2011) with Michael Ontkean, Good Night, and Good Luck. (2005) with Ray Wise, and Grizzly II: Revenge (1983) with Laura Dern. His character in O Brother, Where Art Thou? (2000) was also named after Everett McGill.", "Clooney was once related, by marriage, to actor Dick Van Patten. Van Patten's younger sister, Joyce Van Patten, is the mother of Clooney's first wife, Talia Balsam.", "As of November 2019, twelve of George Clooney's 91 acting credits on IMDb are for appearing in Nespresso commercials.", "Has been cutting his own hair for over 25 years using an old-fashioned Flowbee."], "filmography": ["The Midnight Sky", "Catch-22", "Nespresso: The Quest", "Nespresso: Comin' Home", "Nespresso: Change Nothing", "Money Monster", "Hail, Caesar!", "A Very Murray Christmas", "Nespresso: Révélation", "Tomorrowland", "How Far Would You Go for a Nespresso?", "The Monuments Men", "Nespresso: In the Name of Pleasure", "Gravity", "Nespresso: Like a Star", "Obama 2012 Convention Film", "8", "Touch of Evil", "Nespresso: The Swap", "The Descendants", "The Ides of March", "Nespresso: Cab Driver", "The American", "Nespresso: The Piano", "Fantastic Mr. Fox", "The Men Who Stare at Goats", "Up in the Air", "ER (1994-2009)", "Burn After Reading", "Leatherheads", "Nespresso: George Who?", "Entourage", "Michael Clayton", "Ocean's Thirteen", "The Good German", "Nespresso... What Else?", "Syriana", "Good Night, and Good Luck.", "Ocean's Twelve", "Intolerable Cruelty", "Spy Kids 3-D: Game Over", "Confessions of a Dangerous Mind", "Solaris", "Welcome to Collinwood", "Ocean's Eleven", "Spy Kids", "The Perfect Storm", "O Brother, Where Art Thou?", "Fail Safe", "Three Kings", "South Park: Bigger, Longer & Uncut", "The Thin Red Line", "Out of Sight", "Murphy Brown", "The Peacemaker", "South Park", "Batman & Robin", "One Fine Day", "From Dusk Till Dawn", "Friends", "Sisters (1993-1994)", "The Building", "Bodies of Evidence (1992-1993)", "Without Warning: Terror in the Towers", "Unbecoming Age", "Sunset Beat (1990-1992)", "The Harvest", "Jack's Place", "Roseanne (1988-1991)", "Rewrite for Murder", "Baby Talk", "Knights of the Kitchen Table", "Red Surf", "Hot Prospects", "Return of the Killer Tomatoes!", "The Law and Harry McGraw", "Bennett Brothers", "The Golden Girls", "Murder, She Wrote (1984-1987)", "Return to Horror High", "Hunter", "The Facts of Life (1985-1987)", "Combat High", "Throb", "Hotel", "Crazy Like a Fox", "E/R (1984-1985)", "Street Hawk", "Riptide", "Grizzly II: Revenge", "And They're Off", "Centennial"]}