{"name": "Bryan Cranston", "current role": "Shannon", "birth name": "Bryan Lee Cranston", "birth date": "1956-03-07", "birth place": "Hollywood, California, USA", "height": "5' 10½\" (1.79 m)", "biography": "Bryan Lee Cranston was born on March 7, 1956 in Hollywood, California, to Audrey Peggy Sell, a radio actress, and Joe Cranston, an actor and former amateur boxer. His maternal grandparents were German, and his father was of Irish, German, and Austrian-Jewish ancestry. He was raised in the Canoga Park neighborhood of Los Angeles, and also stayed with his grandparents, living on their poultry farm in Yucaipa. Cranston's father walked out on the family when Cranston was eleven, and they did not see each other again until 11 years later, when Cranston and his brother decide to track down their father.Cranston is known for his roles as Walter White on the AMC crime drama Breaking Bad (2008), Hal on the Fox situation comedy Malcolm in the Middle (2000), and Dr. Tim Whatley on five episodes of the NBC situation comedy Seinfeld (1989). For his role on \"Breaking Bad\", he won the Primetime Emmy Award for Outstanding Lead Actor in a Drama Series four times (2008-2010, 2014), including three consecutive wins. After becoming one of the producers during the series' fourth and fifth seasons, he also won the Primetime Emmy Award for Outstanding Drama Series twice.In June 2014, Cranston won the Tony Award for Best Actor in a Play for his portrayal of Lyndon B. Johnson in the play \"All the Way\" on Broadway. He reprised the role of Lyndon Johnson in the television adaptation All the Way (2016), which earned him widespread praise by critics. For the biographical drama Trumbo (2015), he earned widespread acclaim and was nominated for the Academy Award for Best Actor. Cranston also appeared in several acclaimed films, such as Saving Private Ryan (1998), Little Miss Sunshine (2006), Drive (2011), Argo (2012) and Godzilla (2014). In 2019, he starred with Kevin Hart in the box office hit The Upside (2017).::Pedro Borges", "trade mark": "Powerful deep voice", "trivia": ["Has one daughter with Robin Dearden: Taylor Dearden.", "Is the second of three children of Joe Cranston and Audrey Peggy Sell, who both acted. Younger brother of Kyle Edward Cranston.", "Once did voice acting for the English dubbing of Japanese animation (or anime), under the name Lee Stone.", "In the original Armitage III: Polymatrix (1996) episode home video release (also know as an OAV),he's listed as \"Lee Stone\", but in the movie edition of the same name he's listed under his real name.", "Became an ordained minister when he was in college as a part-time job.", "Got his start at the Granada Theatre in the San Fernando Valley, CA.", "Produced his KidSmartz (2003) safety video with his Malcolm in the Middle (2000) crew during one of their weeks off.", "Such a huge fan of baseball that his wife threw him a surprise 40th birthday party at Dodger Stadium.", "Always grew a beard and mustache during his hiatuses from Malcolm in the Middle (2000).", "His favorite episode of Malcolm in the Middle (2000) is the first season episode, Malcolm in the Middle: Rollerskates (2000). He spent six weeks, before filming, learning how to roller-skate.", "Impersonated Brad Garrett's Everybody Loves Raymond (1996) voice shortly after losing to him for the second year in a row at the 2004 Emmy Awards. The crowd laughed hysterically, as did Garrett himself.", "Presented the category \"Outstanding Directing for a Comedy Series\" at the 2004 Emmy Awards with his Malcolm in the Middle (2000) co-star Jane Kaczmarek.", "Was singled out by frequent Malcolm in the Middle (2000) director Todd Holland during his Emmy Award speech in 2001. Cranston had been overlooked that year, and Holland proclaimed that he would \"stand up here soon\". Cranston was subsequently nominated for the first-time the next year.", "The last name of the first Blue Ranger on Mighty Morphin Power Rangers (1993) was named after him. He did various work as part of the crew (voice-overs, etc.), so the Blue Ranger's full name became Billy Cranston.", "Has a dog named Sugar, saved from a Los Angeles pound.", "Enjoys playing the drums and traveling to Hawaii.", "Met his wife, Robin Dearden, on the set of Airwolf: Desperate Monday (1986). He was playing the villain of the week, and she was his hostage held at gunpoint.", "Attended and graduated from Canoga Park High School in Canoga Park, CA, in 1974.", "Honored as Grand Marshal of the 2006 Sherman Oaks, CA, Street Fair by the Chamber of Commerce for his leadership in the community and his protection of children through KidSmartz (2003).", "At one point he considered becoming a police officer.", "Has played Erik Per Sullivan's character's father on Malcolm in the Middle (2000) and wrote recommendation letters for his college applications.", "In his younger years he spent two years traveling around the US by motorcycle with his brother.", "For his role on Breaking Bad (2008), he was named one of the \"Eight Actors Who Turn Television into Art\", in the cover story of the New York Times magazine (September 11, 2011).", "Has run in four marathons.", "His daughter, Taylor Dearden, studies Theater at the University of Southern California.", "Was roommates with Javier Grajeda early in their careers.", "He said his acting heroes are Dick Van Dyke, Jack Lemmon, Rod Steiger and Spencer Tracy.", "His paternal grandfather, Edward B. Cranston, was of Irish ancestry, partly by way of Canada (Montreal). His paternal grandmother, Alice Rose Bower, was of half Austrian Jewish and half German descent. His maternal grandparents, Otto Frederick William Sell and Augusta Liza Marchert, were both German emigrants, Otto from Rendsburg and Augusta from Danzig.", "Received an associate degree in police science from Los Angeles Valley College in 1976.", "Spent part of his youth on a farm with his grandparents in Yucaipa, as his family lost their home in foreclosure.", "Did not seriously pursue acting until he was in his late 20s as his parents, who were both actors, did not want him to follow them into the business.", "Is a part-owner of the independent theater Cinemas Palme d'Or in Palm Desert, CA.", "He called Mark Rylance a major influence. Both actors won Tony Awards in 2014: Cranston for \"Best Actor in a Play\" for \"All the Way\" and Rylance for \"Best Featured Actor in a Play\" for his performance in \"Twelfth Night\". One of Cranston's competitors for the award was Rylance for his performance in \"Richard III\".", "With his fourth Emmy Award victory for his performance on Breaking Bad (2008), he tied the record of Dennis Franz (NYPD Blue (1993)) for the most wins in the category \"Outstanding Actor in a Drama Series\". Peter Falk also won four Emmys for his lead performances as Columbo (1971), three of them as \"Outstanding Lead Actor in a Drama Series\" (in 1972 known as \"Outstanding Continued Performance by an Actor in a Leading Role in a Dramatic Series\") and one as \"Best Lead Actor in a Limited Series\".", "Interviewed in 2015, he named On the Waterfront (1954) as his favorite movie.", "His Trumbo (2015) co-star Helen Mirren called him one of the greatest American actors.", "Both Cranston and his Breaking Bad (2008) co-star Jonathan Banks played the role of James Gordon in the Batman franchise: the first voiced the character in the animated feature Batman: Year One (2011) while the second did it in the video games Batman: Arkham Knight (2015) and Batman: Arkham Knight (2015).", "He starred in three movies that were nominated for the Best Picture Oscar: Saving Private Ryan (1998), Little Miss Sunshine (2006) and Argo (2012). \"Argo\" was a winner in the category.", "Saw the face of his daughter Taylor Dearden projected onto Krysten Ritter in a pivotal scene on Breaking Bad (2008) as her character laid dying, which made him cry-- but he snapped back into character and the image went away.", "When asked what his favorite thing is about his wife Robin Dearden, he replied, \"She still gets giddy when she sees a firefly.\".", "Asked by the Hollywood Reporter's Matt Belloni which one of his movies he'd most like to have deleted from his IMDb filmography, Bryan was quick to nominate Amazon Women on the Moon (1987).", "He won the 2017 Critics' Circle Theatre Award for Best Actor for his performance in \"Network\" at the National Theatre in London.", "He won the 2018 Laurence Olivier Award Award for \"Best Actor in a Play\" for his performance in \"Network\" at the National Theatre in London.", "Of Clan Cranstoun."], "filmography": ["Your Honor (2020-2021)", "The Stand", "The One and Only Ivan", "Home Movie: The Princess Bride", "Family Guy (2006-2020)", "El Camino: A Breaking Bad Movie", "SuperMansion (2015-2019)", "Last Week Tonight with John Oliver", "Robot Chicken (2011-2018)", "Isle of Dogs", "Electric Dreams", "Curb Your Enthusiasm", "Last Flag Flying", "The Disaster Artist", "The Upside", "Power Rangers", "Sneaky Pete (2015-2017)", "Why Him?", "Saturday Night Live", "In Dubious Battle", "Wakefield", "The Infiltrator", "All the Way", "Get a Job", "Zendaya: Neverland", "Kung Fu Panda 3", "Trumbo", "Godzilla", "Family Guy: The Quest for Stuff", "Writer's Block", "How I Met Your Mother (2006-2013)", "Breaking Bad (2008-2013)", "Cold Comes the Night", "Übermansion", "The Cleveland Show (2012-2013)", "The Simpsons (2012-2013)", "Seth Rogen = Worst Person in the World", "30 Rock", "Argo", "Total Recall", "Rock of Ages", "Madagascar 3: Europe's Most Wanted", "Archer", "John Carter", "Madagascar 3: The Video Game", "Red Tails", "Batman: Year One", "Contagion", "Glenn Martin DDS (2010-2011)", "Larry Crowne", "Leave", "Drive", "Detachment", "The Lincoln Lawyer", "The Handlers", "Love Ranch", "American Dad! (2005-2010)", "Breaking Bad: Original Minisodes", "The Hollywood Quad", "Hard Four", "Fallen", "Malcolm in the Middle (2000-2006)", "Dark Mind", "Little Miss Sunshine", "Magnificent Desolation: Walking on the Moon 3D", "Lilo & Stitch: The Series (2003-2005)", "Illusion", "Seeing Other People", "Thanksgiving Family Reunion", "The Santa Claus Brothers", "'Twas the Night", "The King of Queens (1999-2001)", "Gary & Mike", "Clerks (2000-2001)", "The Big Thing", "Terror Tract", "The Prince of Light", "The Pretender", "3rd Rock from the Sun", "Last Chance", "Honey, I Shrunk the Kids: The TV Show", "Working", "Chicago Hope", "The X-Files", "Diagnosis Murder (1996-1998)", "V.I.P.", "Saving Private Ryan", "From the Earth to the Moon", "Brooklyn South", "Eagle Riders (1996-1997)", "Seinfeld (1994-1997)", "Time Under Fire", "Alright Already", "Total Security", "Pearl", "Sabrina the Teenage Witch", "Goode Behavior", "Dogs", "Babylon 5", "Moloney", "Strategic Command", "Street Corner Justice", "The Rockford Files: Punishment and Crime", "That Thing You Do!", "Armitage III: Polymatrix", "The Louie Show", "Murder, She Wrote (1986-1996)", "Armitage III", "Extreme Blue", "Teknoman", "Nowhere Man", "Land's End", "Brotherly Love", "Kissing Miranda", "Touched by an Angel", "Days Like This", "Macross Plus", "Men Who Hate Women & the Women Who Love Them", "The Companion", "Street Fighter II: The Animated Movie", "Clean Slate", "Walker, Texas Ranger", "Viper", "Erotique", "Orguss 02", "Mighty Morphin Power Rangers", "Prophet of Evil: The Ervil LeBaron Story", "The Disappearance of Nora", "Moldiver", "Ramayana: The Legend of Prince Rama", "Davis Rules", "L.A. Law", "Matlock (1987-1991)", "Dead Silence", "The Flash", "Dead Space", "Hull High", "Corporate Affairs", "Jake and the Fatman", "Capital News", "Baywatch", "I Know My First Name Is Steven", "Falcon Crest", "Raising Miranda", "The Big Turnaround", "Amazon Women on the Moon", "The Return of the Six-Million-Dollar Man and the Bionic Woman", "Hill Street Blues", "Wings of Honneamise", "North & South: Book 2, Love & War", "Airwolf", "Cover Up", "Loving (1983-1984)", "CHiPs", "Crisis Counselor", "Call of the Wild: Howl, Buck", "Galaxy Express 999: Can You Love Like a Mother!?", "To Race the Wind", "One Life to Live"]}