{"name": "Patricia Clarkson", "current role": "Rachel 2", "birth name": "Patricia Davies Clarkson", "birth date": "1959-12-29", "birth place": "New Orleans, Louisiana, USA", "height": "5' 5\" (1.65 m)", "biography": "This remarkable, one-of-a-kind actress has, since the early 1990s, intrigued film and TV audiences with her glowing, yet careworn eccentricity and old world-styled glamour. Very much in demand these days as a character player, Patricia Clarkson nevertheless continues to avoid the temptation of money-making mainstream filming while reaping kudos and acting awards in out-of-the-way projects.The New Orleans born-and-bred performer with the given name of Patricia Davies Clarkson was born on December 29, 1959, the daughter of Arthur (\"Buzz\") Clarkson, a school administrator, and Jackie Clarkson, a local city politician and councilwoman. Patricia demonstrated an early interest in acting and managed to appear in a few junior high and high school-level plays while growing up. She took her basic college studies at Louisiana State University, studying speech for two years, before transferring to New York's Fordham University and graduating with honors in theatre arts.Accepted into the prestigious Yale School of Drama graduate program, she earned her Master of Fine Arts after gracing a wide range of productions including \"Electra,\" \"Pericles,\" \"Twelfth Night\", \"The Lower Depths,\" \"The Misanthrope,\" \"Pacific Overtures\" and \"La Ronde\". From there she took on New York City where she attracted strong East Coast notice in 1986 for her portrayal of Corrina in \"The House of Blue Leaves\" and in such other plays as \"Eastern Standard\" (1988) and \"Wolf-Man\" (1989).Known for her organic approach to acting, the flaxen-maned actress decided to try out her trademark whiskey voice in Hollywood at age 28, making her movie debut as Mrs. Eliot Ness in Brian De Palma's The Untouchables (1987) starring Kevin Costner. The following years she gained attention for playing Samantha Walker in The Dead Pool (1988) where she starred opposite Clint Eastwood's popular \"Dirty Harry\" character. Playing supportive, wifely types at the onset, she became a strong contender for character stardom by the mid-to-late 1990s, not only on stage but in the independent film arena.On stage Patricia received impressive notices for her contributions to the plays \"Raised in Captivity,\" \"The Ride Down Mt. Morgan,\" \"Three Days of Rain\" and, in particular, \"The Maiden's Prayer,\" which nabbed her both Outer Critics Circle and Drama Desk Award nominations. In 2004, she finally enacted the classic part she seemed born to play, that of Southern belle Blanche DuBois in the Kennedy Center production of \"A Streetcar Named Desire\". She earned glowing notices.On camera she was offered roles of marked diversity. From the heavier dramatics of a film like Pharaoh's Army (1995), she could move deftly into light comedy, courtesy of Neil Simon in the TV-movie London Suite (1996). It was, however, her bleak, convulsive portrayal of Greta, a strung-out, heroin-happy German has-been actress, opposite a resurgent Ally Sheedy in the acclaimed art film High Art (1998) that truly put Patricia on the indie map. From this she was handed a silver plate's worth of excitingly offbeat roles. In 2003 alone, Patricia received a special acting prize at the Sundance Film Festival for her superb work in three films: as a somber, grieving artist in The Station Agent (2003), a cold-hearted cancer victim in Pieces of April (2003), and a jokey, get-with-it mom in All the Real Girls (2003). She was nominated for a \"Best Supporting Actress\" Oscar for the second film mentioned.On TV Patricia received two Emmys for her recurring guest part as Frances Conroy's free-spirited sister in the acclaimed black comedy series Six Feet Under (2001). She also received the New York Film Critics Circle and the National Society of Film Critics awards for her supporting work in the gorgeous, 1950s-styled melodrama Far from Heaven (2002), as a prim and proper Stepford-wife and deceptive friend to Julianne Moore.No matter the size, such as her extended cameos in The Green Mile (1999), All the Real Girls (2003), Miracle (2004) and Elegy (2008), Patricia manages to make the most of whatever screen time she has, often stealing scenes effortlessly. Working for director/actor Woody Allen in a small but notable role in Vicky Cristina Barcelona (2008), he was impressed enough to promote her with a lead in a subsequent film Whatever Works (2009).More recent work includes leads and supports in the films Vincent in Brixton (2003), Legendary (2010), Friends with Benefits (2011), Learning to Drive (2014), The Bookshop (2017), Delirium (2018), Out of Blue (2018), Almost Love (2019) and as the antagonist Ava Paige in the sci-fi thrillers The Maze Runner (2014), Maze Runner: The Scorch Trials (2015) and Maze Runner: The Death Cure (2018). On TV, the never-married Patricia earned a supporting Golden Globe for her fine work in the mini-series Sharp Objects (2018) and had a strong recurring role on the political series House of Cards (2013).::Gary Brumburgh / gr-home@pacbell.net", "trade mark": " ", "trivia": ["Went to ivy-league Yale college to study dramatic arts.", "Daughter of New Orleans, LA councilwoman Jackie Clarkson.", "Graduated Fordham University's College at Lincoln Center, 1982.", "Some of her favorite movies are: Desk Set (1957), Driving Miss Daisy (1989), Gaslight (1944), Gosford Park (2001), Sexy Beast (2000), and Y Tu Mamá También (2001).", "Credits Ingrid Bergman as one of her favorite actresses, and the reason she became one.", "Was member of the dramatic jury at the Sundance Film Festival in 2000.", "In 2003 she was in two different independent films with prominent cast members from Dawson's Creek (1998). In The Station Agent (2003) Michelle Williams played an acquaintance from the same small town as Patricia's character and in Pieces of April (2003) Patricia played the mother of the title character portrayed by Katie Holmes.", "The youngest of five girls.", "Has four sisters.", "For a few years after Roger Dodger (2002) premiered at the 2002 Tribeca Film Festival, she was the girlfriend of Campbell Scott.", "Close friend of Amy Ryan.", "Nominated in the Outstanding Actress in Made for Television Movie FIVE, at The Women's Image Network (WIN) Awards 2012.", "After working with director Will Gluck she vowed to star in every movie he would make from then on and subsequently starred in his films Friends with Benefits (2011) and Annie (2014).", "Her maternal grandmother was the daughter of a Basque Spanish father and a Lithuanian Jewish mother. Patricia's other ancestry includes French/Cajun, German, English, Irish, Scottish, Scots-Irish/Northern Irish, and remote Dutch.", "Won the 2019 Golden Globe Award in the Best Performance by an Actress in a Supporting Role in a Series, Limited Series or Motion Picture Made for Television category for her role as Adora Crellin in Sharp Objects (2018).", "Has never married and has no children. Interviewed in 2016, she said, \"I've never wanted to marry, I've never wanted children - I was born without that gene.\".", "Her most memorable screen kiss was with British actor Darwin Shaw in season 6 of the series House of Cards (2013). Least memorable kiss was with Robert Downey Jr. in Good Night, and Good Luck. (2005)."], "filmography": ["Light on Broken Glass ()", "Monica ()", "State of the Union", "Almost Love", "House of Cards (2017-2018)", "Out of Blue", "Sharp Objects", "Delirium", "Jonathan", "Maze Runner: The Death Cure", "The Bookshop", "The Party", "American Dad!", "Maze Runner: The Scorch Trials", "Broad City", "Annie", "October Gale", "The Maze Runner", "Learning to Drive", "Last Weekend", "The East", "It's Getting Late", "The Flying House", "Five", "Parks and Recreation", "One Day", "Friends with Benefits", "Saturday Night Live (2009-2011)", "The Lonely Island Feat. Lady Gaga & Justin Timberlake: 3-Way", "Main Street", "Easy A", "Legendary", "Shutter Island", "Beyond All Boundaries", "Cairo Time", "2081", "The Lonely Island Feat. Justin Timberlake: Motherlover", "Whatever Works", "For the Love of Movies: The Story of American Film Criticism", "Vicky Cristina Barcelona", "Elegy", "Phoebe in Wonderland", "Blind Date", "Lars and the Real Girl", "Married Life", "No Reservations", "American Masters", "All the King's Men", "The Woods", "Good Night, and Good Luck.", "Six Feet Under (2002-2005)", "The Dying Gaul", "Miracle", "Dogville", "The Station Agent", "All the Real Girls", "Pieces of April", "Carrie", "The Baroness and the Pig", "Heartbreak Hospital", "Far from Heaven", "Welcome to Collinwood", "Frasier", "The Safety of Objects", "Falling Like This", "Wendigo", "The Pledge", "Wonderland", "Joe Gould's Secret", "The Green Mile", "Wayward Son", "Simply Irresistible", "Playing by Heart", "High Art", "London Suite", "Murder One (1995-1996)", "Jumanji", "Pharaoh's Army", "She Led Two Lives", "Caught in the Act", "Queen", "Four Eyes and Six-Guns", "An American Story", "Legacy of Lies", "Blind Man's Bluff", "Davis Rules", "Law & Order", "Tune in Tomorrow...", "Tales from the Crypt", "The Old Man and the Sea", "Everybody's All-American", "Rocket Gibraltar", "The Dead Pool", "Another World", "The Untouchables", "The Equalizer", "Spenser: For Hire"]}