{"name": "Nicole Barré", "current role": "Woman at Party", "birth name": " ", "birth date": " ", "birth place": " ", "height": "5' 8\" (1.73 m)", "biography": "Nicole was born and raised in New Orleans, LA. Nicole graduated from Destrehan High School and then attended the University of New Orleans as a Drama/Communications major. While studying at UNO, she began working behind the scenes in TV/movie production. Nicole has worked on countless movies, TV shows, commercials and music videos as a production assistant, director's assistant and personal assistant.During her time in production, Nicole had the opportunity to assist and work with some top names in the entertainment industry including Academy Award Winning cinematographer Robert Richardson, who shot films such as JFK, A Few Good Men, Casino, The Aviator and Kill Bill Volumes 1 & 2 and world-renowned, eccentric music personality and producer, Kim Fowley, who is best known for discovering Joan Jett and The Runaways and also for co-writing songs with rock legends KISS and many other artists.In 2000, Nicole moved to Los Angeles, CA where she was offered a prestigious job working as a personal assistant and nanny to Academy Award Winners Angelina Jolie-Pitt and Brad Pitt and their family. Her work with the Jolie-Pitts enabled her to travel around the world and offered many unforgettable and invaluable life experiences. The Jolie-Pitts were gracious and inspiring employers.During her down-time working for the Jolie-Pitts in Los Angeles, Nicole was also able to take acting classes in Los Angeles where she studied for several years with Steve Helgoth who was trained under the esteemed and legendary New York actress and teacher, Uta Hagen. Nicole credits Steve with molding her into the actress she is today.In 2007, Nicole decided to switch gears and focus entirely on her acting career back home in New Orleans, where her heart was.In addition to acting, Nicole has found a passion for teaching acting as well. She teaches at Launch Model and Talent Academy in Metairie, LA and is available for private coaching and audition coaching.::Nicole Barre'", "trade mark": " ", "trivia": " ", "filmography": ["Hot Date", "Noble Creatures", "The Walking Dead (2016-2018)", "Mr. Mercedes", "Vengeance: A Love Story", "Jack Reacher: Never Go Back", "The Whole Truth", "The Big Short", "Zoo", "The D Train", "NCIS: New Orleans", "99 Homes", "Le Pardon", "Treme (2011-2013)", "Thunderstruck", "The Paperboy", "Breakout Kings", "Hound Dogs", "Monsterwolf", "Grotesque", "Racing for Time", "Slumlord", "Murder at the Chat Noir", "Audi: The Art of the Heist", "Creating America's Next Hit Television Show", "When the Sky Cracks in Half", "T'choupi"]}