{"name": "Scott Caan", "current role": "Turk Malloy", "birth name": "Scott Andrew Caan", "birth date": "1976-08-23", "birth place": "Los Angeles, California, USA", "height": "5' 5\" (1.65 m)", "biography": "Scott Caan is the son of tough guy actor James Caan. While it is obvious that he admires tough method actors like Marlon Brando and Sean Penn, Scott also has a strong egalitarian streak, evidenced by his reasoning for baring his body in films. He is quoted as saying that originally only the women in the scene were to be nude, but that he felt it really sexist, so he stripped too.Scott was born on August 23, 1976 in Los Angeles, California. He spent his childhood being shuttled between his parents' homes. His mom is actress and model Sheila Ryan; the Caans divorced when Scott was a year old. He has an older half-sister, Tara, and three younger half-brothers: Alexander, Jacob, and James. His paternal grandparents were German Jewish immigrants.Self-described as a bad kid who was always getting into trouble, Scott initially steered clear of acting, opting to play sports instead. Scott benefited from his father's hands-on approach to child rearing; the elder Caan reportedly took a five-year hiatus to coach all of his son's little league teams. He also pursued his love of hip-hop by forming a group with his friend The Alchemist; as The Whooliganz, the duo made inroads on the music scene and signed an ll-fated contract with Tommy Boy Records.It did not take long for Scott to appear in front of the camera; in 1995, he took roles in a couple independent films, Star Struck (1996) and A Boy Called Hate (1995). Critical of his performances, Scott enrolled at Playhouse West in Los Angeles to study acting. Roles in more indies followed, including Bongwater (1998) and Gregg Araki's Nowhere (1997).His first major film was also a hit; he had a supporting role in Enemy of the State (1998) for director Tony Scott. He then appeared (in the buff) in Varsity Blues (1999) as a wisecracking receiver. By now, Scott had built a reliable reputation for playing strong-minded characters with a sense of humor, exemplified by his work in movies such a Boiler Room (2000), Ready to Rumble (2000), and his second hit picture, Gone in 60 Seconds (2000).Scott's star rose with a fun supporting turn in Steven Soderbergh's Ocean's Eleven (2001) remake. At this time he had more indie turns in the films American Outlaws (2001), Novocaine (2001), and Sonny (2002) - Nicolas Cage's directorial debut starring James Franco. Scott followed up with his own directorial outing, Dallas 362 (2003). Scott reprised his role as Turk Malloy in Ocean's Twelve (2004), then took a supporting roles in two very different pictures: the sexy, ocean-bound thriller Into the Blue (2005) and in Nicole Holofcener's indie comedy, Friends with Money (2006). 2006 marked Caan's return to the director¹s chair, with The Dog Problem (2006), and soon was back for Ocean's Thirteen (2007).Over the past few years, Scott made memorable appearances as a recurring character on Entourage (2004). He has a starring role in the remake of the TV series Hawaii Five-0 (2010).Scott has also established himself as a photographer, having been mentored in the medium by cinematographer Phil Parmet. In 2009, he published his book, Scott Caan Photographs, Vol. 1.::Kelley Ward kward@elpn.com", "trade mark": "Short stature", "trivia": ["His mother is Sheila Ryan.", "Son of actor James Caan.", "Stars in Nicolas Cage's directorial debut, Sonny (2002) - \"Sonny\" was the name of Scott\"s father's (James Caan) character in The Godfather (1972), which is incidentally directed by Nicolas Cage's uncle, Francis Ford Coppola.", "Nephew of producer Ronnie Caan.", "Formed a rap duo called \"The Whooliganz\" as a teenager. They had one single in 1993 called \"Put Your Handz Up\". His rap alias was \"Mad Skillz\". His rapping partner was The Alchemist, who is now a top hip-hop producer.", "Interviewed with his father, James Caan, on Playboy T.V. back in 1988.", "Attended Beverly Hills High School at the same time as Angelina Jolie, whom he later appeared alongside in Gone in 60 Seconds (2000).", "Was considered for the role of \"Derek\" in Hero Wanted (2008).", "Has an older half-sister named Tara Caan.", "Has 3 younger half-brothers named Alexander James Caan (b. 1991), Jacob Nicholas Caan (b. 1995) and James Arthur Caan (b. 1998).", "Studied acting in Playhouse West in Los Angeles.", "Him and The Alchemist, when performing as the rap duo \"The Whooliganz\" in the early '90s, actually landed a record deal with Tommy Boy records. They recorded the album \"Make Way for the W.\", but after their first single \"Put Your Handz Up\" turned out to be a failure, the album was shelved and the duo was dropped by Tommy Boy. In 1995, \"The Whooliganz\"'s song \"Whooliganz\" was released as a single in the UK, but Caan and The Alchemist had already parted ways.", "His paternal grandparents, Arthur Caan and Sophie (Falkenstein), were German Jewish immigrants.", "Is an avid photographer, ever since cinematographer Phil Parmet (with whom Caan worked on his directing debut Dallas 362 (2003)) introduced him to the techniques of the profession. Subsequently, Scott's father, James Caan, gave him a Nikon FE, which was given to James by Francis Ford Coppola, as a birthday gift. Scott has been taking pictures ever since.", "Scott is a black belt in Brazilian Jiu-Jitsu.", "First child, daughter Josie James Caan born on July 9, 2014. Scott's girlfriend Kacy Byxbee is the baby's mother.", "Is one day older than his Hawaii Five-0 co-star Alex O'Laughlin, who was born on August 24th 1976."], "filmography": ["Hawaii Five-0 (2010-2020)", "Untogether", "Vice Principals", "All At Once", "Rock the Kasbah", "3 Geezers!", "NCIS: Los Angeles", "Entourage (2009-2011)", "A Beginner's Guide to Endings", "Cop House", "Deep in the Valley", "Mercy", "Meet Dave", "Stories USA", "Ocean's Thirteen", "Brooklyn Rules", "The Dog Problem", "Jump", "The Danny Comden Project", "Lonely Hearts", "Friends with Money", "Into the Blue", "Ocean's Twelve", "In Enemy Hands", "Essentially Naked", "Dallas 362", "Life Makes Sense If You're Famous", "Sonny", "You Always Stalk the Ones You Love", "Ocean's Eleven", "Novocaine", "American Outlaws", "Gone in 60 Seconds", "Ready to Rumble", "Boiler Room", "Black & White", "Speed of Life", "Varsity Blues", "Wild Horses", "Enemy of the State", "Bongwater", "Nowhere to Go", "Nowhere", "Last Resort", "Star Struck", "A Boy Called Hate"]}