{"name": "Ben Kingsley", "current role": "Dr. Cawley", "birth name": "Krishna Bhanji", "birth date": "1943-12-31", "birth place": "Scarborough, Yorkshire, England, UK", "height": "5' 7¾\" (1.72 m)", "biography": "Ben Kingsley was born Krishna Bhanji on December 31, 1943 in Scarborough, Yorkshire, England. His father, Rahimtulla Harji Bhanji, was a Kenyan-born medical doctor, of Gujarati Indian descent, and his mother, Anna Lyna Mary (Goodman), was an English actress. Ben began to act in stage plays during the 1960s. He soon became a successful stage actor, and also began to have roles in films and television. His birth name was Krishna Bhanji, but he changed his name to \"Ben Kingsley\" soon after gaining fame as a stage actor, fearing that a foreign name could hamper his acting career.Kingsley first earned international fame for his performance in the drama movie Gandhi (1982). His performance as Mohandas K. Gandhi earned him international fame. He won many awards - including an Academy Award for Best Actor. He also won Golden Globe, BAFTA and London Film Critics' Circle Awards. After acting in Gandhi (1982), Ben was recognized as one of the finest British actors.After his international fame for appearing in Gandhi (1982), Kingsley appeared in many other famous movies. His success as an actor continued. His performance as Itzhak Stern in the drama movie Schindler's List (1993) earned him a BAFTA nomination for best supporting actor. Schindler's List (1993) won seven Academy Awards, including Best Picture. During the late 1990s, Kingsley acted in many successful movies. He played Sweeney Todd in the television movie The Tale of Sweeney Todd (1997), for which he was nominated for the Screen Actors' Guild Award. His other notable role was as Otto Frank in the television movie Anne Frank: The Whole Story (2001), for which he won the Screen Actors' Guild Award.In 2002, Kingsley was appointed Knight Bachelor of the Order of the British Empire in the Queen's New Years Honours for his services to drama. In 2013, he received the BAFTA Los Angeles Britannia Award for Worldwide Contribution to Filmed Entertainment. That same year, he also received the Fellowship Award at the Asian Awards in London, England.::Pedro Borges", "trade mark": "Shaved head", "trivia": ["Attended and graduated from Manchester Grammar School in Manchester, England.", "He was awarded Knight Bachelor of the Order of the British Empire in the 2002 Queen's New Year's Honours List for his services to drama.", "Derived his stage name from his grandfather's nickname \"Clove King\". His grandfather was a spice trader in Zanzibar.", "Kingsley's father, Rahimtulla Harji Bhanji, was a Kenyan-born physician of Gujrati Indian descent. Kingsley's mother, Anna Lyna Mary (Goodman) Bhanji, was an English fashion model and actress; she appeared in films in the 1920s and 1930s. Kingsley's maternal grandfather was believed by the family to have been of Russian Jewish or German Jewish descent, while Kingsley's maternal grandmother was of English background, and worked in the garment district of East London. His mother was born outside of marriage, and was raised by her own mother.", "His paternal family was from the Indian state of Gujarat, the same state Mohandas K. Gandhi was from.", "Has four children: Jasmin Bhanji and Thomas Alexis Bhanji, with Angela Morant; and Edmund Kingsley and Ferdinand Kingsley, with Alison Sutcliffe.", "Made his London stage debut in 1966 as the narrator of \"A Smashing Day\" produced by The Beatles manager, Brian Epstein. He wrote the music for the production as well as sang and played guitar for same. After one performance, John Lennon and Ringo Starr came backstage and told him that he should go into music and that if he didn't, \"he would regret it for the rest of his life.\" He was subsequently offered a deal by the same publishers who handled The Beatles, but he chose to remain an actor. The next year, he was invited to join the Royal Shakespeare Company and his choice was made.", "Was listed as a potential nominee on both the 2005 and 2006 Razzie Award nominating ballots. He was suggested in the Worst Supporting Actor category on the 2005 ballot for his role in the film Thunderbirds (2004). And he was suggested again the next year in the Worst Supporting Actor category of the 2006 Razzie nominating ballot for his performance in the film A Sound of Thunder (2005). He failed to receive either nomination. The very next year (2007) though, he got a Worst Supporting Actor Razzie Nomination for his performance in the film BloodRayne (2005).", "Head of the 'Official Competition' jury at the 48th Berlin International Film Festival in 1998.", "Was originally cast as Ephraim in Munich (2005), but later had to withdraw from the project due to scheduling conflicts. The role went to Geoffrey Rush.", "His performance as Don Logan in Sexy Beast (2000) is ranked #97 on Premiere magazine's 100 Greatest Performances of All Time (2006).", "Has three films on the American Film Institute's 100 Most Inspiring Movies of All Time: Searching for Bobby Fischer (1993) at #96, Gandhi (1982) at #29, and Schindler's List (1993) at #3.", "At the age of ten, he went busking outside a cinema with his friend Shirley Edwards in Llanelli, South Wales.", "On September 3, 2007, he married his fourth wife Daniela Lavender at Eynsham Hall in North Leigh, Oxfordshire.", "Is one of eight actors of Asian descent nominated for an Academy Award in an acting category. The others are Miyoshi Umeki, Sessue Hayakawa, Mako, Haing S. Ngor, Pat Morita, Ken Watanabe and Rinko Kikuchi.", "The initials of his professional name are a reversal of the initials of his birth name.", "He was awarded a Star on the Hollywood Walk of Fame at 6931 Hollywood Boulevard in Hollywood, California on May 27, 2010. Offering their support at the event were his son Edmund Kingsley, wife Daniela Lavender, friends Bruce Willis and Jerry Bruckheimer.", "Was awarded the Grammy Award for \"Best Spoken Word or Non-Musical Recording\" for \"The Words of Gandhi\" (1984).", "Received an honorary degree (Doctor of Letters) from the University of Hull, Scarborough Campus, degree ceremony on July 18, 2008.", "As of 2014, has appeared in four films that were nominated for the Best Picture Oscar: Gandhi (1982), Bugsy (1991), Schindler's List (1993) and Hugo (2011). Of those, Gandhi (1982) and Schindler's List (1993) won in the category.", "Kingsley joined the Royal Shakespeare Company in 1967.", "Kingsley considers this an extraordinary coincidence that five days before Sir Richard Attenborough called him for the lead role in Gandhi (1982), he was given a library book on Gandhi.", "According to Kingsley, one of his fondest movie memories is watching his father go hysterical while viewing Danny Kaye as a car salesman in Knock on Wood (1954). After that his father often jokingly referred to him as the \"Danny Kaye of the Family\".", "Is shown being eaten by a \"Grasshopper-raptor\" in an episode of The Simpsons (1989).", "Was approached for the Bollywood movie Shikhar (2005) but declined the role as he was not comfortable speaking Hindi. The role eventually went to Javed Shaikh.", "Has appeared in three productions depicting the Exodus: Moses (1995), The Ten Commandments (2007) and Exodus: Gods and Kings (2014).", "He played Mohandas K. Gandhi between the ages of 23 (in 1893) and 78 (in 1948) in the drama movie Gandhi (1982).", "Has worked with eight directors who have won a Best Director Oscar: Sir Richard Attenborough, Barry Levinson, Steven Spielberg, Roman Polanski, William Friedkin, Mike Nichols, Martin Scorsese and Robert Zemeckis.", "Nominated for Best Comedy Performance in the 1980 Laurence Olivier Awards for his performance in ''The Merry Wives of Windsor' but lost out to Beryl Reid.", "The actor playing raving psychopath \"Don\" has an OBE.", "In both House of Sand and Fog (2003) and Lucky Number Slevin (2006), he plays a character who dies from having a translucent plastic bag taped over their head.", "Born on exactly the same date as John Denver."], "filmography": ["Wake ()", "A Doll's House ()", "Dali Land ()", "Long Gone Heroes ()", "The Way of the Wind", "Cousin Bazilio ()", "Locked Down", "Ich bin dann mal Charlie", "Spider in the Web", "Perpetual Grace, LTD", "The Red Sea Diving Resort", "Watership Down", "Intrigo: Death of an Author", "Night Hunter", "Operation Finale", "Backstabbing for Beginners", "War Machine", "An Ordinary Man", "The Ottoman Lieutenant", "Security", "Of Dogs and Men", "Collide", "The Jungle Book", "The Walk", "Tut", "Self/less", "Dragonheart 3: The Sorcerer's Curse", "Life", "Knight of Cups", "Night at the Museum: Secret of the Tomb", "Exodus: Gods and Kings", "Robot Overlords", "Learning to Drive", "The Boxtrolls", "Stonehearst Asylum", "Marvel One-Shot: All Hail the King", "Jaguar: Rendezvous", "War Story", "The Physician", "Ender's Game", "Walking with the Enemy", "A Common Man", "A Birder's Guide to Everything", "Iron Man 3", "A Therapy", "The Dictator", "Noah", "Hugo", "Fable III", "The Late Late Show with Craig Ferguson", "Prince of Persia: The Sands of Time", "Three Cards", "Shutter Island", "Journey to Mecca", "Fifty Dead Men Walking", "The Love Guru", "War, Inc.", "Elegy", "The Wackness", "Transsiberian", "The Ten Commandments", "You Kill Me", "The Last Legion", "Jackanory", "The Sopranos", "Lucky Number Slevin", "Behind the magic of Knights of Impossingworth Park", "BloodRayne", "Mrs. Harris", "Oliver Twist", "A Sound of Thunder", "Suspect Zero", "Thunderbirds", "House of Sand and Fog", "Tuck Everlasting", "Spooky House", "The Triumph of Love", "A.I. Artificial Intelligence", "Anne Frank: The Whole Story", "Sexy Beast", "Rules of Engagement", "What Planet Are You From?", "Alice in Wonderland", "The Confession", "Parting Shots", "Crime and Punishment", "Ceremony of Innocence", "The Tale of Sweeney Todd", "Photographing Fairies", "The Assignment", "Weapons of Mass Distraction", "Twelfth Night", "Moses", "Species", "Joseph", "Death and the Maiden", "Schindler's List", "Searching for Bobby Fischer", "Dave", "Sneakers", "Freddie as F.R.O.7.", "Bugsy", "L'amour nécessaire", "The War That Never Ends", "The Children", "O Quinto Macaco", "Romeo.Juliet", "Cellini, l'or et le sang", "Murderers Among Us: The Simon Wiesenthal Story", "Slipstream", "Un train pour Petrograd", "Without a Clue", "Pascali's Island", "Secret of the Sahara", "Testimony", "Maurice", "Silas Marner", "Harem", "Turtle Diary", "Camille", "Oxbridge Blues", "Kean", "Betrayal", "The Merry Wives of Windsor", "Gandhi", "Vikings!", "BBC2 Playhouse", "Crown Court (1976-1979)", "Thank You, Comrades", "The Velvet Glove", "Dickens of London", "The Love School", "Omnibus", "2nd House", "Antony and Cleopatra", "Wessex Tales", "The Adventurer", "Play for Today", "A Misfortune", "Full House", "Fear Is the Key", "Coronation Street (1966-1967)", "Orlando", "Pardon the Expression"]}