{"name": "Ryan Gosling", "current role": "Driver", "birth name": "Ryan Thomas Gosling", "birth date": "1980-11-12", "birth place": "London, Ontario, Canada", "height": "6' 0½\" (1.84 m)", "biography": "Canadian actor Ryan Gosling is the first person born in the 1980s to have been nominated for the Best Actor Oscar (for Half Nelson (2006)).He was born Ryan Thomas Gosling on November 12, 1980, in London, Ontario, Canada. He is the son of Donna (Wilson), a secretary, and Thomas Ray Gosling, a traveling salesman. Ryan was the second of their two children, with an older sister, Mandi. His ancestry is French-Canadian, as well as English, Scottish, and Irish. The Gosling family moved to Cornwall, Ontario, where Ryan grew up and was home-schooled by his mother and also attended Gladstone Public School. Ryan attended Cornwall Collegiate and Vocational High School in Cornwall, where he excelled in Drama and Fine Arts. The family then relocated to Burlington, Ontario, where Ryan attended Lester B. Pearson High School.Ryan first performed as a singer at talent contests with Mandi. He attended an open audition in Montreal for the TV series \"The Mickey Mouse Club\" (The All New Mickey Mouse Club (1989)) in January 1993 and beat out 17,000 other aspiring actors for a a spot on the show. While appearing on \"MMC\" for two years, he lived with co-star Justin Timberlake's family.Though he received no formal acting training, after \"MMC,\" Gosling segued into an acting career, appearing on the TV series Young Hercules (1998) and Breaker High (1997), as well as the films The Slaughter Rule (2002), Murder by Numbers (2002), and Remember the Titans (2000). He first attracted serious critical attention with his performance as the Jewish neo-Nazi in the controversial film The Believer (2001), which won the Grand Jury Prize at the 2001 Sundance Film Festival. He was cast in the part by writer-director Henry Bean, who believed that Gosling's strict upbringing gave him the insight to understand the character Danny, whose obsessiveness with the Judaism he was born into turns to hatred. He was nominated for an Independent Spirit Award as Best Male Lead in 2002 for the role and won the Golden Aries award from the Russian Guild of Film Critics.After appearing in the sleeper The Notebook (2004) in 2004, Gosling won the dubious honor of being named one of the 50 Hottest Bachelors by People Magazine. More significantly, he was named the Male Star of Tomorrow at the 2004 Show West convention of movie exhibitors.Gosling reached a summit of his profession with his performance in Half Nelson (2006), which garnered him an Academy Award nomination as Best Actor. In a short time, he has established himself as one of the finest actors of his generation. Throughout the subsequent decade, he has become all three of an internet fixation, a box office star, and a critical darling, having headlined Blue Valentine (2010), Crazy, Stupid, Love. (2011), Drive (2011), The Ides of March (2011), The Place Beyond the Pines (2012), The Nice Guys (2016), and La La Land (2016). In 2017, he starred in the long-awaited science fiction sequel Blade Runner 2049 (2017), with Harrison Ford.Ryan has two children with his partner, actress Eva Mendes.::Jon C. Hopwood", "trade mark": "Often plays quiet, emotionally distant characters", "trivia": ["Is an accomplished jazz guitarist and a fan of Chet Baker; started a band with his friend Zach Shields called Dead Man's Bones.", "Has an older sister named Mandi Gosling.", "Was taken out of elementary school as a child and taught at home by his mother because of constant abuse from other students.", "Had a dog named George.", "Was in a relationship with Sandra Bullock, having met on the set of Murder by Numbers (2002) (May 2002-July 2003).", "Built the kitchen table featured in The Notebook (2004) in preparation for his role as Noah.", "Purchased the Jeep Cherokee driven by Ben Chaplin in Murder by Numbers (2002) from the set of the movie.", "Favorite movie is East of Eden (1955)", "Keeps in touch with his Breaker High (1997) co-star Scott Vickaryous.", "Beat out 17,000 people for a place in The All New Mickey Mouse Club (1989) in January 1993.", "Born in the same hospital as his The Notebook (2004) co-star Rachel McAdams -- St. Joseph's Hospital in London, Ontario -- though he's younger.", "Has released a song titled \"Put Me in the Car\", which can be found on his website.", "With two of his friends, he has opened a Moroccan restaurant called Tagine in Beverly Hills, California.", "Was in a relationship with Rachel McAdams twice, having met on the set of The Notebook (2004). They were originally together from June 2005 to July 2007 before reconciling in August 2008, only to separate a second time in November 2008.", "In school, his nickname was Trouble.", "He moved to Los Angeles, California when he was 16.", "Took his mother and his sister to the Oscars in 2007.", "Traveled to Chad in 2005 to make a documentary on the Darfur refugees living there.", "One of 115 people invited to join AMPAS in 2007.", "Lives in the popular Los Angeles neighborhood of Silver Lake. Other Silver Lake locals include Beck, Bo Barrett, Christina Ricci, Rachel McAdams, and Jason Lee.", "Was the first Canadian-born performer in over 60 years to be nominated for the best actor Oscar in Half Nelson (2006). The last was Walter Pidgeon for Madame Curie (1943).", "Was originally cast as Jack Salmon in The Lovely Bones (2009), but after dropping out of the project a day before shooting began, Mark Wahlberg was cast instead.", "Was ranked #23 on Entertainment Weekly's '30 Under 30' the actors list. (2008).", "Member of the same Los Angeles gym as Jason Sarayba, Bradley Cooper, Jodie Foster, Michelle Monaghan, Christopher Mintz-Plasse and Ashley Tisdale.", "According to an interview in GQ, he was the only Mickey Mouse Club cast member that didn't live in the same complex as all the other cast members and their families. He and his family lived in a nearby trailer park and he was the family's only source of income.", "Ryan drives the same color and year model 2011 Chevy Impala in both Drive and Ides of March.", "Unlike many successful actors near his age, he has no entourage and few close friends. He admits to often preferring solitude while not working, attributing it to his autonomous latter childhood.", "He first saw Blue Velvet (1986) when he was 14 years old. This movie left a strong impression on him.", "Born at 2:34 PM.", "He is of roughly half French-Canadian ancestry (from both of his parents combined), along with English, Scottish, Irish, and about 1/32 German. The \"Gosling\" surname originates in England, where Ryan's great-great-grandfather, George Edward Gosling, was born (in Paddington).", "Was considered to play Batman in Batman v Superman: Dawn of Justice (2016) before Ben Affleck was cast.", "Auditioned for the role of Frankie Ballenbacher in Alpha Dog (2006) but lost to Justin Timberlake.", "Auditioned for the role of Sam Flynn in TRON: Legacy (2010), but lost to Garrett Hedlund.", "Touring the U.S. and Canada with his band, Dead Man's Bones, in support of their debut album. [October 2009]", "He and Benicio Del Toro are making tentative plans to visit the jungle in Bolivia, to learn a few survival skills first-hand for Che: Part Two (2008) (aka \"Che\"). [August 2004]", "New York City: Announces that he plans to take an unspecified \"break\" from acting because he feels as if he has \"lost perspective on what I'm doing.\" [March 2013]", "Dating Eva Mendes since September 2011.", "Was mentioned in two movies in 2014: Maps to the Stars (2014) and Birdman or (The Unexpected Virtue of Ignorance) (2014).", "A series of videos, entitled \"Ryan Gosling Won't Eat His Cereal\", which feature clips from various Gosling films with a spoonful of cereal superimposed over the footage, went viral in 2013, receiving millions of views on Vine and YouTube. When the creator of the videos, Ryan McHenry, passed away from osteosarcoma in May 2015, Gosling posted his own video on Vine, in which he can be seen eating a bowl of cereal in tribute to McHenry. He also offered his public condolences to McHenry's family.", "Appeared in two films with Michelle Williams: The United States of Leland (2003) and Blue Valentine (2010). They lived together for four weeks, while filming \"Blue Valentine\", in a house in Carbondale, Pennsylvania.", "Has 2 daughters: Esmeralda Amada Gosling (b. September 12, 2014) & Amada Lee Gosling (b. April 29, 2016) with girlfriend, Eva Mendes.", "Has starred in four films specifically set in Los Angeles (Drive, Gangster Squad, The Nice Guys, and La La Land). Additionally, he has starred in seven films set in New York (The Believer, Stay, Half Nelson, Blue Valentine, All Good Things, Place Beyond the Pines, and The Big Short).", "By fans in public, he often gets confused for fellow Canadian actor named Ryan, Ryan Reynolds.", "He is the third male born in 1980 or after to have received more than one Academy Award nomination for acting (for Half Nelson (2006) and La La Land (2016)). The first two are Jonah Hill (for Moneyball (2011) and The Wolf of Wall Street (2013)) and Eddie Redmayne (for The Theory of Everything (2014), which he won, and The Danish Girl (2015)).", "He is the first person born in the 1980s (and thus could be considered the first millennial) to have been nominated for the Academy Award for Best Actor, for Half Nelson (2006); Keisha Castle-Hughes is the first millennial nominated for the Best Actress Oscar (for Whale Rider (2002), in the ceremony for 2003). Eddie Redmayne and Natalie Portman are the first persons born in the 1980s to have won in those two respective categories.", "He played all his filmed piano-playing scenes in La La Land, learning to play the instrument in the months before shooting.", "Is the first person born in the 1980s to have been nominated for the Academy Award for Best Actor (he has been nominated in the category twice). The next four were Jesse Eisenberg (born in 1983), Eddie Redmayne (one win, one nomination) (born in 1982), Andrew Garfield (born in 1983), and Daniel Kaluuya (born in 1989).", "Can speak some basic, conversational Spanish. He began learning in 2011 after starting to date longtime friend and costar Eva Mendes. He said in 2012 he was attempting to read Zoe Valdes' Café Nostalgia in Spanish, and his two daughters with Mendes are being raised bilingual.", "In 1992 he was the only boy with a group of girl dancers in a tv talent show.", "Gained 60 lbs to play Jack Salmon in The Lovely Bones (2009) by eating melted ice cream. Ultimately he was fired due to creative differences which left him, in his words, \"fat and unemployed\".", "Born on the same date as Gustaf Skarsgård.", "His characters often suffer a broken nose, as seen in Blue Valentine (2010), Only God Forgives (2013), and Blade Runner 2049 (2017).", "Has a doberman named Lucho."], "filmography": ["Project Hail Mary ()", "The Gray Man ()", "Wolfman ()", "My Favorite Shapes by Julio Torres", "First Man", "Blade Runner 2049", "The Nice Guys: Word of the Day", "Song to Song", "La La Land", "The Nice Guys", "The Big Short", "Only God Forgives", "Gangster Squad", "The Place Beyond the Pines", "Drunk History Christmas", "Drunk History", "Touch of Evil", "The Ides of March", "Crazy, Stupid, Love.", "Drive", "All Good Things", "Blue Valentine", "Lars and the Real Girl", "Fracture", "Half Nelson", "Stay", "I'm Still Here: Real Diaries of Young People Who Lived During the Holocaust", "The Notebook", "The United States of Leland", "Murder by Numbers", "The Slaughter Rule", "The Believer", "Remember the Titans", "The Unbelievables", "Young Hercules (1998-1999)", "Hercules: The Legendary Journeys", "Breaker High (1997-1998)", "Nothing Too Good for a Cowboy", "The Adventures of Shirley Holmes", "Flash Forward", "Psi Factor, chroniques du paranormal", "Frankenstein and Me", "Ready or Not", "Kung Fu: The Legend Continues", "Avonlea", "Goosebumps", "Are You Afraid of the Dark?"]}