{"name": "Selena Gomez", "current role": "Selena Gomez", "birth name": "Selena Marie Gomez", "birth date": "1992-07-22", "birth place": "Grand Prairie, Texas, USA", "height": "5' 5\" (1.65 m)", "biography": "Actress and singer Selena Gomez was born on July 22, 1992 in Grand Prairie, Texas. She is the daughter of Mandy Teefey and Ricardo Gomez. Her mother is of part Italian ancestry, and her father is of Mexican descent. She was named after Tejano singer Selena, who died in 1995.Her first acting role was as \"Gianna\" in the popular '90s children's television show Barney & Friends (1992), alongside Demi Lovato from 2002-2004. Gomez also had roles in Spy Kids 3-D: Game Over (2003), Walker, Texas Ranger: Trial by Fire (2005), and House Broken (2006).Gomez moved to Los Angeles, California when she booked the lead role of \"Alex Russo\" and rose to fame in the Disney Channel series Wizards of Waverly Place (2007). She then starred in Another Cinderella Story (2008) on ABC Family, had her first voice-role in the animated film Horton Hears a Who! (2008), and co-starred with childhood friend, Demi Lovato, in Princess Protection Program (2009).In 2009, Gomez released her first album with her band called \"Selena Gomez & the Scene,\" which ranked #9 on the Billboard 200 album charts. Gomez later released two other albums with her band and starred in Monte Carlo (2011), Spring Breakers (2012), and Hotel Transylvania (2012).In 2013, she released her first solo album \"Stars Dance\" and the lead single \"Come & Get It\" from the album, became Gomez's first top ten entry on the Billboard Hot 100 list. She starred in Getaway (2013), Rudderless (2014), and Behaving Badly (2014).In 2015, she released her second solo album \"Revival,\" which debuted #1 on the Billboard 200 list, and starred in Hotel Transylvania 2 (2015), The Fundamentals of Caring (2016), In Dubious Battle (2016), and Neighbors 2: Sorority Rising (2016).::Anonymous", "trade mark": " ", "trivia": ["She wasn't a fan of magic or the \"Harry Potter\" franchise, but ironically landed the lead role of magic kid Alex Russo in Wizards of Waverly Place (2007).", "Her role model and favorite actress is Rachel McAdams.", "While filming the animated movie Horton Hears a Who! (2008), she played Steve Carell's daughter but never got to meet him.", "She became interested in acting after watching her mom, Mandy Teefey.", "She adopted her dog named Chip from an animal shelter.", "Discovered by Disney in a nationwide casting call.", "She sings the theme song in Wizards of Waverly Place (2007).", "Has six dogs: Chip, Willy, Fina, Wallace, Chaz and Baylor.", "Her mom, Mandy Teefey, remarried, in 2006, to Brian Teefey.", "She wore a purity ring from 2005-2010 that said: \"True Love Waits.\".", "Her father is of Mexican descent. Her mother, who was adopted, is of part Italian ancestry.", "Her mom gave birth to her at the age of 16.", "Her parents divorced when she was five years old.", "She was named after Tejano singer Selena Quintanilla-Pérez, who died almost three years after Gomez was born.", "She went to Danny Jones Middle School located in Texas.", "Her first name means \"moon\" in Greek. In classical myth, Selene was the goddess of the moon (though some later classical poetry gives that role to Artemis, the goddess of hunting and animals).", "She is a huge fan of Johnny Depp and Lady Sovereign.", "Both her family and Fernanda Romero are from the same town in Mexico.", "Used to do a YouTube show with best friend Demi Lovato called \"The Demi and Selena Show\".", "Has a song about her on YouTube called \"Selena Gomez\" by Greg Kurka.", "Involved with the charity Raise Hope for Congo which helps raise awareness about the violence against Congolese women.", "Participated in the \"Runway for Life\" benefit for St. Jude's Children Research Hospial. [2008]", "She was named the youngest UNICEF ambassador at age 17. [August 2009]", "Lead singer of the band Selena Gomez & The Scene.", "She and her mom, Mandy Teefey said good-bye to friends and family in Grand Prairie, TX, to start a new Life in Los Angeles, after hearing the life-changing news of Selena's new role on Wizards of Waverly Place (2007).", "Is a huge fan of Britney Spears.", "Huge fan of Fefe Dobson, she covered one of Dobson's tracks \"As a Blonde\" on her album \"Kiss and tell\" and Fefe also co-wrote Selena's hit single \"Round and Round\".", "For her 2011 music video \"Love You Like A Love Song\", Gomez had horses spray-painted pink. This led to accusations from PETA and singer Pink about the treatment of the animals.", "(June 13, 2011) She was hospitalized with nausea and headaches after appearing on The Tonight Show with Jay Leno (1992). She was later diagnosed with physical exhaustion and food poisoning.", "Met Demi Lovato at an audition for Barney & Friends (1992); they were both on the show from 2002-2004. Later, they worked together on Princess Protection Program (2009) and Sonny with a Chance (2009). Also directed, together, The Demi and Selena Show (2008).", "She was in on-off relationship with Justin Bieber from December 2010 to January 2013.", "(December 16, 2011) Her mother Mandy Teefey miscarried a baby girl to be named Scarlett J. Teefey at 16 weeks pregnant.", "Has two younger half-sisters,Gracie Elliot Teefey (b. June 12, 2013) through her mother, Mandy Teefey and step-father Brian Teefey and Victoria Gomez (b. June 25, 2014) through her father Ricardo Gomez and step-mother Sara Gomez.", "Appeared in a commercial for Borden milk. [2009]", "Ranked #19 on Maxim's \"Hot 100\" of 2014 list.", "(December 27, 2013) It was reported that she was suffering from lupus.", "(October 9, 2015) She confirmed that she was battling lupus for several years and underwent course of chemotherapy.", "Took a career break after suffering from \"anxiety, panic attacks, and depression\" and spent 90 days in rehab. [August 2016]", "The first to reach 100 Million Instagram Followers.", "She likes putting pickle juice on her popcorn.", "Is good friends with Taylor Swift.", "Was in a relationship with Canadian singer The Weeknd for 10 months.", "(July 13, 2013) Her album \"Stars Dance\" was released by Hollywood Records.", "(October 9, 2015) Her second album \"Revival\" was released by Interscope and Polydor Records.", "From 2010-2014, she released her own fashion clothing line called 'Dream Out Loud\" through retailer K-Mart. Her collection consisted of, bohemian dresses, floral tops, jeans, skirts, jackets, scarves and hats, all of which were made from recycled or eco-friendly materials.", "In May 2012, she launched her self-titled fragrance \"Selena Gomez by Selena Gomez\".", "In 2013, she launched her second perfume \"Vivamore by Selena Gomez\".", "Her favorite Disney movie is Alice in Wonderland (1951).", "In 2017, she had a kidney transplant due to her lupus after Francia Raisa donated a kidney to her. During the transplant, Gomez broke an artery. An emergency surgery was conducted to build a new artery using a vein from her leg.", "She has a limited-edition collection of handbags called the \"Selena Grace\" that she designed in collaboration with luxury brand Coach."], "filmography": ["Hotel Transylvania 4", "In the Shadow of the Mountain", "Only Murders in the Building", "Selena Gomez & Rauw Alejandro: Baila Conmigo", "Selena Gomez: De Una Vez", "Blackpink & Selena Gomez: Ice Cream", "Blackpink & Selena Gomez: Ice Cream", "Ice Cream", "Trevor Daniel, Selena Gomez: Past Life", "Selena Gomez feat. Trevor Daniel: Past Life [Lyrics]", "Selena Gomez: Boyfriend", "Selena Gomez: Dance Again", "Selena Gomez: Look at Her Now", "Selena Gomez: Lose You to Love Me", "Selena Gomez: Rare", "Dolittle", "Selena Gomez: Look at Her Now", "Selena Gomez: Lose You to Love Me", "A Rainy Day in New York", "The Dead Don't Die", "Benny Blanco & Tainy & Selena Gomez and J Balvin: I Can't Get Enough", "Pantene: Selena Gomez", "DJ Snake Feat. Ozuna, Cardi B, & Selena Gomez: Taki Taki", "A Love Story", "Hotel Transylvania 3: Summer Vacation", "Selena Gomez: Back to You", "Selena Gomez & Marshmello: Wolves", "Selena Gomez, Marshmello: Wolves, Vertical Video", "Selena Gomez & Marshmello: Wolves - Visualizer", "Selena Gomez Feat. Gucci Mane: Fetish", "Puppy!: A Hotel Transylvania Short", "Selena Gomez: Bad Liar", "Kygo Feat. Selena Gomez: It Ain't Me", "Selena Gomez: Only You", "Pantene: Love Your Hair Longer", "Cashmere Cat Feat. Selena Gomez & Tory Lanez: Trust Nobody", "In Dubious Battle", "Charlie Puth Feat. Selena Gomez: We Don't Talk Anymore", "Charlie Puth Feat. Selena Gomez: We Don't Talk Anymore", "Selena Gomez: Kill Em with Kindness", "Inside Amy Schumer", "Neighbors 2: Sorority Rising", "The Fundamentals of Caring", "Selena Gomez: Hands to Myself", "The Big Short", "Selena Gomez: Same Old Love", "Hotel Transylvania 2", "Selena Gomez Feat. A$AP Rocky: Good for You", "Selena Gomez: Good for You", "Taylor Swift: Bad Blood", "Zedd Feat. Selena Gomez: I Want You to Know", "Selena Gomez: The Heart Wants What It Wants", "Ben Kweller & Selena Gomez: Hold On", "Behaving Badly", "Rudderless", "Selena Gomez: Forever", "Searching", "Selena Gomez: Slow Down - Lyric Video", "Selena Gomez: Reinvention", "Getaway", "Selena Gomez: Birthday", "Selena Gomez: Slow Down", "Selena Gomez: Come & Get It", "The Wizards Return: Alex vs. Alex", "Aftershock", "Hotel Transylvania", "Spring Breakers", "Fifty Shades of Blue", "Wizards of Waverly Place (2007-2012)", "Selena Gomez & the Scene: Hit the Lights", "The Muppets", "Selena Gomez & the Scene: Love You Like a Love Song", "Monte Carlo", "Selena Gomez & the Scene: Who Says", "MTV HD Celebrity Charts", "Selena Gomez: Un Año Sin Lluvia", "Selena Gomez & the Scene: A Year Without Rain", "Arthur 3 : La Guerre des deux mondes", "Ramona and Beezus", "Selena Gomez & the Scene: Round & Round", "Selena Gomez & the Scene: Naturally", "Arthur et la vengeance de Maltazard", "Wizards on Deck with Hannah Montana", "Selena Gomez & the Scene: Falling Down", "Wizards of Waverly Place: The Movie", "Disney's Friends for Change: Send It On", "Selena Gomez: Magic", "The Suite Life on Deck", "Selena Gomez & Demi Lovato: One and the Same", "Princess Protection Program", "Drew Seeley Feat. Selena Gomez: New Classic", "Selena Gomez: Tell Me Something I Don't Know", "Selena Gomez: Fly to Your Heart", "Jonas Brothers: Burnin' Up", "Hannah Montana (2007-2008)", "Horton Hears a Who!", "Another Cinderella Story", "Selena Gomez: Cruella De Vil", "What's Stevie Thinking?", "Arwin!", "House Broken", "The Suite Life of Zack & Cody", "Brain Zapped", "Walker, Texas Ranger: Trial by Fire", "Barney & Friends (2002-2004)", "Barney: Best Manners - Invitation to Fun", "Spy Kids 3-D: Game Over", "Barney: Read with Me, Dance with Me"]}