{"name": "Carey Mulligan", "current role": "Irene", "birth name": "Carey Hannah Mulligan", "birth date": "1985-05-28", "birth place": "Westminster, London, England, UK", "height": "5' 7\" (1.7 m)", "biography": "Carey Hannah Mulligan is a British actress. She was born May 28, 1985, in Westminster, London, England, to Nano (Booth), a university lecturer, and Stephen Mulligan, a hotel manager. Her mother is from Llandeilo, Wales, and Carey also has Irish and English ancestry.Her first major appearance was playing Kitty Bennet in Pride & Prejudice (2005) alongside Keira Knightley, Judi Dench and Donald Sutherland. Carey also played orphan \"Ada Clare\" in the B.B.C. television series, Bleak House (2005).Carey has said that her passion and love for acting was first kindled at her old school Woldingham School, where she took part in a school production of \"Sweet Charity\" in her final year, and where she was also a student head of drama.Carey is married to musician Marcus Mumford, of Mumford & Sons.::anonymous", "trade mark": " ", "trivia": ["Received a nomination for \"Best Supporting Actress in a motion picture or miniseries\" at the OFTA (Online Film & Television Association) Televion awards in 2006 for her role in Bleak House (2005).", "Voted Best Guest Actress by Doctor Who Magazine readers for Doctor Who: Blink (2007).", "Received a 2009 Drama Desk Award nomination for \"Outstanding Featured Actress in a Play\" for her role in Christopher Hampton's re-imagining of Anton Chekhov's \"The Seagull\" on Broadway.", "Was the UK recipient of the Shooting Star award from the European Film Promotion in 2009.", "Won \"Best Female Performance in a 2007 Science Fiction Television Episode\" for the Doctor Who (2005) episode Doctor Who: Blink (2007), at The Constellation Awards (2008).", "Mentioned in an interview at the Sundance Film Festival that the first actor she met was Julian Fellowes, who came to talk at her school. She approached him, and he introduced her to casting director Jina Jay's assistant; at the time, they were looking for young unknown actresses to play the younger sisters in Pride & Prejudice (2005). It ended up being her first job.", "Has mentioned that she'd like to do a play every year.", "Lived in London from birth until the age of three before moving with her family to Germany, where she attended the International School of Dusseldorf.", "(August 2009-October 2010) Was in a relationship with Shia LaBeouf, having met on the set of Wall Street: Money Never Sleeps (2010).", "Replaced Keira Knightley in the role of Eliza Doolittle in My Fair Lady after she dropped out of the project.", "Sang the lead female vocal on the title track of Belle & Sebastian's \"Write About Love\" album, released in October 2010.", "Was originally cast as Violet in Violet & Daisy (2011) but was replaced by Alexis Bledel after she dropped out in order to pursue Drive (2011) instead.", "Is close friends with Keira Knightley, having met on the set of Pride & Prejudice (2005).", "Announced her engagement to Marcus Mumford, having been in a relationship with him since February 2011. [July 2011]", "Daughter of Stephen (b. 1951) and Nano (née Booth) Mulligan (b. 1954).", "Maternal granddaughter of Samuel (1924-1991) and Margaret (née James) Booth (1926-2017).", "Paternal granddaughter of Ernest (1919-1979) and Kathleen (née Athy) Mulligan (1921-1992).", "Younger sister of Owain Patrick Mulligan (b. 1983).", "Good friends with Zoe Kazan.", "Married Marcus Mumford in a rustic farmhouse in Somerset before 200 guests, including actors Colin Firth, Jake Gyllenhaal and Sienna Miller. Mulligan wore a plain, backless ivory gown, had 8 bridesmaids and Mumford's father, a vicar, officiated the ceremony.", "Ambassador for the Alzheimer's Society; her maternal grandmother has suffered with the disease since 2000.", "Did not learn to drive until she was age 23, and only learned to do so for the film Never Let Me Go (2010).", "Was in consideration for the role of Annabel Richter in A Most Wanted Man (2014), but Rachel McAdams was cast instead.", "16th Jan - 17th March performing \"The Seagull\" at Royal Court Theatre [March 2007]", "She has Irish, Welsh, and English ancestry. Her mother was raised in Llandeilo, Wales.", "Was childhood penpals with future husband Marcus Mumford, but the two lost touch before reconnecting as adults and later marrying.", "Worked as a pub barmaid and studio runner between acting jobs.", "Applied to three different Drama schools at seventeen but was turned down by all.", "Was originally advised by Julian Fellowes not to become an actor and \"Marry a lawyer instead\". She later sent him a letter saying that she was serious about it and was invited to a dinner for aspiring actors.", "Was inspired to become an actor at sixteen after seeing a performance of Henry V starring Kenneth Branagh.", "Has starred in two films that recreate the year 1961: An Education (2009) and Inside Llewyn Davis (2013).", "Her acting idols are Marion Cotillard, Cate Blanchett, and Kate Winslet.", "It is often stated that she bears a strong resemblance to fellow actresses Michelle Williams and Adelaide Clemens.", "(April 20, 2012) Married her boyfriend of fourteen months Marcus Mumford in Somerset following a nine-month-long engagement.", "Has two children with her husband Marcus Mumford: a daughter Evelyn Grace Mumford (b. September 15, 2015) and a son Wilfred Mumford (b. August 2017).", "Was six months pregnant with her daughter Evelyn when she completed her run of the Broadway play \"Skylight\".", "Returned to work eight months after giving birth to her daughter Evelyn to begin filming Mudbound (2017).", "Nominated for the 2015 Best Leading Actress in a Play Tony Award for her performance in \"Skylight\". She lost the award to Helen Mirren for her performance in \"The Audience\".", "Suggested Matthias Schoenaerts for the role of Gabriel Oak in Far from the Madding Crowd (2015) after she saw him in the French film Rust and Bone (2012).", "Was seven months pregnant with her son when she completed filming on Collateral (2018).", "Returned to work six months after giving birth to her son to begin performing in the West End play \"Girls and Boys\".", "During her June 2018 Broadway preview of the one-woman play \"Girls and Boys,\" Carey was injured when the heavy curtain came down unexpectedly and struck her on the head. Mildly concussed from the experience in her dressing room after the show, she had to be taken to Urgent Care in Manhattan and was accompanied there by Bradley Cooper who happened to be in the audience.", "She was among the actresses considered for the role of Lisbeth Salander in The Girl With The Dragon Tattoo (2011) before Rooney Mara was cast.", "Has stated in an interview that her nude scene in \"Shame\" was liberating. It's also her first."], "filmography": ["Fingernails", "Maestro", "The Dig", "A Christmas Carol", "Promising Young Woman", "Comic Relief: Mamma Mia! Here We Go Yet Again", "Collateral", "Wildlife", "Mudbound", "Suffragette", "The Walker", "Far from the Madding Crowd", "Skylight", "The Spoils of Babylon", "Inside Llewyn Davis", "The Great Gatsby", "Shame", "Drive", "Never Let Me Go", "Wall Street: Money Never Sleeps", "Brothers", "Public Enemies", "An Education", "The Greatest", "My Boy Jack", "When Did You Last See Your Father?", "Doctor Who", "Northanger Abbey", "Trial & Retribution (2006-2007)", "Waking the Dead", "The Amazing Mrs Pritchard", "Marple", "Bleak House", "Pride & Prejudice"]}