{"name": "Casey Affleck", "current role": "Virgil Malloy", "birth name": "Caleb Casey McGuire Affleck-Boldt", "birth date": "1975-08-12", "birth place": "Falmouth, Massachusetts, USA", "height": "5' 9\" (1.75 m)", "biography": "An accomplished and striking performer, Academy Award® winner Casey Affleck has established himself as a powerful leading man with performances in multiple projects.Caleb Casey McGuire Affleck-Boldt was born in Falmouth, Massachusetts. His mother, Chris Anne (née Boldt), is a school teacher, and his father, Timothy Byers Affleck, is a social worker; the two are divorced. Casey's brother is actor Ben Affleck, who was born in 1972. He is of mostly English, Irish, German, and Scottish ancestry.Affleck was nominated for an Academy Award®, Golden Globe®, and Screen Actors Guild® Award for his performance in the character drama The Assassination of Jesse James by the Coward Robert Ford. Written and directed by Andrew Dominik (\"Chopper\"), the Warner Bros. film stars Affleck as 'Ford' opposite Brad Pitt's 'Jesse James.' The story follows 'Ford's' sycophantic obsession with 'James' that quickly turns into growing resentment after he joins the legendary outlaw's gang, leading to his subsequent plan to murder 'James' and claim his rightful glory.Additionally, Casey garnered significant praise for his starring role in the Miramax film Gone, Baby Gone. Based on Dennis Lehane's novel of the same title, and adapted for the screen and featuring the directorial debut by Ben Affleck, the film is the story of two Boston detectives in search of a four-year-old girl who has been kidnapped. The film also stars Ed Harris, Morgan Freeman and Michelle Monaghan.In 2014, Affleck and John Powers Middleton formed The Affleck/Middleton Project, a full service production company designed to develop and produce film and television content across a variety of genres. With a mission to produce quality films and television series that connect with audiences, The Affleck/Middleton Project looks to develop and produce a new wave of great American entertainment. It was recently announced that The Affleck/Middleton Project has secured the rights to Far Bright Star, the second in the book series of the same name by 'Robert Olmstead;' Affleck will direct a script by Damien Ober with three-time Academy Award® nominee Joaquin Phoenix set to star.Affleck also directed I'm Still Here (2010), which he also wrote and produced starring Joaquin Phoenix. Affleck also co-wrote with and starred alongside Matt Damon in Gus Van Sant's independent road movie Gerry (2002). He has also appeared in Van Sant's Good Will Hunting and To Die For, Hamlet with Ethan Hawke and Julia Stiles, the Oceans trilogy and Tony Goldwyn's The Last Kiss with Zach Braff and Blythe Danner.On stage, Casey appeared in Kenneth Lonergan's West End debut of his award winning play This is Our Youth. Affleck played the role of 'Warren' alongside Matt Damon and Summer Phoenix.In 2016, Affleck starred opposite 'Michelle Williams' in Manchester by the Sea (2016). The film tells the story of an uncle (Affleck) who is forced to take care of his teenage nephew after the boy's father dies. Written and directed by Kenneth Lonergan, the film will be released on November 18th by Amazon Studios.Also that year, he was seen in Triple 9 (2016), opposite Woody Harrelson and Kate Winslet. The film follows a gang of criminals and corrupt cops who plan to murder a police office in order to pull off their biggest heist yet. The film was released by Open Road in February. Additionally, Affleck starred in The Finest Hours (2016), opposite Chris Pine. The Disney film recounts the story of the Coast Guard's daring rescue attempt off the coast of Cape Cod after a pair of oil tankers are destroyed during a blizzard in 1952.Other credits include Christopher Nolan's Interstellar opposite Matthew McConaughey, Jessica Chastain, and Anne Hathaway; Out of the Furnace opposite Christian Bale; and Ain't Them Bodies Saints opposite Rooney Mara.::Anonymous", "trade mark": "Manipulates features to accurately express emotions", "trivia": ["Younger brother of actor Ben Affleck.", "Attended Columbia University, majoring in Physics. During this time he lived with his grandma in Manhattan.", "His ancestry is mostly English, Irish, German, Scottish, and Scots-Irish/Northern Irish, and distant/remote Swiss-German, Swedish, French, and Welsh. His maternal great-grandfather, Joseph Raymond Boldt, was born in Rhode Island, to German immigrants, and his maternal great-grandmother, Anne Rita Lenihan, was Irish, born in County Down.", "In the 2003 March issue of Nylon Magazine, admitted to not being proud of two movies in his career: Drowning Mona (2000) & Soul Survivors (2001).", "Best friends with his former brother-in-law Joaquin Phoenix.", "Appeared with brother Ben Affleck in the movies Chasing Amy (1997), Good Will Hunting (1997) and 200 Cigarettes (1999).", "His older brother, Ben Affleck, and his fiancée's older brother, River Phoenix, have both played versions of characters played by Harrison Ford. Ben Affleck played Jack Ryan in The Sum of All Fears (2002), and River Phoenix played the young Indy in Indiana Jones and the Last Crusade (1989).", "Former brother-in-law of River Phoenix, Rain Phoenix, Joaquin Phoenix, Liberty Phoenix, and Jennifer Garner.", "He and his brother Ben Affleck have both had on-screen romances with Liv Tyler: Lonesome Jim (2005), Armageddon (1998) and Jersey Girl (2004).", "His mother purchased work by Boston acclaimed photographer Brian Carroll as a gift to Casey, for the back-to-back premieres of Gone Baby Gone (2007) and The Assassination of Jesse James by the Coward Robert Ford (2007).", "Has 2 sons: Indiana Affleck (b. May 31, 2004) & Atticus Affleck (b. January 12, 2008) with ex-wife, Summer Phoenix.", "Graduated from Cambridge Rindge and Latin School in June 1993.", "Uncle of Violet Affleck, Seraphina Rose Elizabeth Affleck and Samuel Garner Affleck.", "As of 2017, he has appeared in 2 films that have been Oscar nominated for Best Picture: Good Will Hunting (1997) and Manchester by the Sea (2016).", "The Afflecks are one of only two pairs of brothers to win Academy Awards in different categories. James Goldman won for adapted screenplay in 1968; the following year, William Goldman won for original screenplay.", "Friends with Matt Damon, Kate Hudson, and Liv Tyler.", "Separated from Summer Phoenix in November 2015. She filed for divorce in July 2017.", "Appeared with Matt Damon in six films: Good Will Hunting (1997), Gerry (2002), Ocean's Eleven (2001), Ocean's Twelve (2004), Ocean's Thirteen (2007), & Interstellar (2014).", "His great-great-grandfather Heinrich/Henry Boldt, as a twelve year-old, discovered the 10th century concave gold disc, the Curmsun Disc, at the Groß- Weckow village in Pomerania. He was playing with friends and found the door to the cellar crypt where the disc was located.", "Former son-in-law of Heart Phoenix.", "Longtime neighbor of Dax Shepard."], "filmography": ["Every Breath You Take ()", "The World to Come", "Our Friend", "Light of My Life", "The Old Man & the Gun", "A Ghost Story", "Triple 9", "The Finest Hours", "Manchester by the Sea", "Interstellar", "Out of the Furnace", "Ain't Them Bodies Saints", "ParaNorman", "Tower Heist", "WWII in HD: The Air War", "I'm Still Here", "The Killer Inside Me", "Gone Baby Gone", "The Assassination of Jesse James by the Coward Robert Ford", "Ocean's Thirteen", "The Last Kiss", "Lonesome Jim", "Ocean's Twelve", "Gerry", "Ocean's Eleven", "Soul Survivors", "American Pie 2", "Attention Shoppers", "Hamlet", "Committed", "Drowning Mona", "American Pie", "200 Cigarettes", "Desert Blue", "Good Will Hunting", "Floating", "Chasing Amy", "Race the Sun", "To Die For", "The Kennedys of Massachusetts", "Lemon Sky"]}