{"name": "Justin Lebrun", "current role": "Goldman Sachs Executive", "birth name": " ", "birth date": " ", "birth place": " ", "height": "6' (1.83 m)", "biography": "Justin LeBrun is a producer/actor/director/screenwriter/musician. He is a native of Louisiana and is 34 years of age. A true \"southern boy\" at heart, he has the ability to win you over with his charm. Life hasn't always been easy for him. Growing up in a broken home, he had to overcome many odds. He recognized that in order to change his destiny, he'd have to change everything around him.As a child, his heroes were Sylvester Stallone and Bruce Lee. He imitated films like \"Rambo\" and \"Enter the Dragon\". Justin knew deep down inside that his love for performance was sure to have its day. He learned to play the guitar and began writing his own songs. Once he entered college, he began taking acting classes and participated in a few plays. Realizing that Biology would have to wait, he hung his lab coat up and headed to Hollywood. He spent over a year in California, got his feet wet, and decided he would take performing arts, film, and writing seriously and he would do it in his home state of Louisiana. Upon Justin's return, his career has began to take shape.Recently, he was featured alongside Charlize Theron in her upcoming feature, \"Dark Places\", has been immortalized in \"Terminator:Genysis\", and is responsible for producing a number of projects. Everything from fashion shows for Rue 21, Mimosa, and Cindie's Lingerie, to Rock and Rap music videos, a number of short films, as well as charity events. One particular in which Bethany Hamilton, Soul Surfer, was a speaker. He submitted a film for the LA Film Prize, which he wrote, directed, starred, produced, and is doing the musical score for. Justin LeBrun has a valid talent network, multiple intellectual properties, and an ability to assemble a cast and crew for each endeavor. He is also writing a book and is a literary agent.With 2015 comes a fortuitous schedule. He is finishing his first feature length screenplay and is already lining out the next two. Now living in New Orleans or the \"New Hollywood\", Justin has his involvement in many major motion pictures, television series, and independent films. One, \"Hell of a Night\", directed by Brian Childs, is to release in 2015. Another, \"Danger, Dames and Dangerous Games\" is to be released in 2016 and is written and directed by Alex Salazar. Justin is slating a comedy pilot that he co-wrote and created to be shot in his hometown of Lake Charles, LA. He has officially planted seeds as a producer in the \"Crescent City\", as well. Recently, Justin was asked to showcase the acclaimed burlesque group, Fleur de Tease for a highlight video. He feels there is no other way to bring about the satisfaction of pursuing the \"Hollywood dream\" than to bring a touch of it back home.::Jasmine Doyle", "trade mark": " ", "trivia": " ", "filmography": ["Devotion ()", "Substitutes ()", "Lullaby Lilly ()", "Hell of a Night", "Apocalypse Rising", "A Lesson In Cruelty", "Future King", "Danger, Dames & Dangerous Games", "Jean", "Vincent N Roxxy", "Into the Badlands", "The Big Short", "Delta Justice: The Islenos Trappers War", "The Astronaut Wives Club", "Terminator Genisys", "Mississippi Grind", "Sinister Ministers: Collared", "Masquerade at Heist", "Love Will Tear Us Apart", "Loaded", "Dirt"]}