{"name": "Mark Roman", "current role": "WAMU banker at casino", "birth name": "Mark Alan Nehls", "birth date": " ", "birth place": " ", "height": " ", "biography": "Mark is known for his \"Lt. Frank\" live improv character, loosely based on Lt. Dangle of Reno 911! Lt. Frank, powered by the spirit of Emperor Norton, and motivated to perform a Don Rickles routine with any stranger, has issued over 10,000 \"citations\" (Mark created) ... while wearing women's short shorts and rainbow \"tactical\" leg warmers. Thomas Lennon calls Mark his \"doppelganger\" and \"a really big dude ... a lot bigger than me.\" Lt. Frank was seen in the Hollywood Reporter, on KTLA & ABC news, at Beachers Madhouse (Hollywood & Las Vegas), and (almost) in an episode of Ray Donovan. Mark has worked as a busker or street performer (as Robin Williams, Rod Stewart and Penn & Teller have). In \"Mark Roman Empire (also a podcast)\" Mark monologues on his week and interviews his actor, comedian, musician and other notable friends in Los Angeles. Without apology, Mark's IMDb remains littered with background artist roles. Mark understands how being an extra ruined the careers of Tiffany Haddish, Ricky Gervais and Brad Pitt. Mark recklessly performs comedy & drama. For a living. Even barely. Without shame. Without remorse. What Mark regrets is ever working in mortgage banking. Or any sales, really. Seriously, how DO people do it?! Mark proudly pays his rent as a professional actor, whether busking to a global audience or working a SAG-AFTRA union contract. While Mark lacks representation, he was legally ruled a celebrity by the federal judge who dismissed his defamation suit against a former college where Mark founded, edited & published the independent student newspaper \"The Hillsdale Spectator\". Mark viscerally knows what it's like to have one's life profoundly changed. While a teenager. Because politically powerful men fear what one might discover. Journalists have yet to investigate whether Mark remains on the FBI's Subversives List. Mark wrote the poems \"Son of Elmer Gantry's Bitch\" and \"Pain from Parents. The Pious. And the Patriotic.\" Mark performed stand-up comedy in the San Francisco Bay Area, and looks forward to developing a fresh autobiographical act in Los Angeles, utilizing his unique improvisation skills honed by his Lt. Frank act. Mark works only union contracts (for covered work), and is happy to direct curious producers to union contract information resources. Mark remains an Eagle Scout, although he finds the entire premise colonial, archaic and quite possibly a scandalous waste of a young man's childhood. Like Charlie in the Chocolate Factory, Mark's just happy to be here. In Hollywood.::Mark Roman", "trade mark": " ", "trivia": " ", "filmography": ["Mank", "Dirty John", "All American", "American Horror Story", "The Goldbergs", "The Kominsky Method", "NCIS: Los Angeles (2011-2019)", "Bones", "Live by Night", "Black-ish", "Transparent", "Adam Ruins Everything", "War Dogs", "Veep", "Mom", "New Girl", "The Trust", "The Big Short", "Reality TV Movie", "Mob City", "Enough Said", "Snake & Mongoose", "Southland", "Bunheads", "CSI: Crime Scene Investigation (2011-2012)", "Kickin' It", "The Master", "Ruby Sparks", "The Dark Knight Rises", "Any Day Now", "Mad Men", "Californication", "Two and a Half Men (2011-2012)", "Chuzhoe litso", "Family Album", "Metro", "The World's Astonishing News!", "Wonder Woman", "It's Always Sunny in Philadelphia", "Mike & Molly", "Man Up!", "Free Agents", "The Protector", "Entourage", "Hawthorne", "Rizzoli & Isles", "Criminal Minds", "How I Met Your Mother", "Brothers & Sisters", "Rules of Engagement", "I (Almost) Got Away with It", "Chuck", "The Event", "Gaikôkan Kuroda Kôsaku", "Trauma", "Devious, Inc."]}