{"name": "Eydie Gormé", "current role": "Boxing Spectator", "birth name": "Edith Gormezano", "birth date": "1928-08-16", "birth place": "The Bronx, New York, USA", "height": " ", "biography": "Eydie Gorme was born in New York on August 16, 1928 to Sephardic Jewish parents. Her father, Nessim Garmezano, was a tailor, from Sicily, who changed his last name when he arrived in the United States. Gorme began singing straight out of high school, with various big bands. But her big break came after she auditioned for, and joined, \"The The Tonight Show (1953) Show\" in 1953. There, for $90 a week, she sang solos and sang duets with the up-and-coming Steve Lawrence. The two performed on the show for five years, and married in 1957. After their \"Tonight Show\" stint, the pair had a short-lived TV show of their own, The Steve Lawrence-Eydie Gorme Show (1958). Then, Lawrence entered the Army leaving Gorme, a new mother, to frequent the night club circuit on her own. Two years later, when Lawrence was discharged, the couple came to a decision to enter show business more professionally. Their career took off, with audiences drawn to their penchant for the classics in favor of rock 'n' roll, as well as their spontaneous banter.::Anonymous", "trade mark": " ", "trivia": ["Mother, with Steve Lawrence, of David Lawrence and Michael Lawrence.", "Was a high school classmate of Stanley Kubrick.", "Graduated from William Howard Taft High School in The Bronx, New York City in 1946.", "Worked at the United Nations due to her fluency in Spanish.", "She and husband Steve Lawrence retired from performing for a time, distraught over the early death of one of their sons. They eventually returned to the limelight but at a slower pace.", "Eydie was considered for the role of Fanny Brice in the Broadway show \"Funny Girl\" but turned it down when the producers would not cast husband, Steve Lawrence, in the part of \"Nicky Arnstein\". Later came Barbra Streisand and the rest is history.", "First cousin of Neil Sedaka and Helene Sedaka.", "Is portrayed by Debbie Shapiro Gravitte in Isn't She Great (2000)", "She and husband Steve Lawrence were awarded a star on the Hollywood Walk of Fame for Recording at 1541 Vine Street in Hollywood, California on February 8, 1960.", "Second cousin of Dara Sedaka and Marc Sedaka.", "Her publicist was Howard Bragman.", "Her father, Nessim Gormezano, was a Sicilian tailor who changed his name upon his arrival in the United States.", "Best known for her 1963 Grammy Award-nominated song \"Blame it on the Bossa Nova\".", "Her son, Michael Lawrence, died of heart failure in 1986.", "Her mother was Turkish."], "filmography": ["Ocean's Eleven", "American Express: Grand Canyon", "The Nanny", "Frasier", "Empty Nest", "Alice in Wonderland", "Sanford and Son", "The Tim Conway Comedy Hour", "The Kraft Music Hall"]}