{"name": "Steve Carell", "current role": "Mark Baum", "birth name": "Steven John Carell", "birth date": "1962-08-16", "birth place": "Concord, Massachusetts, USA", "height": "5' 9\" (1.75 m)", "biography": "Steve Carell, one of America's most versatile comics, was born Steven John Carell on August 16, 1962, in Concord, Massachusetts. He is the son of Harriet Theresa (Koch), a psychiatric nurse, and Edwin A. Carell, an electrical engineer. His mother was of Polish descent and his father of Italian and German ancestry (Steve's grandfather had changed the surname from \"Caroselli\" to \"Carell\"). Steve was educated at The Fenn School, an all-boys private school in Concord, Massachusetts, then at Middlesex School in Concord. After graduating from Denison University in Granville, Ohio, he moved to Chicago where he taught an improvisational comedy class and performed with The Second City troupe, alongside Stephen Colbert.Carell made his film debut as \"Tesio\" in Curly Sue (1991). In 1996, he became a cast member of The Dana Carvey Show (1996), and provided the voice for Gary, opposite Colbert in \"The Ambiguously Gay Duo\". This animated short series produced by Robert Smigel continued on Saturday Night Live (1975), but Carell has joked that he auditioned for SNL and lost the job to Will Ferrell. Carell made a number of guest appearances on such shows as Come to Papa (2004), Just Shoot Me! (1997), and Watching Ellie (2002), before landing a regular stint as a correspondent on The Daily Show (1996) from 1999 until 2005.Carell played Evan Baxter opposite Jim Carrey in Bruce Almighty (2003), and Uncle Arthur opposite Nicole Kidman and Will Ferrell in Bewitched (2005). He broke out as a leading man after starring in the summer box-office hit The 40-Year-Old Virgin (2005), which he also co-wrote; the film was chosen as one of the Top Ten movies of 2006 by the American Film Institute. He next starred in the critically acclaimed Little Miss Sunshine (2006), an indie dark comedy which became a surprise hit and earned four Oscar nominations, and won two (Best Supporting Actor for Alan Arkin and Best Screenplay for Michael Arndt). In 2007, Carell reprised his role as Evan Baxter, filling Jim Carrey's leading-man shoes as a politician asked by God to build a giant ark in Evan Almighty (2007), the second installment of the \"Almighty\" franchise, co-starring Lauren Graham and Morgan Freeman. In 2008, he re-united with Jim Carrey in the highly successful animation hit Horton Hears a Who! (2008), then appeared as Agent Maxwell Smart in the popular comedy Get Smart (2008).Throughout this time, Carell maintained a successful career in television, starring as Michael Scott in the American remake of the Britain's existential comedy, The Office (2005). He received the Golden Globe Award for Best Actor in Television Comedy for this leading role in 2006, and earned both Emmy and Golden Globe nominations each consecutive show until he departed in 2011.In 2010, Carell announced he was leaving \"The Office\" to concentrate on his film career, and has made steady appearance in such films as Date Night (2010), Despicable Me (2010), Crazy, Stupid, Love. (2011), and Seeking a Friend for the End of the World (2012). Carell's most recent roles are the comedies Despicable Me 2 (2013), Anchorman 2: The Legend Continues (2013), and Alexander and the Terrible, Horrible, No Good, Very Bad Day (2014), and the drama Foxcatcher (2014), and the more serious Beautiful Boy (2018) and Vice (2018).Steve Carell has been enjoying a happy family life with his wife, actress Nancy Carell, whom he met when she was a student in an improv class he was teaching at The Second City comedy troupe in Chicago. The couple have two children, daughter Elizabeth (born in May 2001), and son John (born in June 2004). Steve Carell lives with his family in Los Angeles, California.::Jane McKnight", "trade mark": "Frequently works with Will Ferrell and Stephen Colbert", "trivia": ["Attended and graduated from Denison University in Granville, Ohio (1984).", "Has two children: Elisabeth Anne Carell (b. May 2001) and John Carell (b. June 2004).", "Married to actress/writer Nancy Carell, whom he met while both were writer/performers with the famed Second City comedy troupe in Chicago, Illinois.", "When he attended the premiere for Bruce Almighty (2003), he came to the screening with the impression that his scenes were left on the cutting-room floor. However, his scenes were in the film, and he was pleasantly surprised.", "His paternal grandfather, Ernest Caroselli, was an Italian emigrant, from Bari, Italy, and his paternal grandmother, Marie G. Egle, was of German ancestry. Steve's maternal grandparents Zigmund Koch and Frances Victoria Tolosky were of Polish origin. Steve's father was born under the surname \"Caroselli\", which he changed to \"Carell\" before Steve was born.", "Was once a reporter for The Daily Show (1996).", "Provides the voice of Gary on \"The Ambiguously Gay Duo\" cartoons on Saturday Night Live (1975).", "Originally wanted to be a lawyer, but he reached a question on an application form that said, \"Why do you want to be a lawyer?\". He could not think of anything.", "Has the rare distinction of being in two movies that opened on the same day in the United States - Anchorman: The Legend of Ron Burgundy (2004) and Sleepover (2004) (July 9, 2004).", "Was on three failed sitcoms before he starred on NBC's version of the sitcom The Office (2005).", "Worked the overnight shift in a Store 24 in Maynard, Massachusetts, and takes many of his characters from this experience.", "Denison Univerisity is not only the alma mater of Steve Carell and Jennifer Garner, it is also the alma mater of Hal Holbrook, John Davidson, John Schuck and Tom Cotter.", "Is a member of what the media refers to as the Frat Pack, along with Jack Black, Ben Stiller, Vince Vaughn, Will Ferrell, Owen Wilson and Luke Wilson. The Frat Pack name is a reference to the film Old School (2003), featuring Vaughn, Ferrell and Wilson, due to the wide number of films featuring the seven actors. Carell's Frat Pack films include Anchorman: The Legend of Ron Burgundy (2004), Bewitched (2005) and Melinda and Melinda (2004).", "Grew up in Acton, Massachusetts.", "Editor-in-Chief of his high school newspaper, Newton South's \"The Lion's Roar\".", "Attended Middlesex School in Concord, Massachusetts.", "The scene in The 40-Year-Old Virgin (2005), where Andy has his chest hair removed, required five cameras set up for the shot. It was Carell's real chest hair which was ripped out in the scene. Carell told director Judd Apatow just before shooting the scene: \"It has to be real. It won't be as funny if it's mocked up or if it's special effect. You have to see that this is really happening.\" The scene had to be done in one shot.", "Good friends with fellow former The Daily Show (1996) correspondent Stephen Colbert.", "Was offered a role in Talladega Nights: The Ballad of Ricky Bobby (2006) with Will Ferrell but could not accept due to scheduling conflicts.", "Was a member of Burpee's Seedy Theatrical Company, Denison University's improv-comedy group and the oldest collegiate improv group in the country.", "Is one of 115 people invited to join the Academy of Motion Picture Arts and Sciences (AMPAS) in 2007.", "He and Jim Carrey were both ice hockey goalies in their childhood.", "Worked for a brief period at a post office in Massachusetts where he delivered mail using his own car since the post office did not have mail carrier vehicles. When he resigned from the position to move to Chicago, for months afterward he continued to find undelivered mail under his car seats.", "He was nominated for a 1993 Joseph Jefferson Award for Actor in a Revue for \"Truth, Justice, or the American Way\", at the Second City Theatre in Chicago, Illinois.", "He was nominated for a 1994 Joseph Jefferson Award for Actor in a Revue for \"Are You Now or Have You Ever Been Mellow?\", at the Second City Theatre in Chicago, Illinois.", "Owns and operates the Marshfield Hills General Store in Marshfield, Massachusetts, where he has a summer home.", "Received a star on the Hollywood Walk of Fame at 6708 Hollywood Boulevard in Hollywood, California on January 6, 2016.", "First rock concert he ever attended featured Jethro Tull.", "As of 2019, he has been in 3 films that were Oscar nominated for Best Picture: Little Miss Sunshine (2006), The Big Short (2015), and Vice (2018).", "Steve Carell references the same quote by Abraham Lincoln in two films. In Dinner for Schmucks \"Our countries are not enemies, they are friends\" from Lincoln's \"We are not enemies, but friends,\" and in Irresistible \"...and appeal to our better angels\" which he attributes to Lincoln yet misquotes from Lincoln's \"by the better angels of our nature.\"."], "filmography": ["Minions: The Rise of Gru", "The Morning Show (2019-2021)", "The Greatest Gift", "Irresistible", "Space Force", "Welcome to Marwen", "Vice", "Beautiful Boy", "Last Flag Flying", "Battle of the Sexes", "Despicable Me 3", "Café Society", "The Big Short", "Freeheld", "Minions", "9 Kisses", "The Tonight Show Starring Jimmy Fallon", "Alexander and the Terrible, Horrible, No Good, Very Bad Day", "Foxcatcher", "Neighbors", "Panic in the Mailroom", "Anchorman 2: The Legend Continues", "Pharrell Williams: Happy", "Web Therapy", "Despicable Me 2: The Music in the Film", "Despicable Me 2", "The Office (2005-2013)", "The Incredible Burt Wonderstone", "The Way Way Back", "The Simpsons", "Hope Springs", "Despicable Me: Minion Mayhem 3D", "Seeking a Friend for the End of the World", "Life's Too Short", "Crazy, Stupid, Love.", "Saturday Night Live (1996-2011)", "Dinner for Schmucks", "Todos contra Juan", "Despicable Me", "Despicable Me", "Date Night", "Get Smart", "Horton Hears a Who!", "Stories USA", "Dan in Real Life", "Evan Almighty", "The Naked Trucker and T-Bones Show", "Hammy's Boomerang Adventure", "Over the Hedge", "American Storage", "Little Miss Sunshine", "The 40-Year-Old Virgin", "Bewitched", "Wake Up, Ron Burgundy", "Melinda and Melinda", "Sleepover", "Anchorman: The Legend of Ron Burgundy", "Come to Papa", "Anchorman: Afternoon Delight", "Fillmore!", "The Lunchbox Chronicles", "Outlaw Volleyball", "Watching Ellie (2002-2003)", "Bruce Almighty", "Street of Pain", "Outlaw Golf", "H.U.D.", "Strangers with Candy", "Suits", "Just Shoot Me!", "Homegrown", "Tomorrow Night", "Over the Top", "The Dana Carvey Show", "All My Children", "The Second City's 149 1/2 Edition", "Life As We Know It!", "Curly Sue"]}