{"name": "Ludacris", "current role": "Self", "birth name": "Christopher Brian Bridges", "birth date": "1977-09-11", "birth place": "Champaign, Illinois, USA", "height": "5' 8\" (1.73 m)", "biography": "Ludacris was born Christopher Brian Bridges in Champaign, Illinois, where he was raised, the son of Roberta Shields and Wayne Brian Bridges. At nine years old, he started rapping. He attended Emerson Middle School and, eventually, Oak Park and River Forest High School for his freshman year. Furthermore, his family moved to live in Atlanta, Georgia and, in this time, his father exposed him to all kinds of music, ranging from Hip-Hop to Rock. In Alanta, Georgia, he attended Banneker High School. He is also a graduate of Georgia State University. In 2000, he got his breakthrough with his album, titled \"Back for the First Time\", which reached 3x platinum. All albums following have either been 2x or 3x platinum, with his first film appearance being 2 Fast 2 Furious (2003), which was a success. Other film appearances included Crash (2004) and Hustle & Flow (2005).::freemca", "trade mark": " ", "trivia": ["Was dropped as a spokesperson for Pepsi after a protest by 'Bill OReilly.", "Has two daughters, Karma Bridge, born August 2001, from a previous relationship, and Cai Bella Bridges, born December 2013, with Tamika Fuller.", "Cousin of singer Monica and Katt Williams.", "Attended Benjamin Banneker High in Atlanta, and Georgia State University.", "Before becoming a rapper, he worked as an intern (and eventually DJ) for Hot 97.5 (now 107.9) FM in Atlanta.", "Is the CEO of Disturbing Tha Peace Records.", "Still drives his 1992 Acura Legend because it \"keeps me grounded.\"", "He recently cut off his trademark braids.", "Made Forbes' \"Hip Hop Cash Kings\" list with $16 million in earnings. [2007]", "He is African-American, and has said that he also has Native American ancestry.", "Is good friends with Larenz Tate.", "The music score \"Sense Of Touch\" was used both in the film Crash (2004) in which he had a role, and in the episode of Law & Order (1990) in which he appears.", "He and his wife, Eudoxie Mbouguiyengue, have a daughter together born in June 2015.", "He is a second cousin, once removed, of comedian Richard Pryor. Ludacris's maternal great-great-grandparents, William A. Craig and Nancy, were also Pryor's great-grandparents.", "Friends with Rick Ross, Raymond Usher, Terrence Jenkins, Lance Gross, and Kevin Hart.", "In January 2020 he acquired Gabonese citizenship (his wife is from Gabon)."], "filmography": ["Superstition: The Rule of 3's ()", "F9", "Will from Home", "John Henry", "Show Dogs", "The Ride", "Carrie Underwood Feat. Ludacris: The Champion", "Ludacris: Vices", "Doc McStuffins", "The Fate of the Furious", "Jim Henson's Turkey Hollow", "Empire", "Furious 7", "Being Mary Jane", "Fast & Furious 6", "Ciara: Body Party", "Justin Bieber: All Around the World", "Ludacris Feat. Usher, David Guetta: Rest of My Life", "Ludacris Feat. Kelly Rowland: Representin", "Untitl3d Feat. Ludacris: Stupid Dumb Fly", "John Legend Feat. Ludacris: Tonight", "New Year's Eve", "Ludacris: Rich & Flexin", "Ludacris: Bada Boom", "Breakaway", "David Guetta Feat. Taio Cruz and Ludacris: Little Bad Girl", "Fast Five", "No Strings Attached", "Enrique Iglesias: Tonight", "My Darkest Days Porn Star Dancing Featuring Ludacris, Chad Kroeger", "Ludacris Feat. Trey Songz: Sex Room", "Ciara Feat. Ludacris: Ride", "Justin Bieber Feat. Ludacris: Baby", "DJ Felli Fel Feat. Diddy, Akon, Ludacris, Lil Jon: Get Buck in Here", "Gamer", "Jesse McCartney Feat. Ludacris: How Do You Sleep?", "Max Payne", "RocknRolla", "Ludacris feat. Chris Brown: What Them Girls Like", "Ball Don't Lie", "Disturbing Tha Peace Feat. Ludacris, Chingy, Small World, Steph Jones: Celebrity Chick", "Ludacris & Mary J. Blige: Runaway Love", "R. Kelly Feat. Ludacris and Kid Rock: Rock Star", "Fred Claus", "Law & Order: Special Victims Unit (2006-2007)", "The Simpsons", "Fergie Feat. Ludacris: Glamorous", "Shawnna: Gettin' Some", "Ludacris Feat. Pharrell: Money Maker", "Shareefa Feat. Ludacris: Need a Boss", "NBA Ballers: Phenom", "Jamie Foxx Feat. Ludacris: Unpredictable", "Eve", "Ciara Feat. Ludacris: Oh", "Ludacris: Number One Spot/The Potion", "Hustle & Flow", "Lil' Pimp", "Ludacris: Get Back", "Shawnna Feat. Ludacris: Shake Dat Shit", "Def Jam: Fight for NY", "Crash", "Usher Feat. Ludacris and Lil Jon: Yeah!", "Chingy Feat. Ludacris & Snoop Dogg: Holidae Inn", "Sex & the Studio 2", "Ludacris Feat. Shawnna: Stand Up", "2 Fast 2 Furious", "Ludacris: Act a Fool", "Eminem: Sing for the Moment", "Def Jam Vendetta", "Missy Elliott ft. Ludacris: Gossip Folks", "Disturbing Tha Peace: Growing Pains", "Disturbing Tha Peace Feat. Shawnna, Lil Fate, Tity Boi, I-20: N.S.E.W", "Monica: All Eyez on Me", "Ludacris Feat. Mystikal & I-20: Move Bitch", "Ludacris Feat. Sleepy Brown: Saturday, Oooh Oooh!", "Mariah Carey Feat. Da Brat, Ludacris, Shawnna and Twenty II: Loverboy - Remix Version", "OutKast: So Fresh, So Clean", "The Wash", "Ludacris Feat. Nate Dogg: Area Codes", "Missy Elliott: One Minute Man", "SpringBling Beach Towel Throwdown", "Missy Elliott: Get Ur Freak On", "Ludacris: Southern Hospitality", "Ludacris Feat. Shawnna: What's Your Fantasy", "Eyes on Hip Hop"]}