{"name": "Julia Roberts", "current role": "Tess Ocean", "birth name": "Julia Fiona Roberts", "birth date": "1967-10-28", "birth place": "Smyrna, Georgia, USA", "height": "5' 8\" (1.73 m)", "biography": "Julia Fiona Roberts never dreamed she would become the most popular actress in America. She was born in Smyrna, Georgia, to Betty Lou (Bredemus) and Walter Grady Roberts, one-time actors and playwrights, and is of English, Irish, Scottish, Welsh, German, and Swedish descent. As a child, due to her love of animals, Julia originally wanted to be a veterinarian, but later studied journalism. When her brother, Eric Roberts, achieved some success in Hollywood, Julia decided to try acting. Her first break came in 1988 when she appeared in two youth-oriented movies Mystic Pizza (1988) and Satisfaction (1988). The movies introduced her to a new audience who instantly fell in love with this pretty woman. Julia's biggest success was in the signature movie Pretty Woman (1990), for which Julia got an Oscar nomination, and also won the People's Choice award for Favorite Actress. Even though Julia would spend the next few years either starring in serious movies, or playing fantasy roles like Tinkerbell, the movie audiences would always love Julia best in romantic comedies. With My Best Friend's Wedding (1997) Julia gave the genre fresh life that had been lacking in Hollywood for some time. Offscreen, after a brief marriage, Julia has been romantically linked with several actors, and married cinematographer Daniel Moder in 2002; the couple has three children together.Julia has also become involved with UNICEF charities and has made visits to many different countries, including Haiti and India, in order to promote goodwill. Julia Robert remains one of the most popular and sought-after talents in Hollywood.::kdhaisch@aol.com", "trade mark": "Her bright smile", "trivia": ["Lent her celebrity name to help raise money for research to develop a cure for Rett Syndrome (a disease which is potentially fatal and randomly strikes girls between the ages of 2 to 6 years).", "Has been part of several public polls. She was chosen by People Magazine among \"50 Most Beautiful People in the World\" in 1990, 1991, 2000, 2002, 2005 and 2006. In 1997, she ranked #66 in Empire (UK) magazine's \"The Top 100 Movie Stars of All Time\" list (October 1997). Ranked #1 on Forbes magazine 'Celebrity 100' (2000). Named one of E!'s \"Top 20 entertainers of 2001\" and one of People Magazine's '25 Most Intriguing People of 2001'. Same year, she ranked 6th of the 100 Sexiest Women by FHM Taiwan and was cited as America's Favorite Movie Star in a Harris Poll. In 2003, she was #10 in Star TV's Top 10 Box Office Stars of the 1990 and #16 in 2003 on Premiere's Annual Hollywood Power List. In 2005, Premiere Magazine Stars in Our Constellation feature ranked Julia as the #7 Greatest Movie Star of All Time. in their Stars in Our Constellation feature (2005). In November 2006, she was chosen \"Sexiest Bespectacled Star\" by the readers of \"In Touch\" (Nov 2006) . In 2007 she was named #57 on Empire Magazine's 100 Sexiest Movie Stars.", "Had a maternal half-sister, Nancy Motes (1976 - 2014).", "Turned down the female lead in Shakespeare in Love (1998).", "Was engaged to Kiefer Sutherland for a brief period. Broke up with him just days before their planned marriage in 1991.", "Younger sister of Lisa Roberts Gillan and Eric Roberts.", "Played clarinet in the band. She attended Griffin Middle School and then Campbell High School.", "Has \"movie within a movie\" scenes in The Player (1992), Notting Hill (1999), America's Sweethearts (2001) and Full Frontal (2002).", "Was considered for the role of Poison Ivy in Batman & Robin (1997).", "Dated Benjamin Bratt (1997-2001).", "Born to Walter Grady Roberts (1933-1977), a vacuum cleaner salesman, and his wife Betty Lou Bredemus (1934-2015), a one-time church secretary and real estate agent. Her parents were stage actors and acting coaches.", "Tops the list of the 200 \"hottest\" actors and actresses in the business in \"James Ulmer's Hollywood Hot List: The Complete Guide to Star Power - 2000\" book which is published in October 2000. [June 2000]", "Was engaged to her Steel Magnolias (1989) co-star, Dylan McDermott.", "Lies on her back to have her make-up applied before going onto a film set -- she insists it gives her a relaxed look.", "Sister-in-law of Tony Gillan and Eliza Roberts.", "Aunt of Emma Roberts.", "After George Clooney and Brad Pitt found out that she was going to be joining them in Ocean's Eleven (2001), they sent her a card that read \"We heard that you get 20 per film\" and in it was a $20 bill; the joke was that she reportedly gets $20 million per film.", "At the 2002 Peoples Choice Awards she admitted to being a huge fan of Days of Our Lives (1965) and asked to be seated near the cast.", "Splits her down time between her ranch in Taos, New Mexico and a home in New York City.", "Married boyfriend, cameraman Daniel Moder, at their ranch home in Taos, New Mexico in a midnight ceremony. Bruce Willis was the only celebrity that attended her wedding to Daniel Moder. Julia wore a simple pink cotton halter dress by pal Judith Beylerian (4 July 2002).", "She never acted in a sequel until Ocean's Twelve (2004).", "She has English, German, Swedish, Irish, Scottish, and Welsh ancestry.", "She is a huge fan of actress Aishwarya Rai Bachchan, whom she once commented on being \"The most beautiful woman in the world, more beautiful than any Hollywood actress.\"", "Pakistani film director Rauf Khalid wanted her to work in his film, and even invited her to Pakistan to discuss the project, but she refused because of prior commitments.", "Observed art history classes at New York University in order to prepare for her role in Mona Lisa Smile (2003).", "Her Oscar-winning performance as Erin Brockovich-Ellis was ranked #31 on the American Film Institute's Heroes list of the 100 years of The Greatest Screen Heroes and Villains.", "Announced that she and husband Daniel Moder are expecting twins. Twins run in her family. She is due in early 2005. [June 2004]", "Canadian singer-songwriter Chantal Kreviazuk wrote the song \"Julia\" about her after seeing her at a Los Angeles restaurant.", "A 9000 year old female skeleton excavated in Bulgaria in November 2004, was called by the archaeologists \"Julia Roberts\" because of the perfect teeth it had. They said that woman would have had a perfect smile - just like the actress.", "Has worked with both Hector Elizondo and Richard Gere in two different movies, first in Pretty Woman (1990), and then again in Runaway Bride (1999).", "As Erin Brockovich-Ellis is right handed and Roberts is not, she had to learn to use her right hand for Erin Brockovich (2000).", "Has played an art historian twice, once in Everyone Says I Love You (1996) and also in Mona Lisa Smile (2003).", "First actress to reach 20 million dollar mark salary (for Erin Brockovich (2000)) The first actor to do so was Jim Carrey, four years earlier, who was paid the same amount for his role in The Cable Guy (1996).", "She and her Ocean's Eleven (2001) / Ocean's Twelve (2004) co-stars George Clooney, Brad Pitt and Elliott Gould, all have guest-starred on the situation comedy Friends (1994), though not in the same episodes.", "Roberts' production company \"Red Om\" films is her husband Danny's second name reversed.", "As a gesture of thanks for giving her children music lessons, Coretta Scott King paid the hospital bills when the pregnant Mrs. Roberts' delivered her next child. That child ended up being Julia.", "Early in her career, she auditioned unsuccessfully for two soap opera roles. She lost the part of \"Linda Warner\" to Melissa Leo on All My Children (1970); and the part of \"Hayley Benson\" to Stacy Edwards on Santa Barbara (1984).", "Her great-grandmother Elin (Eleanor) was Swedish, born 1884 in Värmland, Sweden. She died in Minneapolis 1960, seven years before Julia was born.", "Her Broadway debut in the play \"Three Days of Rain\" in 2006 received terrible reviews for her performance and ran for just 70 performances.", "Good friends with Denzel Washington since they met while co-starring in The Pelican Brief (1993).", "Daughter-in-law of Mike Moder.", "She won an Oscar for playing Erin Brockovich in Erin Brockovich (2000), making her one of 17 actors to win the Award for playing a real person who was still alive at the evening of the Award ceremony (as of 2015). The other sixteen actors and their respective performances are: Spencer Tracy for playing Father Edward Flanagan in Boys Town (1938), Gary Cooper for playing Alvin C. York in Sergeant York (1941), Patty Duke for playing Helen Keller in The Miracle Worker (1962), Jason Robards for playing Ben Bradlee in All the President's Men (1976), Robert De Niro for playing Jake La Motta in Raging Bull (1980), Sissy Spacek for playing Loretta Lynn in Coal Miner's Daughter (1980), Jeremy Irons for playing Claus Von Bullow in Reversal of Fortune (1990), Susan Sarandon for playing Sister Helen Prejean in Dead Man Walking (1995), Geoffrey Rush for playing David Helfgott in Shine (1996), Jim Broadbent for playing John Bayley in Iris (2001), Helen Mirren for playing Queen Elizabeth II in The Queen (2006), Sandra Bullock for playing Leigh Anne Tuohy in The Blind Side (2009), Melissa Leo for playing Alice Eklund-Ward in The Fighter (2010), Christian Bale for playing Dickie Eklund in The Fighter (2010), Meryl Streep for playing Margaret Thatcher in The Iron Lady (2011) and Eddie Redmayne for playing Stephen Hawking in The Theory of Everything (2014).", "An accomplished equestrienne, she did her own riding in Runaway Bride (1999).", "Turned down leading role in Sleepless in Seattle (1993) which went to Meg Ryan.", "Received the American Cinematheque Award. [October 2007]", "Is an alumni of the Lee Strasberg Institute such as actors Angelina Jolie, Frank Miranda, Mickey Rourke, Scarlett Johansson, Rosario Dawson, Dennis Hopper.", "Six directors whom have cast her at least twice in their films are: Mike Nichols, Steven Soderbergh, Garry Marshall, Robert Altman, Ryan Murphy, and Joel Schumacher.", "Good friends with Bruce Willis, Tom Hanks, George Clooney, Brad Pitt, Susan Sarandon, Natalie Portman, David Letterman, and Dave Matthews.", "Her stepfather is theater critic Michael Motes.", "Her films have grossed more than $ 2 billion at the US box office, making her the biggest female movie star of all time. [February 2007]", "Has supported UNICEF enthusiastically.", "Buys her own organic greens at the market near her apartment in New York.", "In 2006, she earned $5 million for endorsing Gianfranco Ferre. She posed for eight print ads, which was equivalent for one day of work.", "By 2004, she had a fortune estimated to be worth $212 million. Forbes once named her as #8 among the 20 Richest Women In Entertainment.", "In 2007, Forbes Magazine estimated her earnings for the year at $9 million.", "Currently has made just one movie - Blood Red (1989) - with brother Eric Roberts.", "Is one of 16 actresses that have won an Academy Award, BAFTA Award, Critics' Choice Award, Golden Globe Award and SAG Award for the same performance. The others in chronological order are Renée Zellweger for Cold Mountain (2003), Reese Witherspoon for Walk the Line (2005), Helen Mirren for The Queen (2006), Jennifer Hudson for Dreamgirls (2006), Kate Winslet for The Reader (2008), 'MoNique for Precious (2009), Natalie Portman for Black Swan (2010), Octavia Spencer for The Help (2011), Anne Hathaway for Les Misérables (2012), Cate Blanchett for Blue Jasmine (2013), Patricia Arquette for Boyhood (2014), Julianne Moore for Still Alice (2014), Brie Larson for Room (2015), Allison Janney for I, Tonya (2017), and Frances McDormand for Three Billboards Outside Ebbing, Missouri (2017).", "Is a huge fan of actress Katharine Hepburn.", "Born at 12:16 AM (EST).", "Refused to star in The Proposal (2009) unless Disney offered her a higher salary; eventually, Disney hired Sandra Bullock for even less money than it had offered Roberts, and the film became one of the highest-grossing romantic comedies, ever.", "Is an honorary Phi Mu sister because of her role as one in Steel Magnolias (1989).", "Gave birth to twins (her first and second child) at age 37, a son Finn Moder (aka Phinnaeus Walter Moder) and a daughter Hazel Moder (aka Hazel Patricia Moder) on November 28, 2004. Child's father is her second husband, Daniel Moder.", "Gave birth to her third child at age 39, a son Henry Daniel Moder on June 18, 2007. Child's father is her second husband, Daniel Moder.", "Was forced to deliver her twins Finn Moder and Hazel Moder via emergency Caesarean section 8 days ahead of their due date following a difficult pregnancy.", "Lives in Malibu, California, New York City, New York and Taos, New Mexico.", "She starred alongside actor Bradley Cooper in the Broadway play \"Three Days of Rain\" in 2006. Four years later, they were reunited in the film Valentine's Day (2010).", "Returned to work 13 months after giving birth to her twins Phinneaus and Hazel in order to begin rehearsing for her Broadway debut \"Three Days of Rain\".", "Was 4 months pregnant with her son Henry when she completed filming Charlie Wilson's War (2007).", "Insured her smile for thirty million dollars.", "Returned to work 9 months after giving birth to her son Henry in order to begin filming Duplicity (2009).", "Is a long-time fan of the Dave Matthews Band, and appeared in their music video \"Dreamgirl\" in 2005. It was her first performance after giving birth to her twins.", "Was going to do Shakespeare in Love but things didn't work out.", "Making her Broadway debut in the revival of Richard Greenberg's play \"Three Days of Rain\". Her co-stars are Paul Rudd and Bradley Cooper. [April 2006]", "Capital Hill, Washington, D.C., USA testifying for more federal funding for Rett Syndrome [May 2002]", "The longest she has gone without an Oscar nomination is the 13 years between Erin Brockovich (2000) and August: Osage County (2013).", "Was the 119th actress to receive an Academy Award; she won the Best Actress Oscar for Erin Brockovich (2000) at The 73rd Annual Academy Awards (2001) on March 25, 2001.", "Her role in Sleeping with the Enemy (1991) was originally written for Jane Fonda.", "Dated Matthew Perry.", "She has worked with 4 directors who have won a Best Director Oscar: Steven Spielberg, Woody Allen, Steven Soderbergh, and Mike Nichols.", "Only agreed to film her Bali scenes from Eat Pray Love (2010) on location if the producers agreed to allow her to have her family over there during the shoot.", "Bryan Cranston improved his shape and bleached his teeth when he was cast as her husband in Larry Crowne (2011), stating that he wanted a pairing of them seem more believable.", "Gained 10 pounds while filming the Italian based scenes of Eat Pray Love (2010), due to the amount of pasta she had to endure.", "Frequent collaborator of Dermot Mulroney. They co-starred in My Best Friend's Wedding (1997) and August: Osage County (2013), while she also did a cameo in his directorial debut Love, Wedding, Marriage (2011).", "13 films of her career have been nominated for at least one Academy Award.", "Personally handpicked Nicole Kidman to be her co-star in Secret in Their Eyes (2015). She sent her an email with the script attached that read: \"Will you do this with me?\".", "Made four films with Garry Marshall: Pretty Woman (1990), Runaway Bride (1999), Valentine's Day (2010) and his final film Mother's Day (2016). The last two were only cameos for which Roberts received $3 million from each film.", "Initially, the real Erin Brokovich was displeased with Roberts being cast to portray her in Erin Brockovich (2000), because she felt Roberts didn't match her own psychical appearance and was too well-spoken. She suggested Goldie Hawn and Roseanne Barr for the part.", "Some of her costumes from Mirror Mirror (2012) were so elaborate that her kids could hide under her skirts, while other designs made her pull a muscle. The costumes were the final work of Eiko Ishioka who posthumously received an Oscar nomination for the creations.", "Is a fan of Manchester United FC. Has attended matches in Manchester and visited with the team at training camp in California on a preseason tour of the US in 2017. Reported to be a good friend of Manchester United midfielder Paul Pogba.", "Ninth highest paid actress of 2017 with $12 million.", "Credits Shirley MacLaine as her favorite acting mentor/best friend.", "Whenever Julia is unavailable to re-record her dialogue on film, fellow actress Amy Landecker regularly substitutes by providing her voice for ADR (Automated Dialog Replacement). Many of Roberts' movie trailers also feature the voice of Landecker.", "Has played the daughter to five fellow Best Actress Oscar winners; to Sally Field in Steel Magnolias (1989), to Ellen Burstyn in Dying Young (1991), to Shirley MacLaine in Valentine's Day (2010), to Meryl Streep in August: Osage County (2013), and to Sissy Spacek in Homecoming (2018).", "Nominated for the 2019 Golden Globe Award in the Best Performance by an Actress In A Television Series - Drama category for her role as Heidi Bergman in Homecoming (2018), but lost to Sandra Oh for Killing Eve (2018).", "Roberts has worked with the only 2 men to have won the Oscar for Best Actor who share the same surname: Dustin Hoffman and Philip Seymour Hoffman. She worked with Dustin Hoffman in \"Hook\" (1991) and with Philip Seymour Hoffman in \"Charlie Wilson's War\" (2007).", "Came to fame in the 1989 film Steel Magnolias.", "In film Blood Red (1989) with her brother Eric.", "The only time she has acted out giving birth in a movie was, at age 49, in Wonder (2017)."], "filmography": ["Little Bee ()", "Gaslit", "Let's Dance", "Homecoming", "Ben Is Back", "Wonder", "Smurfs: The Lost Village", "Money Monster", "Mother's Day", "Secret in Their Eyes", "La Nature Parle", "The Normal Heart", "August: Osage County", "Mirror Mirror", "Larry Crowne", "Love, Wedding, Marriage", "Eat Pray Love", "Valentine's Day", "Duplicity", "Fireflies in the Garden", "Charlie Wilson's War", "Charlotte's Web", "The Ant Bully", "Dave Matthews Band: Dreamgirl", "Ocean's Twelve", "Closer", "Freedom: A History of US", "Mona Lisa Smile", "Confessions of a Dangerous Mind", "Full Frontal", "Grand Champion", "Ocean's Eleven", "America's Sweethearts", "The Mexican", "Erin Brockovich", "Runaway Bride", "Law & Order", "Notting Hill", "Stepmom", "Murphy Brown", "Conspiracy Theory", "My Best Friend's Wedding", "Everyone Says I Love You", "Michael Collins", "Mary Reilly", "Friends", "Something to Talk About", "Ready to Wear", "I Love Trouble", "The Pelican Brief", "The Player", "Hook", "Dying Young", "Sleeping with the Enemy", "Flatliners", "Pretty Woman", "Steel Magnolias", "Blood Red", "Mystic Pizza", "Miami Vice", "Baja Oklahoma", "Satisfaction", "Firehouse", "Crime Story"]}