{"name": "Anthony Bourdain", "current role": "Anthony Bourdain", "birth name": "Anthony Michael Bourdain", "birth date": "1956-06-25", "birth place": "New York City, New York, USA", "height": "6' 4\" (1.93 m)", "biography": "Anthony Bourdain was born in New York City, to Gladys (Sacksman), an NYT staff editor, and Pierre Bourdain, a Columbia Records executive. He attended The Englewood School for Boys in New Jersey and Vassar College (for two years), and was a graduate of The Culinary Institute of America. He began his career in the food industry as a dishwasher, gradually working his way up through preparation, to line cook, sous chef, and chef. He was executive chef of Manhattan's Brasserie Les Halles, which meant, in his words, that he got to \"swan around the kitchen, taking credit for others' work.\" Bourdain lived in New York City, and had a daughter Ariane, with his wife Ottavia.::Anonymous", "trade mark": "Liberal use of swear words and sexual innuendo when describing food", "trivia": ["Les Halles owner Jose Meirelles initially wanted Tony to go by the French version of his name, Antoine-Michel, much to Tony's protests.", "He studied at Vassar College, worked for some time in the seafood restaurants of Provincetown, Massachusetts, and graduated from the Culinary Institute of America before running kitchens at New York City's Supper Club, One Fifth Avenue and Sullivan's.", "His work has appeared in The New York Times, The Times, The Observer, Scotland on Sunday, The Face, Limb by Limb, Black Book, and The Independent, and he is a contributing authority for Food Arts magazine.", "He and Ottavia Bourdain welcomed their first child, a girl named Ariane Bourdain, on April 9, 2007. She weighed 7 lbs. 9 oz.", "As a guest on BBC TV's Breakfast (2000) (2 September 2010), Bourdain surprised hosts Bill Turnbull and Susanna Reid when he disclosed that his all-time favorite restaurant was the British \"St. John\" run by friend and chef Fergus Henderson in London's Smithfield district.", "Older brother of Christopher Bourdain.", "His father was of French, and some Spanish, ancestry, with family that had lived in Brazil, Uruguay, and Paraguay. Anthony's mother was of Ukrainian Jewish and Austrian Jewish descent.", "He was nominated for the 2016 New Jersey Hall of Fame in the Arts and Letters category.", "He was nominated for the 2017 New Jersey Hall of Fame in the Enterprise category.", "The place of his suicide was first misreported as Paris, then as Strasbourg, but Anthony Bourdain actually died in the small town Kaysersberg, Haut-Rhin, France. The idyllic Kaysersberg is best known as the birthplace of Nobel Peace Prize recipient Albert Schweitzer (1875-1965). The public prosecutor Christian de Rocquigny du Fayel from Colmar, France, said, that Bourdain died by hanging at the luxury hotel 'Le Chambard' in Kaysersberg [People Magazine, 2018].", "First discovered dead from suicide in his hotel room in France by celebrity French chef and close friend Eric Ripert (June 8, 2018).", "Bourdain had been in a romantic relationship with Italian actress Asia Argento at the time of his death.", "Some of the weirdest delicacies Bourdain has ever consumed include: \"Balut\" (developing feathered bird embryo boiled and eaten straight from the shell); \"Raw Seal Eyeball\" (sampled while eating with Inuits in Canada); \"Roasted Sheep's Testicles\" (consumed in a Moroccan desert); \"Bull's Penis & Testicles\"; \"Hákarl\" (heavily ammoniated fermented shark dish); \"Cobra Heart\" (sliced out of a live snake and eaten while still beating); \"Maggot Fried Rice\" (self-explanatory); \"Warthog Anus\" (the worst meal of his life, consumed with a tribe in Namibia), etc.", "He was nominated for the 2018 New Jersey Hall of Fame in the Arts and Letters category.", "Son of Gladys Bourdain."], "filmography": ["The Big Short", "Sanjay and Craig", "Archer", "The Simpsons", "Yo Gabba Gabba!", "Far Cry"]}