{"name": "Clint Eastwood", "current role": "Walt Kowalski", "birth name": "Clinton Eastwood Jr.", "birth date": "1930-05-31", "birth place": "San Francisco, California, USA", "height": "6' 4\" (1.93 m)", "biography": "Clint Eastwood was born May 31, 1930 in San Francisco, the son of Clinton Eastwood Sr., a bond salesman and later manufacturing executive for Georgia-Pacific Corporation, and Ruth Wood, a housewife turned IBM operator. He had a comfortable, middle-class upbringing in nearby Piedmont. At school Clint took interest in music and mechanics, but was an otherwise bored student; this resulted in being held back a grade. When Eastwood was 19, his parents relocated to Washington state, and young Clint spent a couple years working menial jobs in the Pacific Northwest. Returning to California in 1951, he did a stint at Fort Ord Military Reservation and later enrolled at Los Angeles City College, but dropped out after two semesters to pursue acting. During the mid-'50s he landed uncredited bit parts in such B-films as Revenge of the Creature (1955) and Tarantula (1955) while simultaneously digging swimming pools and driving a garbage truck to supplement his income. In 1958, he landed his first consequential acting role in the long-running TV show Rawhide (1959) with Eric Fleming. Though only a secondary player for the first seven seasons, Clint was promoted to series star when Fleming departed--both literally and figuratively--in its final year, along the way becoming a recognizable face to television viewers around the country.Eastwood's big-screen breakthrough came as The Man with No Name in Sergio Leone's trilogy of excellent spaghetti westerns: A Fistful of Dollars (1964), For a Few Dollars More (1965), and The Good, the Bad and the Ugly (1966). The movies were shown exclusively in Italy during their respective copyright years with Enrico Maria Salerno providing the voice for Clint's character, finally getting American distribution in 1967/68. As the last film racked up phenomenal grosses, Eastwood, 37, rose from television nonentity to sought-after box office attraction in just a matter of months. Yet again a success was the late-blooming star's first U.S.-made western, Hang 'Em High (1968). He followed that up with the lead role in Coogan's Bluff (1968) (the loose inspiration for the TV series McCloud (1970)), before playing second fiddle to Richard Burton in the World War II epic Where Eagles Dare (1968) and Lee Marvin in the bizarre musical Paint Your Wagon (1969). In Two Mules for Sister Sara (1970) and Kelly's Heroes (1970), Eastwood leaned in an experimental direction by combining tough-guy action with offbeat humor.1971 proved to be his busiest year in film. He starred as a predatory Union soldier in The Beguiled (1971) to critical acclaim, and made his directorial debut with the classic erotic thriller Play Misty for Me (1971). His role as the hard edge police inspector in Dirty Harry (1971), meanwhile, boosted him to cultural icon status and helped popularize the loose-cannon cop genre. Eastwood put out a steady stream of entertaining movies thereafter: the westerns Joe Kidd (1972), High Plains Drifter (1973) and The Outlaw Josey Wales (1976) (his first of six onscreen collaborations with then live-in love Sondra Locke), the Dirty Harry sequels Magnum Force (1973) and The Enforcer (1976), the road adventures Thunderbolt and Lightfoot (1974) and The Gauntlet (1977), and the fact-based prison film Escape from Alcatraz (1979). He branched out into the comedy genre in 1978 with Every Which Way but Loose (1978), which became the biggest hit of his career up to that time; taking inflation into account, it still is. In short, The Eiger Sanction (1975) notwithstanding, the '70s were uninterrupted success for Clint.Eastwood kicked off the '80s with Any Which Way You Can (1980), the blockbuster sequel to Every Which Way but Loose. The fourth Dirty Harry film, Sudden Impact (1983), was the highest-grossing film of the franchise and spawned his trademark catchphrase: \"Make my day.\" Clint also starred in Bronco Billy (1980), Firefox (1982), Tightrope (1984), City Heat (1984), Pale Rider (1985) and Heartbreak Ridge (1986), all of which were solid hits, with Honkytonk Man (1982) being his only commercial failure of the period. In 1988 he did his fifth and final Dirty Harry movie, The Dead Pool (1988). Although it was a success overall, it did not have the box office punch the previous films had. About this time, with outright bombs like Pink Cadillac (1989) and The Rookie (1990), it seemed Eastwood's star was declining as it never had before. He then started taking on low-key projects, directing Bird (1988), a biopic of Charlie Parker that earned him a Golden Globe, and starring in and directing White Hunter Black Heart (1990), an uneven, loose biopic of John Huston (both films had a limited release).Eastwood bounced back--big time--with his dark western Unforgiven (1992), which garnered the then 62-year-old his first ever Academy Award nomination (Best Actor), and an Oscar win for Best Director. Churning out a quick follow-up hit, he took on the secret service in In the Line of Fire (1993), then accepted second billing for the first time since 1970 in the interesting but poorly received A Perfect World (1993) with Kevin Costner. Next up was a love story, The Bridges of Madison County (1995), where Clint surprised audiences with a sensitive performance alongside none other than Meryl Streep. But it soon became apparent he was going backwards after his brief revival. Subsequent films were credible, but nothing really stuck out. Absolute Power (1997) and Space Cowboys (2000) did well enough, while True Crime (1999) and Blood Work (2002) were received badly, as was Midnight in the Garden of Good and Evil (1997), which he directed but didn't appear in.Eastwood surprised yet again in the mid-'00s, returning to the top of the A-list with Million Dollar Baby (2004). Also starring Hilary Swank and Morgan Freeman, the hugely successful drama won four Academy Awards, including Best Picture and Best Director for Clint. He scored his second Best Actor nomination, too. Eastwood's next starring vehicle, Gran Torino (2008), earned almost $30 million in its opening weekend and was his highest grosser unadjusted for inflation. 2012 saw him in a rare lighthearted movie, Trouble with the Curve (2012), as well as a reality show, Mrs. Eastwood & Company (2012). And between screen appearances, Clint chalked up a long and impressive list of credits behind the camera. He directed Mystic River (2003) (in which Sean Penn and Tim Robbins gave Oscar-winning performances), Flags of Our Fathers (2006), Letters from Iwo Jima (2006) (nominated for the Best Picture Oscar), Changeling (2008) (a vehicle for screen megastar Angelina Jolie), Invictus (2009) (again with Freeman), Hereafter (2010), J. Edgar (2011), Jersey Boys (2014), American Sniper (2014) (2014's top box office champ), Sully (2016) (starring Tom Hanks as hero pilot Chesley Sullenberger) and The 15:17 to Paris (2018). His latest project, in which he stars as an unlikely drug courier, is The Mule (2018), and after that he directed Richard Jewell (2019).Outside of work, Eastwood has led a hysterically convoluted existence and is described by biographer Patrick McGilligan as a cunning manipulator of the media. His large number of partners and children are now reported matter-of-factually, but for the first three decades of his celebrity, his personal life was kept top secret, and several of his families were left out of the official narrative. The Hollywood kingpin refuses to disclose his exact number of offspring even to this day. He had a long time relationship with equally enigmatic co-star Locke (deceased 2018), and has fathered at least eight children by at least six different women in an unending string of liaisons, many of which overlapped. He has been married only twice, however -- with a mere three of his progeny coming from those unions.Eastwood has real estate holdings in Bel-Air, Carmel-by-the-Sea, Burney (in northern California), Idaho's Sun Valley and Kihei, Hawaii.::Scott- msa0510@mail.ecu.edu", "trade mark": "During the credits at the end of his movies, the camera will move around the location it was filmed in, after which there will be freezeframe for the rest of the credits.", "trivia": ["Lived with Sondra Locke from 1975 to 1989.", "Owns the Mission Ranch hotel & restaurant in Carmel, Calif., the exclusive Tehama golf club in Carmel Valley, and is partial owner of the Pebble Beach Golf Country Club in nearby Monterey Peninsula.", "Received an honorary Cesar award in Paris, France for his body of work. [February 1998]", "Ranked #2 in Empire (UK) magazine's \"The Top 100 Movie Stars of All Time\" list. [October 1997]", "Gained popularity with his first three major films, A Fistful of Dollars (1964), For a Few Dollars More (1965) and The Good, the Bad and the Ugly (1966) (which weren't released in America until 1967/68). Soon afterwards Jolly Films (which produced A Fistful of Dollars (1964)) came out with a film called \"The Magnificent Stranger\", which was actually two episodes of Rawhide (1959) edited together. Eastwood sued and the film was withdrawn.", "He wore the same sarape, without ever having washed it, in all three of his \"Man with No Name\" Westerns.", "Elected mayor of Carmel-by-the-Sea, California. It has often been claimed that Eastwood ran for office as a Republican. In fact, although he was registered as a Republican in California, the position of mayor is non-partisan. [April 1986]", "Was apparently such an organized director that he finished Absolute Power (1997) days ahead of schedule.", "Got his role in Rawhide (1959) while visiting a friend at the CBS lot when a studio exec spotted him because he \"looked like a cowboy.\"", "In 1951 and 1952, he was a lifeguard and projectionist of training films for the U.S. Army, stationed at Fort Ord in Marina, California. According to former buddy Don Loomis, as told in \"Clint: The Life and Legend\" (2002) by Patrick McGilligan, page 49, Eastwood avoided being sent to combat in Korea by romancing one of the daughters of a Fort Ord officer, who might have been entreated to watch out for him when names came up for postings.", "Has at least eight children by at least six different women: Laurie Alison Murray (b. February 11, 1954) who was given up for adoption by her biological mother; Kimber Eastwood (b. June 17, 1964) with Roxanne Tunis; Kyle Eastwood (b. May 19, 1968) and Alison Eastwood (b. May 22, 1972) with Maggie Johnson; Scott Eastwood (b. March 21, 1986) and Kathryn Eastwood (b. February 2, 1988) with Jacelyn Reeves; Francesca Eastwood (b. August 7, 1993) with Frances Fisher; Morgan Eastwood (b. December 12, 1996) with Dina Eastwood.", "It's interesting, given his penchant towards violence, that his name, Clint Eastwood, is an anagram for 'old west action'.", "His name is used as the title of the hit Gorillaz song and video \"Clint Eastwood\" (2001).", "Mentioned in the theme song of the 1980s TV hit The Fall Guy (1981).", "Until his pride was displaced by discovery of a larger version of same tree in 2002, Eastwood used to be proud owner of tree believed to be the nation's largest known hardwood - a bluegum eucalyptus.", "Sworn in as parks commissioner for state of California at Big Basin Redwood Park, Santa Cruz, 8 June 2002. Holding up his new commissioner's badge, he told the crowd, \"You're all under arrest.\".", "2000 recipient of John F. Kennedy Center Honors.", "Received the Career Golden Lion at the Venice Film Festival. [August 2000]", "Of English, Scottish, Irish, and smaller amounts of German, Dutch, and Welsh, ancestry.", "His character's voice was provided by Enrico Maria Salerno in A Fistful of Dollars (1964), For a Few Dollars More (1965) and The Good, the Bad and the Ugly (1966). For the trilogy's American release, Eastwood redubbed his dialogue in English.", "When he directs, he insists that his actors wear as little makeup as possible and he likes to print first takes. As a result, his films consistently finish on schedule and on budget.", "When directing, he simply says \"okay\" instead of \"action\" and \"cut.\" (source: Shootout (2003)).", "Weighed 11 lbs 6 oz at birth.", "His production company is Malpaso Productions, which he formed in 1968. The company's first feature release was Hang 'Em High (1968).", "Mentioned on T.G. Sheppard's hit single \"Make My Day,\" which in the first half of 1984 reached #12 on Billboard's Hot Country Singles chart and also reached #62 on that magazine's Hot 100 singles survey.", "When Don Siegel fell ill during production of Dirty Harry (1971), Eastwood stepped in as director during the attempted-suicide/jumper sequence.", "Ex-wife Dina Ruiz (Dina Eastwood) is a former local television news anchor/reporter from Salinas, California. They met when she was assigned to interview him for KSBW-TV in April 1993. Dina admitted that she'd seen \"zero\" of his movies. The pair didn't start dating right away since Clint was expecting a baby with Frances Fisher. In February 1995, Clint made his first public appearance with Dina at a golf tournament, without ever announcing that he and Frances had broken up.", "Is 35 years older than ex-wife Dina Eastwood. Dina's parents were 19 and 21 when she was born. This makes Clint 16 years older than his former mother-in-law and 14 years older than his former father-in-law.", "Ex-brother-in-law of Dominic V. Ruiz & Jade Marx-Berti.", "He got involved in an illicit relationship with Roxanne Tunis in 1959 during the second season of Rawhide (1959). Tunis was a regular extra/stuntwoman on the show. Their daughter Kimber Eastwood was born in 1964 as Kimber Tunis. Following Kimber's birth, Eastwood asked Maggie Johnson for a divorce. But within a matter of weeks afterward, Johnson fell very ill with hepatitis and had to be hospitalized. Eastwood and Johnson reconciled, mutually understanding that it would be best if she turned a blind eye to his existing families (he also had a child in 1954 from a different affair), and in 1968, almost 15 years after they married, their first child together was born. Johnson was finally introduced to Tunis in 1972, outside Eastwood's presence, by a crew member on the set of Breezy (1973). The affair between Eastwood and Tunis is believed to have dissolved in the mid-seventies, around the time he and Sondra Locke got together. Tunis later appeared as an extra in Every Which Way but Loose (1978) as a member of the audience at LA's Palomino country-western club where Locke's character sings, but Eastwood didn't tell Locke about Kimber until 1983. She thought it was cruel that he admitted he was Kimber's father but never treated her accordingly.", "Eastwood's two children from liaisons with Jacelyn Reeves were given their mother's last name. No father is listed on either of their birth certificates.", "He has always disliked the reading of political and social agendas in his films, which has occurred from Dirty Harry (1971) to Million Dollar Baby (2004). He has always maintained that all of his films are apolitical and what he has in mind when making a film is whether it's going to be entertaining and compelling.", "Has been named to Quigley Publications' annual Top 10 Poll of Money-Making Stars 21 times, making him #2 all-time for appearances in the top 10 list. Only John Wayne, with 25 appearances in the Top 10, has more. Eastwood, who first appeared in the Top Ten at #5 in 1968, finished #2 to Wayne at the box office in 1971 after finishing #2 to Paul Newman in 1970. After his first two consecutive #1 appearances in 1972 and 1973, he dropped back to #2 in 1974, trailing Robert Redford at the box office. Clint was again #2 in 1979, 1981 and 1982 (topped by Burt Reynolds all three years), before leading the charts in 1983 and '84. He last topped the poll in 1993.", "Was named the top box-office star of 1972 and again in 1973 by the Motion Picture Herald, based on an annual poll of exhibitors as to the drawing power of movie stars at the box-office, conducted by Quigley Publications.", "He was the only nominee for the Best Actor Oscar in 2004 (for Million Dollar Baby (2004)) to play a fictitious character. All four other nominees portrayed real people in their respective films.", "A sample of his whistling can be heard on the track \"Big Noise\" from his son Kyle Eastwood's jazz CD \"Paris Blue\" (2004).", "At The 45th Annual Academy Awards (1973), he presented the 1972 Best Picture Oscar to Albert S. Ruddy, the producer of The Godfather (1972). Thirty-two years later they would jointly accept the 2004 Best Picture Oscar at the The 77th Annual Academy Awards (2005), along with fellow Million Dollar Baby (2004) co-producer Tom Rosenberg.", "At The 72nd Annual Academy Awards (2000) he presented the Best Picture statuette to American Beauty (1999).", "Was named the #1 top money-making star at the box office in Quigley Publications' annual poll of movie exhibitors five times between 1972 and 1993. Bing Crosby, Burt Reynolds and Tom Hanks also have been named #1 five times, while Tom Cruise holds the record for being named #1 six times.", "Stacy McLaughlin filed a $100,000 lawsuit against Eastwood in May 1989 for \"knowingly, intentionally and deliberately\" ramming her Nissan Maxima with his quarter-ton pickup at the Burbank Studios on Dec. 16, 1988, when she mistakenly parked in his parking space while dropping off a tape at his Malpaso Productions office. Eastwood, who contended he was only trying to park his vehicle in its rightful space, paid $960 to repair the headlights and bumper of McLaughlin's car. She sought the additional money as punitive damages, claiming malice on Eastwood's part. The case went to court in July 1991, but a judge refused to grant the damages.", "At age 74, he became the oldest person to win the Best Director Oscar for Million Dollar Baby (2004).", "He directed 12 different actors in Oscar-nominated performances: Gene Hackman, Meryl Streep, Sean Penn, Tim Robbins, Marcia Gay Harden, Hilary Swank, Morgan Freeman, Angelina Jolie, Matt Damon, Bradley Cooper, Kathy Bates, and himself (in Unforgiven (1992) and Million Dollar Baby (2004)). Hackman, Penn, Robbins, Freeman and Swank won Oscars for their performances in one of Eastwood's movies.", "For two consecutive years he directed two out of the four actors who won Oscars for their performances: Sean Penn (Best Actor) and Tim Robbins (Best Supporting Actor) in Mystic River (2003)) in 2004, and Hilary Swank (Best Actress) and Morgan Freeman (Best Supporting Actor) for Million Dollar Baby (2004)) in 2005.", "Received an honorary Doctorate from Wesleyan University in Connecticut. Wesleyan is also home to his personal archives. [2000]", "Every year the PGA tour comes to Pebble Beach, Ca., to host a celebrity golf tournament where celebrities team up with the professionals. Clint participated in this every year from 1962-2002 and is the longest running participant. He now serves as Host.", "In early 2005 he announced that he would supply the voice for a \"Dirty Harry\" video game. However, the game ended up getting canceled in 2007.", "Premiere Magazine ranked him as #43 on a list of the Greatest Movie Stars of All Time in their Stars in Our Constellation feature. [2005]", "Favorite actor is James Cagney.", "Some of his favorite movies are The 39 Steps (1935), How Green Was My Valley (1941), Sergeant York (1941), The Ox-Bow Incident (1942) and Chariots of Fire (1981).", "Some of his favorite actors are Gary Cooper, Humphrey Bogart, Robert Mitchum and James Stewart.", "Became so fond of British pubs and beer during his time in London filming Where Eagles Dare (1968) that he opened the Hog's Breath Inn with co-founders Paul E. Lippman and Walter Becker in 1972. According to Lippman, \"I had to terminate three pretty good waitresses in the first few months of operation; not because they went to bed with Clint Eastwood, but because they either talked about it all over the premises, or came in the next day acting like they owned the place.\" The restaurant closed in 1999 and has since re-opened under new management.", "Has his look-alike puppet in the French show Les Guignols de l'info (1988).", "He stood at 6'4\" at his peak, but due to recent back problems, he can only stretch up to 6'2\".", "He, Warren Beatty, Robert Redford, Mel Gibson, Richard Attenborough and Kevin Costner are the only directors best known as actors who have won an Academy Award as Best Director.", "President of jury at the Cannes Film Festival. [1994]", "Claimed that the trait he most despised in others was racism.", "The boots that he wore in Unforgiven (1992) are the same ones he wore in the TV series Rawhide (1959). They are now a part of his private collection and were on loan to the 2005 Sergio Leone exhibit at the Gene Autry Museum of Western Heritage in Los Angeles. In essence these boots have book-ended his career in the Western genre.", "Made six movies with former partner Sondra Locke: The Outlaw Josey Wales (1976), The Gauntlet (1977), Every Which Way but Loose (1978), Bronco Billy (1980), Any Which Way You Can (1980) and Sudden Impact (1983).", "As a director, he has always refused to test screen his films before their release.", "He objected to the end of Dirty Harry (1971) when Harry throws his badge away after killing the Scorpio Killer, arguing with director Don Siegel that Harry knew that being a policeman was the only work for which he was suited. Siegel eventually convinced Eastwood that Harry threw his badge away as a symbol that he had lost faith in the justice system.", "He was a contract player at Universal International in the mid-1950s. He and a younger actor named Burt Reynolds were released from their contracts and left the studio on the same day. They were both fired by the same director. Eastwood was fired when the director didn't want to use him in a movie because of the wart above his top lip. Reynolds, who was serving as a stunt man, was fired after he shoved the director into a water tank during an argument over how to do a stunt fall.", "At the 2005 National Board of Review awards dinner in New York City, Eastwood joked that he would kill filmmaker Michael Moore if Moore ever showed up at his home with a camera (an evident reference to Moore's controversial interview with actor/Second Amendment advocate Charlton Heston, for Bowling for Columbine (2002)). After the crowd laughed, Eastwood said, \"I mean it.\" Moore's spokesman said, \"Michael laughed along with everyone else, and took Mr. Eastwood's comments in the lighthearted spirit in which they were given.\" Publicly, Eastwood has not commented further.", "Took acting class from Michael Chekhov in Hollywood.", "In 1972 Eastwood attended President Richard Nixon's landslide victory celebration in Los Angeles, along with John Wayne, Charlton Heston and Glenn Ford.", "Was appointed to serve on the National Council of the Arts by President Nixon in 1972.", "Has ruled out the possibility of playing Dirty Harry again, saying he has \"outgrown him age-wise.\"", "His performance as \"Dirty\" Harry Callahan in Dirty Harry (1971) is ranked #92 on Premiere Magazine's 100 Greatest Performances of All Time.", "At a press conference for his movie Mystic River (2003), Eastwood condemned the Iraq war as a \"big mistake\" and defended Sean Penn's visit to Baghdad, saying he might have done the same thing but for his age.", "Eastwood declined an offer from President George Bush to campaign for him in the 1992 Presidential election. He told an interviewer the next year, \"I think what the ultra-right wing conservatives did to the Republicans is really self-destructive, absolutely stupid.\".", "His performance as Blondie in The Good, the Bad and the Ugly (1966) is ranked #50 on Premiere Magazine's 100 Greatest Movie Characters of All Time.", "His performance as \"Dirty\" Harry Callahan in Dirty Harry (1971) is ranked #42 on Premiere Magazine's 100 Greatest Movie Characters of All Time.", "Ended his longstanding friendship with onetime neighbor William R. Thompkins in 1964.", "He claims that he wound up getting the role in Sergio Leone's A Fistful of Dollars (1964) because James Coburn, to whom the role was originally offered, wanted $25,000. Eastwood accepted the role for $15,000.", "Was offered Al Pacino's role in Any Given Sunday (1999), but turned it down because Warner Bros. wouldn't let him direct it also.", "Is a patron of the arts, notably as an avid collector of western art.", "Presented the Golden Globe Award for Best Director to Ang Lee for Brokeback Mountain (2005).", "His \"Fistful\" mannerisms was imitated in Canada, by the Tim Horton's restaurant chain, to promote the 2005 Southwest chicken sub.", "Claims to have been an early choice for the title role in Superman (1978).", "Whenever asked if he would do a Dirty Harry 6, he often joked that he can imagine Dirty Harry now long retired, and fly-fishing with his .44 magnum.", "Cited as America's Favorite Movie Star by the Harris Polls conducted in 1993, 1994 and 1997. Tom Hanks and Harrison Ford are the only other actors to be cited as the #1 Movie Star as many times.", "He is \"Chevalier de la Légion d'Honneur\", a high French distinction that has been conferred on him by President Jacques Chirac on February 17, 2007, as a tribute to his career as an actor and a filmmaker.", "Voted for Arnold Schwarzenegger as Governor of California in 2003 and 2006.", "Son of Ruth Wood.", "In 1969 he attended a celebration of John Wayne's 40-year career at Paramount Pictures, along with Lee Marvin, Rock Hudson, Fred MacMurray, James Stewart, Ernest Borgnine, Michael Caine and Laurence Harvey.", "Had to fill in for Charlton Heston at The 44th Annual Academy Awards (1972) until Heston arrived.", "Was offered Gregory Peck's role in Mackenna's Gold (1969), but turned it down to make Hang 'Em High (1968) instead.", "The producers of Dirty Harry (1971) originally didn't want Eastwood, since they felt he was too young at 41. After older stars like John Wayne, Frank Sinatra and Robert Mitchum turned the film down, Eastwood was cast. He last played Harry Callahan aged 58 in The Dead Pool (1988), which was only a year older than the character was supposed to be in the first film according to the original screenplay.", "William Friedkin offered him the lead in Sorcerer (1977), but Eastwood didn't want to travel anywhere at that time. Jack Nicholson turned the film down for the same reason.", "Mentioned in theme song in The Adventures of George the Projectionist (2006).", "Received an honorary Doctor of Humane Letters from the University of Southern California. [May 2007]", "Learned mountain climbing for The Eiger Sanction (1975) because he felt the scenes were too dangerous for him to pay a stuntman to do for him. He was the last climber up The Totem Pole in Monument Valley, and as part of the contract, the movie crew removed the pitons left by decades of other climbers. The scene where he was hanging off the mountain by a single rope was actually Eastwood, and not a stuntman.", "An accomplished jazz pianist, he performs much of the music for his movies, including the scene in the bar in In the Line of Fire (1993).", "California Gov. Arnold Schwarzenegger and First Lady Maria Shriver inducted Eastwood into the California Hall of Fame located at The California Museum for History, Women, and the Arts. [December 2006]", "Along with John Travolta and Tom Selleck, he attended the formal state dinner at the White House held by President Ronald Reagan to welcome Prince Charles and Princess Diana to the United States in 1985.", "In the late 1980s he discussed remaking the classic Sam Peckinpah western Ride the High Country (1962) with Charlton Heston.", "He was made a Fellow of the British Film Institute in recognition of his outstanding contribution to film culture.", "William Goldman said of Eastwood that he was the only person to be a star in the '70s, '80s and '90s. By \"star\" Goldman means Variety's list of top ten actors of the decade.", "Former longtime companion Sondra Locke blasted Eastwood in her autobiography \"The Good, the Bad & the Very Ugly: A Hollywood Journey\" (1997). Locke described Eastwood as \"a monster who thought nothing of destroying anything inconvenient to him\" and likened the actor to O.J. Simpson. \"Others who knew Clint said that I had been 'far too kind' to him,\" she said of this evisceration. (Neither Eastwood or his publicist, Joe Hyams, would comment.) Locke reiterated previous testimony that Eastwood had manipulated her into having two abortions and sterilizing herself in the 1970s and that he sabotaged her directorial career after their 1989 split. But she also made a new allegation that he sired another woman's two children during the last three years of their relationship. The allegation of secret children was not even acknowledged by mainstream media, despite the fact that Locke's book exposed the kids' names and exact birth dates. Published reviews misrepresented the book by omitting its serious accusations and emphasizing trivial tidbits instead. (One anecdote widely printed in lieu of anything relevant was Eastwood's habit of asking \"Sweetie, did you floss?\" before they made love.) Locke learned of Eastwood's double life, she wrote, when an investigative journalist phoned her during depositions in the palimony case. The extraordinary revelation -- that Eastwood had a hidden family in Carmel, residing in a house under his business manager Roy Kaufman's name -- was confirmed in closed court after Locke filed a motion to discover and Eastwood's will was called in for evidence, with the document showing one Jacelyn Reeves and Reeves' legally fatherless son and daughter listed as beneficiaries.", "In April 1989, Sondra Locke filed a $70 million palimony lawsuit against Clint, after he changed the locks on their Bel-Air home and moved her possessions into storage while she was away directing Impulse (1990). The relationship had been on the rocks for months, with Clint leaving nonverbal hints that he wanted Sondra to get out of his life voluntarily (once, while she was still in the shower, he left to go to a party to which they'd both been invited), but they weren't officially broken up. During the 15 days between the lockout and Sondra filing suit, she tried to resolve things quietly, but Clint offered her nothing and would only communicate via lawyers. (To Sondra, an equal division of assets was principle rather than greed. She actually saved up $3 million over the course of her 14-year relationship with Clint because he was paying all their expenses.) Clint refused to say Sondra's name out loud at his depositions, reducing her to pronouns or alternately referring to her as \"the person.\" He also never made eye contact or any reference to her proximity in the courtroom. Sondra said the stress of the ordeal induced breast cancer, requiring mastectomies. In November 1990, 19 months into proceedings, she arranged to meet with Clint in private and achieved an immediate settlement. Sondra received $450,000 lump sum plus monthly support payments, title to a house in West Hollywood that Clint was leasing to her lawful wedded but openly gay husband Gordon Anderson, and a $1.5 million multi-year contract with Warner Bros. to develop and direct films. By the end of 1993, however, the studio had yet to provide Sondra with a single directorial assignment and rejected over 30 projects that she submitted. Sondra became convinced that the deal was a sham and that she was employed only on paper. \"I was stunned and outraged at the way I had been tricked and cheated\" she said. (Her attorney, Peggy Garrity, would later claim Clint held out the Warner deal like a \"dangled carrot\" to get her to drop the palimony suit.) Sondra sued Clint again for fraud in June 1995, having unearthed a bookkeeping printout to corroborate the charge. She asserted that the money WB pretended they were paying her came from Clint's own pocket and was laundered through the operating budget for Unforgiven (1992). The case went to trial in September 1996, with one juror disclosing that the panel agreed to find for Sondra by a 10-to-2 vote (nine votes are needed for a verdict) and were only debating the amount. Clint's legal team convinced him to settle at the eleventh hour, and on the morning jurors were set to begin a second day of deliberation, Sondra announced her decision to drop her suit against Clint in return for an unspecified monetary reward. As Clint walked down the courthouse steps, he told a bank of cameras, \"What does this say to young women across the country who work very hard for a living?\" (A nonsensical remark, since the case he had just lost was all about work--work he obstructed his ex-soulmate from doing.) Sondra then brought a separate action against Warner Brothers, seeking $100 million in damages for conspiring with Clint to ruin her career. It was settled out of court in May 1999, ending the decade-long legal saga. While she was bound by confidentiality not to reveal the amount, Locke wasn't shy about disclosing her feelings. \"I feel elated. This has been the best day in a long, long time\" she told reporters.", "Though he often smokes in his movies, he is a lifelong non-smoker offscreen.", "Although he can handle pistols with either hand equally well, he is left-eye dominant, evident when he shoots a rifle as in Joe Kidd (1972) or Unforgiven (1992), but is right handed, as seen when he wears or handles one pistol.", "He and Burt Reynolds had major influences on each other's careers. It was he who sent a copy of \"Sharky's Machine\" to Reynolds, which gave Reynolds the idea to turn the novel into a movie, Sharky's Machine (1981), which went on to garner excellent reviews. On the other hand, it was Reynolds who sent Clint a copy of \"The Outlaw Josey Wales\", later made into a film by Eastwood (The Outlaw Josey Wales (1976)). Years later, Reynolds told him about \"this great novel\" called \"The Bridges of Madison County\", and some time later it was shot by Eastwood (The Bridges of Madison County (1995)).", "Served as mayor of Carmel-by-the-Sea, CA for one term for the nominal salary of $300. A small contingent insisted that Eastwood was a spoiled brat mayor and the town acted just like an indulgent parent. \"We wanted to eliminate traffic and parking problems, not make more with hordes of tourists. He brought a lot of notoriety that we didn't need,\" said Jane Mayer, president of the Carmel Residents Association. \"Some people thought he was charming, but I disagree. He didn't know anything about the issues. People are giving him credit for things that were on the table for years. He also hired a public relations woman and kept an unlisted phone number - he was totally inaccessible. I don't think that's being a good mayor.\" \"It was a disaster,\" added former mayor Gunnar Norberg. \"Eastwood turned a peaceful forest by the sea into Coney Island.\" Norberg claimed his blood pressure hit such heights when he was around Eastwood that his doctor refused to let him attend council meetings. Sondra Locke, Eastwood's cohabiting partner at the time, later acknowledged she \"knew he wasn't the dedicated mayor he pretended to be.\".", "Turned down the role of Captain Willard in Apocalypse Now (1979) because he found the storyline \"too dark.\" The role went to Martin Sheen.", "Was offered the role of James Bond in Live and Let Die (1973). He was flattered, but declined, saying that Bond should be played by an English actor.", "Has a younger sister named Jeanne Bernhardt (b. 1934) and two nieces, Anna (b. 1958) and Celia (b. 1961).", "Owns a hillside mansion in Sun Valley, Idaho and a beachfront estate in Maui.", "Notable women Eastwood had affairs with include actresses Mamie Van Doren, Inger Stevens, Jean Seberg, Jo Ann Harris, Jamie Rose, Rebecca Perle, Jill Banner, Catherine Deneuve and Susan Saint James; competitive swimmer Anita Lhoest; singer Keely Smith; restaurant critic Gael Greene; columnist Bridget Byrne; French model Cathy Reghin; WB story analyst Megan Rose; wildlife activist Jane Cameron Agee; and former Carmel mayor Jean Grace. Generally, however, Eastwood preferred unknown women he would not later accidentally meet. In his early 40s, he developed a habit of picking up young ladies from the Carmel tourist shops for encounters in his truck, usually parking it on Dolores Street.", "Practices transcendental meditation twice a day, and said in 2013 that he has been meditating for the past 40 years.", "Father was Clinton Eastwood Sr. (1906-1970), an executive at Georgia Pacific LLC, a pulp and paper manufacturing company. Stepfather, after his widowed mother remarried in 1972, was John Belden Wood (1913-2004), a lumber executive.", "Considered for the role of Rambo in First Blood (1982) long before Sylvester Stallone was hired.", "He was awarded the American National Medal of the Arts on February 25, 2010 for his services and contributions to the arts.", "Profiled in \"Directors Close Up\" by Jeremy Kagan. [2005]", "Declined to have a party for his 80th birthday, explaining that at his age he doesn't like birthday parties for himself. He said his only plans to celebrate the occasion would be to go out for a drink with his wife.", "The genesis of his production company, Malpaso Productions, had a curious origin. When Italian director Sergio Leone approached Eastwood about appearing in what would become the \"Spaghetti Western\" trilogy--A Fistful of Dollars (1964), For a Few Dollars More (1965) and The Good, the Bad and the Ugly (1966)--Eastwood was eager to take it but was advised against it by his agent, suggesting it would be a \"bad move\" (mal paso). Against all advice, the actor went ahead and accepted the \"man with no name\" role and his decision turned out to be a \"good move\". Eastwood never forgot the irony of the situation and adopted \"Malpaso\" as his production company name.", "Turned down the role of Harmonica in Once Upon a Time in the West (1968), which went to Charles Bronson.", "Sergio Leone asked him and his The Good, the Bad and the Ugly (1966) co-stars Eli Wallach and Lee Van Cleef to appear in Once Upon a Time in the West (1968). The idea was reportedly scrapped due to scheduling conflicts with other films, although some rumors state they declined when they heard that their characters were going to be killed off by Charles Bronson's character in the first five minutes. Leone filmed the scene instead with character actors Woody Strode, Jack Elam and Al Mulock.", "Attended Glenview Elementary School, Crocker Highlands Elementary School and Frank C. Havens Elementary School, all located within a short distance of each other in Oakland and Piedmont. He was held back due to poor academic scores, but in at least one case, delinquent behavior was the reason he left one school to enroll in another. He went to Piedmont Junior High and attended Piedmont High School from January 1945 to at least January 1946. Eastwood was asked to leave Piedmont High for writing an obscene suggestion to a school official on the athletic field scoreboard, and burying someone in effigy on the school lawn, on top of other school infractions. He transferred to Oakland Technical High School, scheduled to graduate in January 1949 as a midyear graduate, although it is not clear if he ever did.", "Served as President of the Cannes Jury when Pulp Fiction (1994) won but the film was not his personal choice: \"On the jury here when 'Pulp Fiction' won, somebody said, 'Oh, Clint Eastwood was on the jury, so he voted for the American film.' But my sensibilities are European, here is where my success started. Actually, Yimou Zhang's To Live (1994) was my favorite piece, but most of the European jurors seemed to like 'Pulp Fiction.'\".", "Five of his movies were nominated for AFI's 100 Years...100 Movies: Dirty Harry (1971), The Outlaw Josey Wales (1976), Unforgiven (1992), Mystic River (2003) and Million Dollar Baby (2004). \"Unforgiven\" made the list at #68, 30 places up from its original rank at #98.", "Turned down Paul Newman's role in The Towering Inferno (1974).", "Paul Haggis, who wrote the screenplay for Million Dollar Baby (2004), offered Eastwood the role of Hank Deerfiled in In the Valley of Elah (2007). Eastwood turned it down and recommended Tommy Lee Jones, who went on to receive a Best Actor Oscar nomination for his performance.", "He was going to play the villain Two-Face on the Batman (1966) TV series, but the show was canceled before the episode began shooting.", "Although he has been associated with violence throughout his career, he personally detests it and has carefully shown the horrific consequences of violence in films such as Unforgiven (1992), A Perfect World (1993), Absolute Power (1997), Mystic River (2003), Million Dollar Baby (2004) and Gran Torino (2008).", "According to Robert Daley, the head of Warner Bros. when Eastwood made 15 pictures there, none of those films ever included preview screenings because Clint \"doesn't believe in the preview process\".", "He and Warren Beatty are the only actor-directors to earn Best Actor and Best Director Oscar nominations for the same film two times.", "His signature character, \"The Man With No Name\", is portrayed by Timothy Olyphant as \"The Spirit of the West\" in Rango (2011).", "A former logger, steel furnace stoker and gas station attendant before becoming an actor.", "Directed two films concurrently in 1973; High Plains Drifter (1973) and Breezy (1973).", "Cinematographer Bruce Surtees and actor Geoffrey Lewis are regulars in Eastwood films (he's directed).", "Father-in-law of Stacy Poitras and Shawn Midkiff.", "In Cape Town, South Africa, filming Invictus (2009). [March 2009]", "Attending Cannes premiere of latest film Changeling (2008), a period thriller set in the 1920s. [May 2008]", "The character Shane Gooseman (\"Goose\" for short) from the animated space opera The Adventures of the Galaxy Rangers (1986) was based on him and his screen persona.", "A guest speaker at the 2012 Republican National Convention, Eastwood spent much of his speech time on a largely improvised routine addressing an empty chair representing President Barack Obama. It generated many responses and a lot of discussion. Old flame Frances Fisher wrote a condemning post on Facebook and insinuated that Eastwood's appearance was a publicity stunt to get more tickets sold for his new movie Trouble with the Curve (2012), adding \"I've seen this act before. And I didn't buy it. Crazy like a fox. I saw the same act sitting with therapists, mediators and lawyers. [...] Even though I am certainly not a Republican, I felt bad for the people who thought this was a good idea.\" Several commentators including Bill Maher sidetracked to point out the hypocrisy of Eastwood's mere presence at the gathering, since his inordinately adventurous love life antithesizes the \"family values\" advocated by Presidential nominee Mitt Romney on the same stage that evening.", "Has played the same character in more than one film three times: The Man with No Name in the Leone trilogy, Philo Beddoe in the Any Which Way movies and Harry Callahan in the Dirty Harry franchise.", "He appeared in and directed two Best Picture Academy Award winners: Unforgiven (1992) and Million Dollar Baby (2004). Morgan Freeman also appeared in both films.", "Had planned to star in Die Hard (1988) and originally owned the rights to the novel \"Nothing Lasts Forever\" on which the film is based, but opted to make The Dead Pool (1988) instead.", "Ranked #19 in Forbes magazine's list of the world's 40 best-paid entertainers, with estimated earnings of $44 million in 1995 and 1996. [September 1996]", "Along with Orson Welles, Laurence Olivier, Woody Allen, Warren Beatty, Kenneth Branagh and Roberto Benigni, he is one of only seven men to receive Academy Award nominations for both Best Actor and Best Director for the same film: Welles for Citizen Kane (1941), Olivier for Hamlet (1948), Allen for Annie Hall (1977), Beatty for both Heaven Can Wait (1978) and Reds (1981), Branagh for Henry V (1989), Eastwood for Unforgiven (1992) and Benigni for Life Is Beautiful (1997).", "Ex-significant other Sondra Locke was legally married to homosexual Gordon Anderson from 1967 until her death in 2018, covering the whole time she and Eastwood were living together. While house hunting with Locke in the late seventies, Eastwood introduced himself as \"Mr. Anderson,\" even when he happened to be wearing a Thunderbolt and Lightfoot (1974) T-shirt. Locke recalled that the sales agents could barely keep a straight face and always looked at their feet when addressing him as such.", "Biography in: John Wakeman, editor. \"World Film Directors, Volume Two, 1945- 1985\". Pages 294-302. New York: The H.W. Wilson Company, 1988.", "Early in his career he appeared in a \"B\" western, Ambush at Cimarron Pass (1958), in which he was billed third and leading lady Margia Dean was billed second. Years later, after Eastwood had become a superstar actor and director, Dean ran into him at a social function and teased him, \"Just remember, I got top billing over you\".", "Went through a brief period in Hollywood sitting for hours on a Schwab's drugstore stool in a tight sweater waiting to be \"discovered\" à la Lana Turner.", "Has a grandson born in February 1984 named Clinton Eastwood Gaddie (aka Clinton McCartney) from his illegitimate daughter Kimber Tunis (Kimber Eastwood). Clint and Roxanne Tunis are great-grandparents via Kimber's son, to great-grandson Clinton IV (born 2011) and great-granddaughter Penelope McCartney (born 2018). Their existences have never been acknowledged in the press.", "Clint and former spouse Maggie Johnson were estranged for at least nine years and legally separated for six before she filed for divorce in May 1984 (it was finalized that November). Johnson had finally decided to make the split official so she could marry Henry Wynberg, a used car salesman slightly younger than herself. The Johnson-Wynberg union ended in 1989 after four years, and in 1992 Wynberg, then 58, married a 19-year-old Costa Rican woman.", "Couples in his social circle used to include Merv Griffin & Eva Gabor, Bud Yorkin & Cynthia Sikes, Richard D. Zanuck & Lili Fini Zanuck, Arnold Schwarzenegger & Maria Shriver.", "Had a falling out with longtime associate Fritz Manes during the filming of Heartbreak Ridge (1986). Manes was fired over the telephone by Eastwood's secretary. When Manes went over to Malpaso to collect his belongings, the locks on his office had been changed and his possessions were sitting outside next to a dumpster.", "Landed his breakthrough role in A Fistful of Dollars (1964) after Charles Bronson, Rory Calhoun, James Coburn, Henry Fonda, Ty Hardin, Steve Reeves, Tony Russel and Henry Silva all turned it down.", "Wanted to direct Angels & Demons (2009), but didn't get the chance because Ron Howard was contractually obligated to direct it because of his contract from The Da Vinci Code (2006).", "Once said that his wide hips were his only physical flaw, except for the chipped tooth he eventually had fixed.", "Hired a private detective in the early 1980s when his company, Malpaso Productions, began to receive a series of strange, threatening letters addressed to him mailed from various California locations by someone who seemed to have inside knowledge of his life. The trouble was, the detective had an extremely long list of possible Clint enemies and ex-girlfriends but no real clues as to who might be the culprit. After a while suspicion focused on Jane Cameron Agee, an off-and-on paramour of Eastwood's then married to actor James Brolin. Eastwood scoffed at the idea it was her and thought it might be an actress friend of ex-mistress Roxanne Tunis, seeking some kind of revenge on him. One night he drove around the Hollywood Hills with Fritz Manes trying to find this woman's address. He tried to convince Manes that they should burgle her place, and see if the lady's typewriter matched up with the letters. Manes said no, and the vile letters eventually waxed and waned.", "When he was 19, he gained unwanted attention from a 23-year-old schoolteacher who stalked him after a one-night stand and threatened to kill herself.", "Wanted to play Charles A. Lindbergh in The Spirit of St. Louis (1957) and penned a letter to director Billy Wilder in October 1954 requesting to meet in person to discuss his potential eligibility for the role. Eastwood had just done his first screen test for Universal Pictures but had yet to make his acting debut. The role ultimately went to an established star, James Stewart.", "Agent is Leonard Hirshan.", "On Christmas morning 2001, his daughter Francesca Eastwood and her mother Frances Fisher narrowly escaped a fire that engulfed their rented house in North Vancouver, Canada. Francesca leaped 15 feet from a second-story window into the arms of her mother and a neighbor, and was treated at a hospital for smoke inhalation. Frances was also treated for burns on her hands. Clint flew up to visit them in the hospital and personally thanked his daughter's rescuers.", "One of several celebrity endorsers of David Lynch's Foundation for Consciousness-Based Education and World Peace.", "On a return air trip from a prearranged tryst in Seattle, a two-seated plane on which he was aboard ran out of fuel and crashed into the Pacific Ocean near Point Reyes. Using a life raft, Eastwood and the pilot swam 2 miles to shore. After the fact publicity gives the false impression that this occurrence was somehow war related. [September 1951]", "Former father-in-law of Kirk Fox and Jordan Feldstein.", "Says he voted for Dwight D. Eisenhower in 1952 and 1956, Richard Nixon in 1968 and 1972, Ronald Reagan in 1980 and 1984, Ross Perot in 1992, and John McCain in 2008.", "Had a long-held obsession with New York Times film critic Pauline Kael because she never liked his work. After her review of The Enforcer (1976), Clint asked a psychiatrist to do an analysis of Kael from her reviews of his past work, which he had memorized verbatim. It concluded that Kael was actually physically attracted to Clint and because she couldn't have him she hated him. Therefore, it was some sort of vengeance, according to Clint.", "Was interested in the prospect of playing Hank Rearden in a cinematic adaptation of \"Atlas Shrugged\" that was in development by Albert S. Ruddy in the early '70s.", "A slow bloomer in almost every regard, Clint was going on 19 when he left high school (in an era where some students graduated at 16), got his first big film role at age 34, waited until he turned 38 to start a family (not including illegitimate unmentionables), made his directorial debut at 41, and received his first Oscar nomination when he was nearly 63.", "Accounts from inside the courtroom in the fraud case brought against him by Sondra Locke noted that Eastwood spoke in a barely audible tone on the witness stand and was unable to cross-reference. In one deposition he used the phrase \"I have no records on that\" 79 times.", "Developed his movie voice by listening to audio recordings of Marilyn Monroe. He said he'd noticed Monroe's breathy whisper and he thought it was very sexy and since it had worked so well for her, he decided he'd \"do\" a male version of it himself.", "Has at least six homes in the state of California alone. One of them, the 1,067.5 acre Rising River Ranch near Cassel, formerly belonged to Bing Crosby; Eastwood bought it in November 1978 for $1.9 million after it fell into probate. In July 1979, he paid a little over $1.1 million for a 6,136-square-foot house in Bel Air, just a mile northwest of UCLA. He eventually acquired the place next door as well. The most expensive property he owns is a 15,000-square-foot estate in Carmel, which he spent approximately $20 million building in 2010.", "Parodied by Bill Hader on Saturday Night Live (1975).", "Used to be buddies with Robert Donner, George Fargo and Chill Wills.", "Past cars have included Audi, Ferrari, Mercedes-Benz and GMC Yukon. As of 2016 he is still driving at 86 years old and his vehicle of choice is an unmarked Ford Crown Victoria.", "According to author Patrick McGilligan, in July 1993 Eastwood was confronted with the claims of a woman in her late thirties, originally from Washington State, who had researched her adoption and ascertained that he was her biological father. After having his lawyers and business managers check her out, so the story goes, Eastwood agreed to have dinner with the woman, Laurie Murray, who was married to a rich man and was happy to guard her anonymity - she just wanted to meet him - and promised to stay in touch. (It is worth noting that although McGilligan's book is touted as being scrupulously researched, it does contain easily discernible errors concerning people in Eastwood's life, e.g. ex-consort Sondra Locke's year of birth, son Kyle Eastwood's marital status at a given time and the gender of Clint's only grandchild of record, Graylen Eastwood.) In Les grands reportages: L'album secret de Clint Eastwood (2013), McGilligan stated on camera: \"We don't know how many children Clint has had  with how many women.\" Besides Ms. Murray, since at least 2005 there is a rumor of unknown origin that Eastwood fathered a son named Lesly born on 13 February 1959 to one Rosina Mary Glen. Publicly, Eastwood has neither confirmed nor denied any of these claims.", "Avid tennis player in the past.", "Turned down The Bucket List (2007).", "Doesn't use text messaging and prefers landline when he talks on the phone.", "His first onscreen kiss was with Carol Channing in The First Traveling Saleslady (1956).", "In addition to his multiple houses, he has a well-appointed apartment behind his studio office in Burbank. In Carmel he used to keep an apartment on the third floor of a building two doors down from the Hog's Breath Inn.", "Turned down the role of Archie Gates in Three Kings (1999) which went to 31-years-younger George Clooney. Coincidentally, Eastwood and Clooney have both been romantically linked with Frances Fisher.", "Cited under the pseudonym Mr. Smith in Durk Pearson & Sandy Shaw's self-help book, \"Life Extension: A Practical Scientific Approach\" (1982).", "A July 1968 newspaper item by Dorothy Manners gives insight to his rapid rise to stardom: \"Clint Eastwood is on his way to earning $750,000 per picture while the proverbial man in the street is still asking, 'Who's Clint Eastwood?' He's the hottest property sight unseen (almost) in Hollywood today.\" Clint was 38 years old.", "Has always been allergic to horses, which is why, in his westerns, he is rarely seen in close-up on horseback. When he had to ride horses in films, he would first have to sniff medication into his nose and lungs. On Bronco Billy (1980) it left him constantly miserable. One time he was so frustrated he socked his horse in the nose.", "Ferris Webster worked exclusively as Eastwood's film editor for a decade, but the two had a falling out during postproduction on Firefox (1982).", "The only biographical book he's ever authorized is \"Clint Eastwood: A Biography\" (1996) by Richard Schickel. It provides extensive plot summary for each of Eastwood's movies but leaves his life little documented by comparison (not to mention omitting several of Eastwood's families). What it does say about his life, while approved by Clint, doesn't sit well with everyone. Sondra Locke denounced Schickel's book as a \"puff piece\" and said it was \"full of misstatements and downright fabrication, not only about me but others.\" Schickel, who also provided audio commentary for Eastwood films on DVD, passed away in 2017. Locke died a year later.", "Clint's first wife Maggie encouraged him to marry Frances Fisher, with whom she and her two kids by Clint, Alison and Kyle, got along great. Fisher was aware of Clint's other family Roxanne and Kimber Tunis, but it was only after giving birth to Eastwood's child that she discovered - not through him - that he had yet another brood with Jacelyn Reeves. So it didn't really come as a surprise to anyone in the know when they decided not to get married, splitting when their daughter Francesca was barely a year old. Frances later had a face-to-face encounter with Reeves at the funeral of one of Clint's golf buddies.", "Without taking any acting jobs, he earned $17 million for the period of a year ending in 2010: $6 million apiece for directing Invictus (2009) and Hereafter (2010), $4 million in DVD royalties for Gran Torino (2008), plus $1 million in royalties from earlier projects.", "Personal physician Dr. Harry Demopoulos told Muscle & Fitness magazine in 1991 that Clint never eats fat, takes his antioxidants faithfully, works out like a demon and gets plenty of sleep, which is an area that is often neglected in a fitness program.", "He started lifting weights at 19, when weight training and bodybuilding were relegated to back-alley sweatshops with black-iron plates.", "Eastwood's image was untouched by personal scandal of any sort until late April 1989, when his girlfriend of 14 years, Sondra Locke, made it known to the world that she had undergone two abortions and a tubal ligation \"at his specific request.\" (\"I had done the unthinkable. I had publicly exposed him,\" she commented in retrospect.) The breakup with Locke opened the floodgates to investigative journalism about Eastwood. In July 1989, the National Enquirer reported the existence of a love child he fathered in 1964, and in February 1990, the Star tabloid became the first publication to link Eastwood's name with Jacelyn Reeves--who, it turns out, was the mother of two of his unmentionable offspring. Reputable news outlets wouldn't touch this information for years after. Almost certainly, his career would have suffered had this become public knowledge during the fact. Almost certainly, knowledge of this (and other out-of-wedlock children) would have hampered his 1986 mayoral campaign. When Locke's memoirs were published in 1997, she was shut out of most venues to promote the book. \"Sadly, it was well suppressed by Clint and WB. [...] I was sad that it did not get the attention I feel it deserved,\" she said in 2013. \"Clint: The Life and Legend,\" a deeply unflattering biography by film historian Patrick McGilligan, was published in Great Britain in 1999, but did not make its way to the United States until 2002, having bounced around publishers for three years amid rumored threats from Eastwood's attorneys. Los Angeles Times critic Allen Barra called it \"perhaps the most thoroughly demythologizing book yet written on modern Hollywood.\" On Christmas Eve 2002, Eastwood's lawyer Marshall Grossman filed a $10 million libel suit against McGilligan and St. Martin's Press in San Jose, California. Strangely enough, out of all the sordid stories in the book, the libel claim only covered three points, according to news reports: (1) That Eastwood once punched his first wife Maggie Johnson in the face; (2) That Eastwood is an atheist; (3) That Eastwood used a romantic relationship with an officer's daughter in order to avoid being sent overseas during the Korean conflict. The suit was settled in July 2004 without any public disclosure; McGilligan and the publisher admitted no wrongdoing and there was no penalty. A revised and updated version of \"Clint\" was published in 2015, with most of the original content intact. The three cited passages had been excised, and a few other modifications amounting to less than two pages were made. McGilligan says many of the things he reported in the first edition are now taken for granted, and one of the reasons Eastwood sued him was an obvious attempt to find out his sources.", "Net worth was estimated at $375 million prior to his 2014 divorce from Dina Eastwood. No terms of financial settlement were revealed in the divorce decree, so it's unclear where his personal fortune currently stands.", "A bachelor again at age 84, he's been seen in the company of photographer Erica Tomlinson-Fisher and restaurant hostess Christina Sandera in recent times, and has reportedly bought homes for both women. [2014]", "Had hair transplants in the mid-1980s. When his head was wrapped in white bandages after the surgery, he told people he'd been in a bicycle accident.", "Was asked for permission about his name being used for Marty (Michael J. Fox) in Back to the Future Part III (1990). He consented and was said to be tickled by the homage.", "Eastwood was Ratboy (1986)'s de facto producer and exerted complete creative control, so first-time director Sondra Locke had an obligation to show the revised screenplay to him after she did some collaborative editing with Gordon Anderson. Eastwood sat up in bed one night reading the new draft, while Locke sat next to him, watching him warily. Yet he seemed to be enjoying it, laughing as he read and scribbling in the margins. The next day, Locke arrived at Malpaso offices first and told credited producer Fritz Manes not to worry, Clint loved the changes. Eastwood came in the door about noontime because he never came in early. According to Manes, \"He was purple...I've never seen him so f***ing mad. He takes this thing and he throws it so hard it almost broke the window behind me. He said, 'I'm closing this thing down. How could you let her do this?'. I said, 'I thought you knew.' He said, 'Well, you don't have to worry about this piece of s*** anymore. I'm going out and telling Warners to shut the production down.'\" Clint went to the outer office and grabbed Sondra and they went off somewhere and had a huge explosion. Manes went over to the floor and picked up the script. \"It had F*** - C***SUCKER - S*** - across every page,\" said Manes. \"Every page had some awful thing on it like some lunatic had scribbled all over it!\" Production ultimately went ahead, but Locke had to abandon Anderson's script and all the new characters and details he had created. Sondra cites the Ratboy (1986) debacle as \"the beginning of the end\" of her relationship with Clint, and declared in hindsight that \"obviously whatever control issues he had over my directing were fueled by the hidden birth of a son.\" (Although she didn't know it at the time, Eastwood was cheating on her and had just become the father of Scott Clinton Reeves, born more than 300 miles away to a stewardess in Monterey.).", "While promoting the reality series Mrs. Eastwood & Company (2012) on E!, Clint's then-wife Dina Eastwood told Chelsea Handler: \"I hope we're still married when this is over!\". Just two weeks after the show premiered, Clint and Dina separated.", "Known to be passive-aggressive in private life, communicating only by gesture, inference, and what isn't said or done.", "Went to the Coachella Valley Music and Arts Festival in 2013 and 2015.", "After being contacted by Sondra Locke in 1994, feminist leader Gloria Steinem said she would orchestrate a nationwide campaign to ban Clint Eastwood films. However, there was no ban on Clint's movies, and no explanation of why not.", "Although Clint has often peddled the notion that he grew up poor, actually his family lived in a very wealthy part of town, had a swimming pool, belonged to the country club, and each drove their own car.", "His mother Ruth Wood often brought her own bedsheets when she visited overnight at Clint's.", "With the exception his cameo as Silvana Mangano's husband in the obscure Italian film The Witches (1967), Space Cowboys (2000) is the only time Eastwood has played a formally married man. His characters are usually single and meet their potential love interest (if any) as the story develops. Other times he's played divorcées (Tightrope (1984), Heartbreak Ridge (1986), The Rookie (1990), The Mule (2018)), widowers (Dirty Harry (1971), The Outlaw Josey Wales (1976), Gran Torino (2008), Trouble with the Curve (2012)) or men who are separated from their wives (True Crime (1999)) but never actually married.", "Biographer Patrick McGilligan affirms that \"the people who know Clint best suspect there are other families in his closet\" in addition to his verified children, editorializing \"If Kimber Tunis was kept secret for twenty-five years, and the Washington woman for forty, might there not be others?\".", "To date, 24 of the 47 films Eastwood has starred in depict violence against women. He's made 17 films in which a female character is killed, 12 films depicting rape or attempted rape, and 11 films showing a female character physically battered. [2019]", "According to the unpublished manuscript \"Take Ten\" by Ria Brown, Anita Lhoest at one point became pregnant with Clint's child, but went ahead and had an abortion.", "Speaking on condition of anonymity, one of the mothers of Eastwood's children told biographer Patrick McGilligan: \"There is no guilt with Clint. Anything that vaguely resembles guilt is channeled into anger. His anger is always intended to prove people wrong, or prove their behavior bad. And if people are wrong or bad, there is nothing for him to feel guilty about.\".", "Modeled sweaters in a 1972 Playboy layout with a bottomless Susan Blakely.", "In general, he wraps films early and uses the actors' first takes. Most of his films are shot in the spring or summer and released around Christmastime.", "According to Robert Daley, \"If they ever called a meeting of all the people Clint has screwed over, they'd have to hold it in the LA Coliseum.\".", "Eerily, three of his leading ladies (Inger Stevens, Jean Seberg, Elizabeth Hartman) committed suicide.", "One afternoon in the early 1970s, Eastwood and Paul E. Lippman were walking around San Francisco when a random woman on the street (who happened to be of short stature, just his type) sniffed, \"Oh, you're Clint Eastwood . . . I hear you're a bum lay!\" Clint, very stunned and at a total loss for words, stretched his neck muscles mightily, as he always did when stuck for a quick response, then finally managed, \"Well . . . uh . . . where did you hear that?\" To which she pertly answered, \"Oh, it's all over town.\" After a few more neck stretches, Clint invited her for a drink at some club to discuss the matter, then spent the night at Sausalito's Alta Mira Hotel trying to prove otherwise. The next morning Lippman asked her if she still thought Clint Eastwood was 'a bum lay', and she held out a flat hand, palm down, and wiggled it.", "Formerly a part-time resident of Tiburon, Marin County.", "Jane Cameron Agee, a side piece of Eastwood's for several years, was in the process of writing a tell-all book when she died in a car crash on February 13, 1995.", "Told Rolling Stone magazine in 1985, \"I didn't really get involved in team sports because we moved so much,\" but actually, he didn't move at all between the ages of 10 and 19.", "When The Variety Club honored Clint in 1986, hardly anyone in the audience knew him personally. He'd never even met some of the celebrities who gave a speech. Yet everyone acted like good friends.", "Lifeguarded for a summer at Kennydale Beach in Renton, Washington, 1953. \"He never had to bring his lunch. He never had to do any of the normal duties like beach clean-up, because all the girls would do it for him,\" according to Penny Wade, chief of budget and personnel for King County Parks. \"There are stories,\" Wade added.", "One of many fictitious stories to be spoon fed to reporters - and go unchallenged for decades - is that Eastwood got into show business after being scouted by director Arthur Lubin at Fort Ord during the filming of Francis Joins the WACS (1954). For one thing, Eastwood had already left Fort Ord by the time Lubin filmed there in spring 1954. (His military stint lasted from 1951-53, not 1950-54 like his early publicity biographies state.) It was Clint who took the initiative; he wanted to be an actor and had somehow managed to encounter cinematographer Irving Glassberg after moving to L.A. in late summer or early fall of 1953. Glassberg introduced him to Lubin at a gas station on Santa Monica Boulevard, and that's how they met.", "First wife Margaret Neville Johnson, known as Maggie, was born in 1931 and had one sibling, Gilbert F. Johnson Jr. (1924-2006). Her parents were Gilbert Sr. (1896-1966) and Edith (1896-1970). An alumni of UC Berkeley, Maggie was employed as a secretary for auto parts suppliers Industria Americana when she met Clint on a blind date in the San Francisco area in spring 1953 (some sources say 1952). They did not date exclusively, and Clint spent the majority of that summer up in Seattle, where to impress a girl he dug he joined a small theater group. The Seattle girlfriend, who has never been identified, became pregnant by Clint and gave birth to daughter Laurie Eastwood on February 11, 1954 in Renton, Washington -- nearly eight weeks after he married Maggie.", "The first incarnation of his publicity advanced the fairy tale that Clint was \"a star on the high school basketball team,\" and this became an established nugget of his life story, carried down in permutations through the years in articles and books, appearing in even as authoritative and recent a source as Current Biography (Yearbook, 1989).", "Is allegedly updating and revising his will constantly.", "Studied at LACC. Other alumni include Morgan Freeman, Mark Hamill, Cindy Williams, Donna Reed and Rene Aranda.", "Hates being written about, even if it's the most harmless mention.", "Women he's been photographed with throughout his career have often been misidentified in accompanying captions, because he's always refused comment on his personal life. Most celebrities issue a press release when they get married or divorced, break up with their significant other, or become a parent. Eastwood never has. Hence, many discrepancies exist.", "In 2017, 46 years after the release of The Beguiled (1971), Sofia Coppola remade the film. The Beguiled (2017) stars Colin Farrell in the role of John McBurney. Farrell shares the same May 31 birthday as Eastwood and is 41, the same age Eastwood was in the original.", "Bans Coca-Cola from his sight, stemming from a long-ago discord with Columbia Pictures (Coca-Cola and Columbia Pictures were connected).", "Doesn't allow pets in the house because of his allergy to animal hair.", "Sondra Locke said it was a nightmare getting him into court because he refused his subpoena and ordered Malpaso to also refuse any subpoenas her lawyer Peggy Garrity tried to serve him. Eastwood always had an excuse for being unavailable: he was out of town; he was sick; his life was being threatened etc. On December 8, 1994, Mark Ryan, a registered California process server for Harris & Mason, went to Malpaso's headquarters at the Warner Brothers Burbank lot to serve Eastwood with court papers requiring him to appear as a witness. Once Eastwood realized what the papers were he began screaming, \"What the fuck!\" \"Close the door and call security,\" he ordered his assistant. In a lawsuit filed on January 4, 1995, Ryan contended that Warner Bros., at the direction of Eastwood, falsely imprisoned him in a van for 70 minutes, handcuffed him, refused to allow him to leave the WB lot and threatened to have him arrested. Eastwood, of course, could not be reached for comment.", "A fan of Paul Reubens and Benny Hill.", "During a 1985 interview with Gene Siskel, he subtly expressed disdain for Jessica Lange, Sally Field and Sissy Spacek.", "Has a line of sportswear: Tehama Clint. At the tourist shops in Carmel, kinkier fans can buy panties with the inscription \"Make My Night\".", "Was given the nickname \"Susi Pi\" by Gordon Anderson.", "As a boy he collected snakes. One time, he had 13 snakes.", "Has no formal acting training.", "Clint Eastwood has stated \"The best part of me is the Irish part of my ancestry\" and has expressed a desire to make a film in Ireland in the past.", "At one point, he took so much carotene his hands turned orange.", "Counts among his fans such luminaries as Orson Welles.", "Surprisingly does not have a star on the Hollywood Walk of Fame. He does, however, have his hands and footprints in cement at Grauman's Chinese Theatre. By sheer coincidence, Clint's handprint square touches corners with comedy legend Groucho Marx's handprint square. Groucho's granddaughter, Jade Marx-Berti, is Clint's ex-sister-in-law. When Jade started dating Dominic V. Ruiz (the younger brother of Clint's former wife Dina Eastwood), they viewed this as a \"sign\" of their relationship being written \"in stone and in the stars\".", "As of 2018, has produced and directed two Oscar Best Picture winners: Unforgiven (1992) and Million Dollar Baby (2004), and three nominees: Mystic River (2003), Letters from Iwo Jima (2006) and American Sniper (2014).", "Throughout his life, he has always had a preference for women of small stature. (He calls them \"little dollies,\" \"squirts,\" \"spinners,\" \"shrimps\" or \"hip pocket rockets.\") He once dated a woman who was only 4'8\" -- 20 inches shorter than himself.", "Got the role of Dirty Harry after first choice Frank Sinatra suffered an arm injury.", "His first wife Maggie was born in 1931, although during the 1970s she was wrongly reported as five years younger than that. Longtime spouse-equivalent Sondra Locke was born in 1944 but always gave a younger birthdate, sometimes as much as twelve years younger. Unlike the women in his life, Clint has always been honest about his age.", "On August 4, 2018, he was honored with a day of his film work during the TCM Summer Under The Stars.", "In 1960, Clint Eastwood was one of Lucille Ball's first choices to play her romantic lead in the Broadway musical \"Wildcat.\" When he (and a few A-list marquee names) were not available, she settled on Keith Andes.", "In 1997, he launched his own beer 'Pale Rider Ale', with the ad line: 'You Didn't Expect Clint Eastwood to Make a Salad Dressing Did You?' on a western-style playbill poster.", "Grandson Titan Wraith Eastwood was born September 16, 2018 to daughter Francesca Eastwood and her boyfriend Alexander Wraith. Titan is Clint's first grandchild whose birth has been publicly announced.", "Has played a pilot twice: Tarantula (1955) & Firefox (1982).", "Was offered the role of K in Men in Black (1997), but turned it down.", "Often directs using a hand-held wireless monitor, which allows him to be close to the actors while keeping an eye on the frame.", "Grandchildren: Lowell Thomas Murray IV (born circa November 1982) and Kelsey Hayford (born April 17, 1984) via secret daughter Laurie Warren and her husband, Lowell Thomas Murray III. Their existence was not publicized until December 2018. Laurie was born in 1954 when Clint was married to his first wife, Maggie Johnson. She was adopted by Helen and Clyde Warren of Seattle. Eastwood biographer Patrick McGilligan divulged that Laurie's biological mother, who refuses to be identified, was a member of a Seattle theatre group when she and Clint conceived Laurie. The Daily Mail said that Clint's office did not respond to requests for clarification.", "The death of Eastwood's former common-law wife Sondra Locke at age 74 on November 3, 2018, was not publicized until opening day of his new movie The Mule (2018) - six weeks later. From Clint, there was complete silence. Coincidentally, the anniversary of Locke's death is also the birthday of Clint's late uncle, Melvin Runner.", "Once punched his fist through a door, ripping his hand. The same day a palmist read his hand - still bleeding - and said she could tell what a 'tranquil' person he is.", "Obtained a permit for a .38 Smith & Wesson revolver in 1983.", "His fallacious episode of Biography (1987) (original air date: 10/5/03) only acknowledges four children, when he in fact has at least eight.", "Walked out on an interview with The Boston Herald's Stephen Schaefer when Schaefer asked about his kids.", "He has appeared in three films that have been selected for the National Film Registry by the Library of Congress as being \"culturally, historically or aesthetically\" significant: Dirty Harry (1971), The Outlaw Josey Wales (1976) and Unforgiven (1992). He has also directed two films that are in the registry: The Outlaw Josey Wales and Unforgiven.", "Former publicist is Jerry Pam.", "According to Bill Brown, publisher of The Pine Cone newspaper in Carmel and a golfing pal of Eastwood's, \"Clint told me not too long ago that Sondra was the love of his life.\".", "Business manager Roy Kaufman died in 2016. For more than 40 years, all the houses Eastwood owns were listed in Kaufman's name, to keep stalkers at bay.", "His father's obituary in the Oakland Tribune omitted some of Clint's illegitimate children from the grandchildren count.", "With the sole exceptions of Shirley MacLaine in Two Mules for Sister Sara (1970) and Meryl Streep in The Bridges of Madison County (1995), has never starred opposite an actress of even remotely equal stature.", "During his life, he has impregnated at least nine women: the six women confirmed as having his babies, plus Sondra Locke, Anita Lhoest and Jane Cameron Agee whose terminated pregnancies are documented in Patrick McGilligan's Clint biography.", "Was offered officer training while serving the Army by superiors who thought he had the right look. Eastwood however admitted that he had no interest in a military career, although this could be just another PR gimmick.", "Was courted for the title role in Dick Tracy (1990) in 1980 when John Landis was set to direct.", "A competent pianist, he's a lifetime jazz enthusiast and Charlie Parker fan.", "Both times he won an Oscar for best director he won one for best picture too. but has never won an Oscar for acting.", "Is a member of the super-exclusive Bel-Air Country Club.", "On 22 August 1987, Clint and Sondra were traveling with Harrison Ford when their private jet broke down during a Paris-to-L.A. flight and made an emergency landing in Bangor, Maine. Mechanics from California were flown out to Bangor to fix the plane and once repairs were finished, the group got back on board and continued their flight.", "Cousin, Donald F. Runner, a salesman for IBM, died at age 32 on May 8, 1964 in Spokane, Washington, having been hospitalized since Jan. 30. The cause of death was not disclosed.", "His granddaughter Kelsey Hayford has a son, Wizzells.", "Former neighbor of Entertainment Tonight (1981) host Ron Hendren.", "His first wife was a good friend of TV writer Sonia Chernus. According to early fan mag publicity, the connection led to him being cast in Rawhide (1959)."], "filmography": ["Cry Macho ()", "The Mule", "American Sniper", "Trouble with the Curve", "Gran Torino", "Million Dollar Baby", "Blood Work", "Space Cowboys", "True Crime", "Absolute Power", "The Bridges of Madison County", "Casper", "A Perfect World", "In the Line of Fire", "Unforgiven", "The Rookie", "White Hunter Black Heart", "Pink Cadillac", "The Dead Pool", "Heartbreak Ridge", "Pale Rider", "City Heat", "Tightrope", "Sudden Impact", "Honkytonk Man", "Firefox", "Any Which Way You Can", "Bronco Billy", "Escape from Alcatraz", "Every Which Way but Loose", "The Gauntlet", "The Enforcer", "The Outlaw Josey Wales", "The Eiger Sanction", "Thunderbolt and Lightfoot", "Magnum Force", "Breezy", "High Plains Drifter", "Joe Kidd", "Dirty Harry", "Play Misty for Me", "The Beguiled", "Two Mules for Sister Sara", "Kelly's Heroes", "Paint Your Wagon", "Where Eagles Dare", "Hang 'Em High", "Coogan's Bluff", "The Witches", "The Good, the Bad and the Ugly", "For a Few Dollars More", "Rawhide (1959-1965)", "A Fistful of Dollars", "Monsieur Ed, le cheval qui parle", "Alfred Hitchcock Presents", "Maverick", "Lafayette Escadrille", "Ambush at Cimarron Pass", "Navy Log", "Escapade in Japan", "West Point", "Les aventuriers du Far-West", "Away All Boats", "The First Traveling Saleslady", "Star in the Dust", "Highway Patrol", "Never Say Goodbye", "TV Reader's Digest", "Tarantula", "Lady Godiva of Coventry", "Francis in the Navy", "Revenge of the Creature"]}