{"name": "Tim Perez", "current role": "Security Guard", "birth name": " ", "birth date": " ", "birth place": " ", "height": "6' 4\" (1.93 m)", "biography": "Tim Perez was born in Fresno California, middle child of five girls and two boys, in a close-knit Latino family. His athlete father was Associate Dean of Student Affairs at Fresno State University and his mother gained her PhD at Stanford University, and was a professor and chair of the Education Department at University of North Carolina.Hard work, upward mobility and community activism were watchwords in the Perez home, which produced two Lawyers, a Doctor and a Scholar in Aztec Literature.In Jr. High and High School Tim was student body president and voted most outstanding student. He was City Champion in Jr. Varsity Cross Country, High Hurldes, Low Hurdles and Triple Jump. He Lettered in Varsity Cross Country, Track and Field and Basketball. He was the Captain of his Varsity Basketball team. He was awarded most outstanding Thespian in Drama and nominated for the B'nai Brith Student Athlete and lost out to Henry Ellard, future star receiver of the Los Angeles Rams. Tim was also an apprentice actor at the California Shakespeare Festival.At age 20, after a successful run in Jr. College basketball, Tim was accepted by audition at NYU Tisch School of the Arts. Tim was one of 18 candidates (and sole Latino) to make the cut out of applicants. He graduated with an MFA in Acting in 1986.Legendary New York producer Joe Papp cast Tim Perez in his first professional job, acting opposite F. Murray Abraham in A Midsummer Night's Dream, directed by two time Tony winning director A.J. Antoon. Tim has acted in eight Off Broadway productions at the New York Public Theater including Shakespeare in The Park and leading regional theaters.On stage Tim has worked with Academy Award winning actors F. Murray Abraham, Morgan Freeman, Helen Hunt, Tony winning directors Des Macnuff and A.J. Antoon, as well as other leading figures in theater: Artistic Directors Oskar Eustis, Garland Wright, Richard Hamburger, Carlos Gimenez and Obie winning directors JoAnne Akalaitis and David Greenspan.Tim has been featured on Spanish CNN, KTLA and national print media, Espectaculos, Estylo, Daily Variety, Latin Style and been reviewed by the New York Times. Tim recently performed a one-man show \"An Evening With Fidel and My Mother The Radical\" at the Walkler Theatre in NYC, about the life of Fidel Castro and border separation. In addition, he has written a full length play \"El\", about the infancy of the Cuban Revolution. Tim has also written three screenplays. Tim's acting is mentioned in F. Murray Abraham's book, \"Actors on Shakepeare.\"Tim has over 60 television and film credits, including starring opposite Academy Award nominee Jennifer Tilley in, \"Relax it's Just Sex\" a Sundance Film Festival selection and Outfest Los Angeles, LGBT Film Festival Hall of Fame inductee.Tim lives in Canada with his wife designer/fine artist Gail Taylor and son.::Pablo Productions", "trade mark": " ", "trivia": " ", "filmography": ["A.T.A.C.K ()", "Van Helsing", "Genesis Code", "Colony", "The Good Doctor", "Altered Carbon", "Let the Right One In", "Rogue", "Shut Eye", "Come and Find Me", "UnREAL", "Arrow", "Minority Report", "Tomorrowland", "Motive", "The Christmas Shepherd", "Ma soeur, mon pire cauchemar", "Bad Seeds", "Abducted: The Carlina White Story", "The Possession", "Alcatraz", "The Pregnancy Project", "Human Target", "The Stranger", "Sanctuary", "Smallville (2004-2009)", "Fireball", "Aliens vs. Predator: Requiem", "Bionic Woman", "War", "Beneath", "Traveler", "Anna's Storm", "Crossroads: A Story of Forgiveness", "88 Minutes", "Stargate SG-1 (2006-2007)", "To Be Fat Like Me", "The Secret of Hidden Lake", "Gray Matters", "The Suspect", "The Dead Zone", "The Evidence", "Edison", "Are We There Yet?", "Dragnet", "Days of Our Lives", "King Rikki", "Ocean's Eleven", "NYPD Blue", "Port Charles (1998-2000)", "ER", "The Bachelor", "L.A. Doctors", "Relax... It's Just Sex", "Pacific Blue", "If Looks Could Kill", "JAG", "Speechless", "Perfect Witness", "Weekend at Bernie's", "All My Children", "Low Blow"]}