{"name": "Allyson Leigh Jordan", "current role": "Casino Girl", "birth name": " ", "birth date": " ", "birth place": " ", "height": " ", "biography": "Allyson Leigh Jordan, a small town girl from Alabama moved to New Orleans, fell in love with this city, made friends fast through the Movie Industry, and is proud to call New Orleans her home. Allyson, a Sag Eligible Actor, is known to many of her friends as \"Ally\", and has always dreamed of becoming an Actor ever since she was a little girl. Since landing in New Orleans, Allyson, has taken on the movie scene by storm working in over 40 Feature Films, TV, and Short Film Productions just since March of 2011, as an Actress, Producer, Casting Director, Set Photographer, and PA. Allyson attended UCLA School of Theater and Film in Los Angeles, California and studied acting under acclaimed instructor Mr. Michael Hackett, and many others. Allyson has had additional acting training which includes, Tony Sheppard's Actors Workshop in association with Aaron Spelling Productions, and The Hollywood Awards Actor, Screenwriter and Filmmaker Workshop. Allyson worked in Comedy Improv with her most noted appearance on stage at The Groundlings Theater in Los Angeles on The Saturday Night Live 25 Year Reunion Show. Her character was as the \"Southern Girl in LA\". A few highlights from her Film and TV credits include, Dawn of the Planet of the Apes (2014)Human Colonist. Black and White (2014) Mom, Star-Crossed (TV series 2014) Reporter, 12 Years a Slave (2013) Dancer, The Butler (2013) Reagan Diner, The Campaign (2012) Reporter, Common Law (TV series 2012) LAPD Police Officer for an entire season on the show. Bullet to the Head (2012) Dancer. She has worked as Stand-In, and Photo Double. One highlight is when Allyson was Stand-In for Nicolas Cage's hands in the movie Stolen (2012), whereas she put her hands in water and electrical wires while pyrotechnics could set up an explosion. In her recent work, she had the Principal role as Jennifer in the Movie LT (2012) a Zombie Killer. This Movie is part of the Project Z: History of the Zombie Apocalypse Series. Another Movie No Such Thing (2013),whereas she plays herself in the Project Z series. Allyson has been a Movie Producer on the Movie, Snack Time (2012). As Producer she acquired, the famous Hubig's Pies as a Sponsor for the Film. She has been the Videographer doing \"Behind the Scenes\" Footage for 8 Episodes of the Project Z series. She has also worked as the Set Photographer for many Movies as well. Allyson is a working Actor who is also writing movie scripts and working on producing Films. Allyson is well on her way to making all of her dreams come true.::Allyson Leigh Jordan", "trade mark": " ", "trivia": " ", "filmography": ["Demimonde", "Occult ()", "Geostorm", "I, Tonya", "Extraordinary", "The Executioner", "Jack Reacher: Never Go Back", "Deepwater Horizon", "Bad Moms", "Midnight Special", "Daddy's Home", "The Big Short", "One Mississippi", "Self/less", "Escaping Alameda", "The D Train", "Wild Card", "The Loft", "Black or White", "99 Homes", "Day 47", "Dawn of the Planet of the Apes", "22 Jump Street", "Star-Crossed", "Barefoot", "Devil's Due", "Grudge Match", "Oldboy", "American Horror Story", "12 Years a Slave", "Lee Daniels' The Butler", "This Is the End", "Now You See Me", "The Hot Flashes", "G.I. Joe: Retaliation", "Beautiful Creatures", "Parker", "Project Z: History of the Zombie Apocalypse (2012-2013)", "Bullet to the Head", "Stolen", "Common Law", "The Campaign", "21 Jump Street", "Hide"]}