{"name": "Cesar Garcia", "current role": "Waiter", "birth name": "Cesar A. Garcia", "birth date": " ", "birth place": " ", "height": "5' 8\" (1.73 m)", "biography": "Cesar Garcia is an actor known for Breaking Bad, Fast & Furious 4, Cesar grew up in East Los Angeles, California in a predominantly Mexican American community. He was raised by his mother Mona, a single mom. Growing up in the \"Hood\" was tough. Cesar had to learn to fight at a very young age and was 5 years old when he first witnessed someone die. As a child, he was very poor and didn't have many resources. Not having or even knowing his biological father led him to look up to local gang members as role models. The desire to belong and lack of direction led him to hanging out with people who were up to 10 years older than him and he started getting into trouble. He was arrested before he hit puberty and joined the neighborhood gang soon after. That decision landed him into many correctional facilities, drug/alcohol abuse and countless visits to the trauma center. Living \"La Vida Loca\" took up his entire juvenile life. As a result, he never got a chance to experience high school or graduate. As an adult, he was still living \"The Life\" but often found him self looking for something new. \"The Life\" was starting to wear thin. There was nothing left to do but die in the street or spend the rest of his life in a jail cell like most of his closest friends, including his younger brother Roy who died at the age of 19.As for his acting pursuits, he just \"Fell into it\" by accident. Although acting had never crossed his mind, he decided to give it a shot and has been at it for 8 years now. Cesar now uses his accomplishments as a tool to inspire inner city kids by visiting schools, juvenile facilities and drug/gang intervention programs. He also plans on building his own production and looks forward to telling his own story on the big screen.Cesar has starred in television shows such as \"Breaking Bad, Criminal Minds, Weeds, Strong Medicine, Warren the Ape, Chuck, Eagle Heart, The Shield and Hollywood Heights\" And movies such as \"Fast And Furious 4, Harsh Times and Drive\" also many independent films like \"Down For Life\" amongst many others. Cesar also co-wrote and produced a short film \"Chuco\" and is now writing and developing other projects.::Seth Isler", "trade mark": " ", "trivia": " ", "filmography": ["Hijos ()", "Bridge to Somewhere ()", "Maze of Fate ()", "Time in Between ()", "Water Dawg", "Cabal", "The Turnaround", "Dead End", "On My Block", "Myra", "A Second Chance", "A Way Out", "Avenge the Crows", "Runaways", "Lopez", "Gook", "Valley Heist", "Then I'll Rest", "Foreign Land", "Goliath", "NCIS: Los Angeles", "Murder in the First", "True Detective", "Circle", "Better Call Saul", "Gang Related", "Legit", "Criminal Minds (2012-2014)", "Avenues", "Eagleheart (2012-2013)", "Grand Theft Auto V", "The Shifting", "Broken Glass", "Greencard Warriors", "Afternoon Delight", "Weeds", "Hollywood Heights", "Starlet", "Chuck", "Platinum Illusions", "Drive", "The Rally", "L.A. Harmony", "Warren the Ape", "Five Star Day", "Down for Life", "Addicted", "Fast & Furious", "Breaking Bad (2008-2009)", "The Last Low Tide", "Little Bones", "Unit 47", "Falling", "Alternate Endings", "Scarface: The World Is Yours", "Hot Tamale", "Dirty", "Common Practice", "Harsh Times", "Strong Medicine", "One Easy Job", "Vengeance", "America's Most Wanted: America Fights Back", "All In", "The Shield"]}