{"name": "Tom Cruise", "current role": "Maverick", "birth name": "Thomas Cruise Mapother IV", "birth date": "1962-07-03", "birth place": "Syracuse, New York, USA", "height": "5' 7\" (1.7 m)", "biography": "In 1976, if you had told fourteen-year-old Franciscan seminary student Thomas Cruise Mapother IV that one day in the not too distant future he would be Tom Cruise, one of the top 100 movie stars of all time, he would have probably grinned and told you that his ambition was to join the priesthood. Nonetheless, this sensitive, deeply religious youngster who was born in 1962 in Syracuse, New York, was destined to become one of the highest paid and most sought after actors in screen history.Tom is the only son (among four children) of nomadic parents, Mary Lee (Pfeiffer), a special education teacher, and Thomas Cruise Mapother III, an electrical engineer. His parents were both from Louisville, Kentucky, and he has German, Irish, and English ancestry. Young Tom spent his boyhood always on the move, and by the time he was 14 he had attended 15 different schools in the U.S. and Canada. He finally settled in Glen Ridge, New Jersey with his mother and her new husband. While in high school, Tom wanted to become a priest but pretty soon he developed an interest in acting and abandoned his plans of becoming a priest, dropped out of school, and at age 18 headed for New York and a possible acting career. The next 15 years of his life are the stuff of legends. He made his film debut with a small part in Endless Love (1981) and from the outset exhibited an undeniable box office appeal to both male and female audiences.With handsome movie star looks and a charismatic smile, within 5 years Tom Cruise was starring in some of the top-grossing films of the 1980s including Top Gun (1986); The Color of Money (1986), Rain Man (1988) and Born on the Fourth of July (1989). By the 1990s he was one of the highest-paid actors in the world earning an average 15 million dollars a picture in such blockbuster hits as Interview with the Vampire: The Vampire Chronicles (1994), Mission: Impossible (1996) and Jerry Maguire (1996), for which he received an Academy Award Nomination for best actor. Tom Cruise's biggest franchise, Mission Impossible, has also earned a total of 3 billion dollars worldwide. Tom Cruise has also shown lots of interest in producing, with his biggest producer credits being the Mission Impossible franchise.In 1990 he renounced his devout Catholic beliefs and embraced The Church of Scientology claiming that Scientology teachings had cured him of the dyslexia that had plagued him all of his life. A kind and thoughtful man well known for his compassion and generosity, Tom Cruise is one of the best liked members of the movie community. He was married to actress Nicole Kidman until 2001. Thomas Cruise Mapother IV has indeed come a long way from the lonely wanderings of his youth to become one of the biggest movie stars ever.::Tom McDonough, Grant failor", "trade mark": "Often plays romantic leading men with an edge", "trivia": ["Older cousin of actors William Mapother, Katherine Mapother, and Amy Mapother.", "Chosen by Empire magazine as one of the 100 Sexiest Stars in film history (#41). [1995]", "Ranked #3 in Empire (UK) magazine's \"The Top 100 Movie Stars of All Time\" list. [October 1997]", "Chosen by People magazine as one of the 50 Most Beautiful People in the World. [1997]", "Voted Best Dressed Male Movie Star. [1997]", "Stopped to help a hit and run victim and paid her hospital bills. The victim was aspiring Brazilian actress Heloisa Vinhas (1996).", "Caused a stir in the medical community when he claimed, in an interview, that Scientology cured him of his dyslexia (1992).", "While he was working with Paul Newman in the The Color of Money (1986), he engaged in much conversation with the politically active actor. The resulting consciousness raising changed him from an actor who ignored the jingoistic tone of Top Gun (1986) to a performer who chose a film with a strong anti-war tone, Born on the Fourth of July (1989) to counter his contribution to the former film.", "Has three sisters: Marian, Lee Anne De Vette and Cass. Lee Anne became his publicist in 2004 after he left Pat Kingsley and left in 2005 to concentrate on production matters for his production company.", "Chosen by People magazine as one of the 50 Most Beautiful People in the World, two years in a row (1990, 1991).", "Attended and graduated from Glen Ridge High School in New Jersey. [June 1980]", "At age 14, he enrolled in a seminary to become a priest. He dropped out after one year.", "He took up acting after losing his place on a high school wrestling team due to a knee injury.", "He has two adopted children with Nicole Kidman: Isabella Jane Cruise (born December 22, 1992) Connor Antony Cruise (Connor Cruise) (born January 17, 1995).", "Mission: Impossible (1996) gave him a total of $70 million with percentage of gross included.", "Enjoys skydiving, scuba diving, and piloting his Pitts Special S-2B stunt plane", "Recently restored an older home in the township of Biltmore Forest, a town within the city limits of Asheville, North Carolina. [2000]", "Chosen as People magazine's \"Sexiest Man Alive\". [1990]", "Received the John Huston Award for Artists Rights in 1998.", "Was considered for the lead role in The Matrix (1999), which went to Keanu Reeves.", "Cruise earned roughly $75 million for Mission: Impossible II (2000). He did this by turning down any upfront salary, for instead taking a back-end deal that landed him 30% of the film's gross for both his producing and acting duties.", "Attended Packanack School in Wayne, New Jersey from first through third grade.", "Filed a $100 million defamation lawsuit against Michael Davis, a man who allegedly offered to sell videotapes of himself having sex with the actor. The lawsuit accuses Davis of making the statements \"in order to hurt the plaintiff and gain widespread publicity for himself\". [May 2001]", "Lived together with Vanilla Sky (2001) co-star Penélope Cruz from 2001 - 2004.", "In 1994, Tom received his pilot licence north of Toronto in Markham, Ontario, Canada.", "He did not stay for the remainder of the 2002 Academy Awards after opening them because it was his turn to look after his and ex-wife Nicole Kidman's children. He reportedly left the Kodak Theatre by a back door after opening proceedings and dashed home to watch the rest of the event on television with his kids Connor and Isabella.", "For 1988, he became the first actor to have the distinction of starring in both the year's Oscar winner for Best Picture, Rain Man (1988) and the year's Razzie \"winner\" for Worst Picture, Cocktail (1988).", "Ranked #14 in Premiere magazine's 2003 annual Power 100 List. Had ranked #16 in 2002.", "Ranked #4 in Star TV's Top 10 Box Office Stars of the 1990s. [2003]", "Born to Thomas Mapother III (October 15, 1934 - January 1984), an electrical engineer, and his wife Mary Lee Pfeiffer (Sept. 22, 1936 - Feb. 2017), a special education teacher.", "Has two dogs called Basil and Murray and a cat called Harvey.", "First actor in history to star in five consecutive films that grossed $100 million in the United States: A Few Good Men (1992), The Firm (1993), Interview with the Vampire: The Vampire Chronicles (1994), Mission: Impossible (1996) and Jerry Maguire (1996).", "Briefly attended St. Xavier High School in Louisville, Kentucky and was a paperboy for the Louisville Courier-Journal.", "Wore braces on his flashy, million-dollar smile in 2002 to correct a misaligned bite.", "Announced that his relationship with Penélope Cruz had ended in January 2004. [March 2004]", "Has appeared in films opposite four directors who have also directed his films. Sydney Pollack, who directed The Firm (1993), appeared in Eyes Wide Shut (1999). Paul Thomas Anderson, who directed Magnolia (1999), appeared as an extra in Minority Report (2002). Minority Report (2002) director Steven Spielberg appeared in Vanilla Sky (2001) and Austin Powers in Goldmember (2002). Cameron Crowe, who directed Jerry Maguire (1996) and Vanilla Sky (2001), appeared in Minority Report (2002).", "Will not allow his likeness to be used in video games or for action figures.", "While filming Days of Thunder (1990) at Daytona International Speedway, he drove one of the Hendricks Motorsports R&D cars around the track. The best time recorded was a lap at 205 MPH.", "He was voted the 31st Greatest Movie Star of all time by Entertainment Weekly.", "Lives with his sister Cass and her three children in Los Angeles, California. [September 2004]", "Spoke at his niece's, Lee Anne De Vette's daughter, graduation from the Delphian School.", "Ranked #18 on VH1's 100 Hottest Hotties", "Lost out to actor Peter Barton for the lead role in The Powers of Matthew Star (1982).", "Renée Zellweger thanked him in her Oscar acceptance speech when she won 'Best Actress in a Supporting Role' for Cold Mountain (2003).", "Attended the Neighborhood Playhouse in New York City.", "Channel 4's \"Ultimate Film\" show states that, in terms of British cinema audience rather than revenue, Cruise's most successful film in the United Kingdom was Austin Powers in Goldmember (2002).", "While a student at the Neighborhood Playhouse School of Theatre, he studied one of his courses under legendary acting teacher Sanford Meisner.", "Studied drama at the prestigious Neighborhood Playhouse, in conjunction with the Actors Studio, New School University, New York.", "Was named the #1 top moneymaking star at the box office in Quigley Publications annual poll of movie exhibitors a record seven times between 1986 and 2005. Being crowned the top box office champ in 2005 put Cruise one title ahead of Tom Hanks, who has been named #1 at the box office six times. Bing Crosby and Burt Reynolds both were named #1 for five consecutive years, and Clint Eastwood also has been #1 five times, but non-consecutively.", "Has been named to the Top 10 Poll of Moneymaking Stars 18 times, as ranked by Quigley Publications' annual poll of movie exhibitors. With his 18th appearance on the box office list, he moved out of a tie for fourth place tie with Paul Newman (17 appearances on the list) into a tie for #3 with Gary Cooper. John Wayne is #1 on the all-time list, with 25 appearances in the Top 10, followed by Clint Eastwood with 21 appearances on the list. Gary Cooper rounds out the top three. Due to his young age and continued popularity, it is conceivable that within 10 years, he will exceed Wayne as the #1 box office champ ever.", "Has donated to charities such as The Ashley Flint Fund, The Tsunami Relief Fund, Themoms.biz Diabetes Fund, Hillary Clinton's Campaign and The Church of Scientology.", "Premiere magazine ranked him as the #3 Greatest Movie Star of All Time in their Stars in Our Constellation feature. [2005]", "Studied with renowned acting coach Phil Gushee at Neighborhood Playhouse School of the Theatre, New York.", "His character Lt. Daniel Kaffee in A Few Good Men (1992) was based on real life United States Navy JAG Corp Donald Marcari, who now works as an attorney with Marcari, Russotto, and Spencer P.C. in Chesapeake, Virginia.", "The name Mapother is pronounced like \"MAY bother\", only with a P.", "Time magazine once described him as a \"baby-faced Christopher Reeve\".", "Ranked #14 on Premiere magazine's 2005 Power 50 list. He was the highest ranked actor on the list.", "(June 17, 2005) Engaged to actress Katie Holmes.", "Proposed to Katie Holmes at the Eiffel Tower in Paris", "Was the original choice for the role of Tom Ripley in The Talented Mr. Ripley (1999).", "Emilio Estevez served as best man at his wedding to Mimi Rogers.", "Celebrated his 43rd birthday atop the holiday box office with War of the Worlds (2005).", "His May 2005 appearance on The Oprah Winfrey Show (1986) was named the #1 \"Celebrity Meltdown Ever\" by TV Guide magazine.", "Owns and operates \"Montana Miss\" a World War II P-51 Mustang.", "He and his former girlfriend Penélope Cruz appeared together in Vanilla Sky (2001)", "He and ex-wife Nicole Kidman made three movies together: Days of Thunder (1990), Far and Away (1992) and Eyes Wide Shut (1999). They met on the set of Days of Thunder (1990).", "While attending the London premiere of War of the Worlds (2005), he was squirted in the face with water during a prank interview. His reaction on camera was stern but not livid. The culprit was charged with assault.", "He starred in two movies featuring the song \"Iko Iko\" on its soundtrack: Rain Man (1988) by The Belle Stars and Mission: Impossible II (2000) by Zap Mama.", "Is a huge fan of British singer Joss Stone.", "Has played a soldier in eight movies: Taps (1981), Top Gun (1986), Born on the Fourth of July (1989), A Few Good Men (1992), The Last Samurai (2003), Valkyrie (2008) Jack Reacher (2012) and Edge of Tomorrow (2014).", "Has worked with an impressive list of master filmmakers: Stanley Kubrick, Martin Scorsese, Brian De Palma, Francis Ford Coppola, Oliver Stone, Ridley Scott, Tony Scott, Paul Thomas Anderson, Cameron Crowe, Michael Mann, Robert Redford, Rob Reiner and Steven Spielberg.", "Tom and Katie Holmes became the parents of Suri Cruise, who was born on April 18, 2006 in Los Angeles, California. Suri weighed 7 lbs. 7 oz. and was 20 inches.", "In the past twenty years since his first hundred million dollar grosser (Top Gun (1986)), only six of his films have failed to reach that status.", "Was originally to star in Enemy of the State (1998), but scheduling conflicts with Eyes Wide Shut (1999) forced him to miss out on the film. His role went to Will Smith.", "He wears a mask in six movies. In all of the first three Mission: Impossible movies, Eyes Wide Shut (1999), Vanilla Sky (2001) and Minority Report (2002), where the injection that makes his face disfigured can be considered as a futuristic mask.", "Topped Forbes magazine's \"100 Top Celebrities\" list in 2006 ahead of The Rolling Stones and Oprah Winfrey. [June 2006]", "Ranked #14 on Premiere magazine's 2006 \"Power 50\" list. Had ranked #14 in 2005 as well. He was the highest ranked actor on the list.", "Stepfather of his children Isabella and Connor is Keith Urban", "Is talked about in the song \"Though the Wire\" by Kanye West.", "Ranked #1 in Forbes magazine's Celebrity 100 Who Made Bank. [2006]", "(August 22, 2006) Viacom Chairman Sumner Redstone announced through the \"Wall Street Journal\" that Viacom' Paramount subsidiary was terminating its development deal with Cruise after 14 years. Redstone said the firm terminated its deal with Cruise due to the under-performance of Mission: Impossible III (2006) (which had been expected to gross $100-150 million more than it did), which he attributed to Cruise's \"bad behavior\". Movie pundits were somewhat surprised by the announcement, as Cruise remains the top box office draw in North America and was Paramount's cash cow. Cruise's films reportedly have accounted for 32% of Paramount Pictures' revenues in the last six years, and he was named the Top Box Office draw for a record seventh time by Quigley Publications for the year 2005. As part of its machinations before severing its connections with Cruise, Paramount leaked to the press the information that the deal was worth $10 million annually; however, the development deal actually was for $3 million per annum. At the time of the announcement, Cruise and his advisers were considering Paramount's new offer of $2 million per year in development money when Redstone dropped this bombshell. The news gave rise to speculation that Paramount has run out of cash as it reportedly has told other development partners with which it has deals to use their own cash for the rest of the year, with the proviso they will be reimbursed come 2007.", "Tom visited actress Brooke Shields at her home and personally apologized to her for criticizing her in 2005 about her use of prescription medication to overcome her postpartum depression. Touched by the gesture, Brooke accepted his apology. [September 2006]", "He once shared a record with Tom Hanks as the actor to star in the most consecutive $100 million-grossing movies (7). Both were surpassed by Will Smith who reached eight in 2008.", "Resurrected United Artists together with Metro-Goldwyn-Mayer executives to produce and star in some of the company's projects. [November 2006]", "The years of birth of his wives are 11 years apart: Mimi Rogers was born in 1956, Nicole Kidman in 1967 and Katie Holmes in 1978.", "(November 18, 2006) Although they officialized their marriage in Los Angeles prior, he and Katie Holmes celebrated their wedding in the Odescalchi castle in Bracciano, Italy. The ceremony was performed by a Scientology minister in front of more than 150 relatives and friends including Hollywood superstars such as Jim Carrey, John Travolta, Kelly Preston, Russell Crowe, Will Smith, Jada Pinkett Smith, Richard Gere, Brooke Shields, Jennifer Lopez, Marc Anthony and Kirstie Alley. Italian pop opera purveyor Andrea Bocelli serenaded the newlyweds.", "He and Katie Holmes both wore Armani at their wedding.", "He and Katie Holmes honeymooned in the Maldives.", "Best Man at his wedding to Katie Holmes was his best friend David Miscavige.", "Once lived in Ottawa, Ontario, Canada and attended the same high school as Bryan Adams.", "Donated to Hillary Clinton's electoral campaign for the U.S. Senate together with his then wife Nicole Kidman (2000).", "Was considered for the lead role in Crimson Tide (1995), which went to Denzel Washington.", "Mentioned in the song \"High School Never Ends\" by Bowling For Soup.", "Was considered for the lead role of Reign Over Me (2007), which went to Adam Sandler.", "According to Forbes magazine, for each dollar he got paid, Cruise's movies averaged $11 of gross income. [December 2007]", "Attended St. Raphael the Archangel Elementary School in Louisville, Kentucky.", "(December 2, 2007) Although the shooting of Valkyrie (2008) caused controversy in Germany due to his Scientology membership, he was awarded at the Bambi Awards for \"Courage\", a category, newly created by the organizers to honor him for \"tackling a story that had never been covered by Hollywood before\". The decision was also heavily criticized by journalists and politicians.", "The Japan Memorial Day Association declared October 10, 2006 \"Tom Cruise Day\".", "Due to his friendship with David Beckham, he became a supporter of Spanish soccer club Real Madrid.", "When attending a Franciscan seminary in Cincinnati, he aspired to become a priest.", "Tom's father was of one quarter Irish and one half German ancestry, with the remainder being English and Welsh, going back to Colonial American times. Tom's mother was of three eighths German and five eighths Irish ancestry.", "Was introduced to Scientology by his ex-wife Mimi Rogers.", "In 2007, Forbes magazine estimated his earnings for the year to be $31 million.", "Mentioned in the song \"Faudrait leur dire\" by the French rap band 3eme oeil.", "Listed at Number 7 on \"The Top 10 Box Office Moneymakers of 2007\".", "Is the only actor to ever work with all of the following directors; Oliver Stone in Born on the Fourth of July (1989), Martin Scorsese in The Color of Money (1986), Stanley Kubrick in Eyes Wide Shut (1999), and Steven Spielberg in Minority Report (2002).", "Has married two actresses who played Batman's love interest. Nicole Kidman from Batman Forever (1995) and Katie Holmes from Batman Begins (2005).", "Is reportedly a huge fan of The Simpsons (1989). However, he has twice turned down guest roles; once for the part of \"Tom\", which was written specifically for him, in The Simpsons: Brother from the Same Planet (1993) (eventually voiced by regular Phil Hartman) and the other alongside his then-wife Nicole Kidman in The Simpsons: When You Dish Upon a Star (1998) (eventually voiced by then-couple Alec Baldwin and Kim Basinger).", "Was considered for the lead role in End of Days (1999), which went to Arnold Schwarzenegger.", "Was going to play as Tom Warshaw in House of D (2004) and opted to do War of the Worlds (2005) instead.", "In 1974, when Cruise was 12, his parents divorced.", "Has attended Harvard Law School in two drama movies: A Few Good Men (1992) and The Firm (1993).", "Was considered for the role of Frank Roberts in The Indian Runner (1991), which went to Viggo Mortensen.", "Went to an audition for the role of Howard Keach in Harry & Son (1984). He did not get the role, but the director, Paul Newman remembered him, and decided that he wanted Cruise for The Color of Money (1986).", "His acting idol is Paul Newman. Much to the delight of Cruise, they became good friends during work on The Color of Money (1986). Newman got him into racing, and Cruise ultimately raced on his team.", "He became good friends with Sean Penn and Timothy Hutton during the making of Taps (1981).", "Nine actors so far have got an Oscar nomination for their role in a movie co-starring Tom Cruise. Paul Newman, Mary Elizabeth Mastrantonio, Dustin Hoffman, Jack Nicholson, Holly Hunter, Cuba Gooding Jr., Ken Watanabe, Jamie Foxx and Robert Downey Jr..", "From late January to early February 2009, he along with wife, Katie Holmes and daughter, Suri, spent several days in Rio de Janeiro, Brazil staying at the famous Copacabana Palace Hotel. They were in town for a vacation (which included a helicopter tour over Rio) as well as to promote his film Valkyrie (2008).", "On January 25, 2009, he visited Moscow, Russia for the first time. He told the press that since he was a boy he had always dreamed of visiting the city. He stayed at the prestigious Ritz-Carlton which offered sweeping views of the Red Square, Bolshoi Theatre and the History Museum.", "Still owns a P-51D Mustang, but changed the nose art from \"Montana Miss\" to \"Kiss Me Kate\". Airplane is very rarely spotted out of hanger.", "In both Rain Man (1988) and The Firm (1993), he portrays a man with an older brother named Raymond, who he helps free from a confined environment.", "On January 28, 2010, he hired Amanda Lundberg as his new publicist, replacing the public relations firm Rogers & Cowan.", "Even though the Mission: Impossible series is his signature action series, he never actually fires a gun in the original film.", "Attended Princess Diana's funeral with, his then-wife, Nicole Kidman.", "It was announced on June 29, 2012, that, after five years of marriage, Cruise and his wife, Katie Holmes, are divorcing for personal and private reasons.", "He was awarded a Star on the Hollywood Walk of Fame at 6912 Hollywood Boulevard in Hollywood, California on October 16, 1986.", "His attorney is Bert Fields.", "Insists on performing many of his own stunts in his films, including climbing the exterior of the Burj Khalifa, the tallest building in the world, during the filming of Mission: Impossible - Ghost Protocol (2011), and driving during the car chases in Jack Reacher (2012).", "His features and good looks were the model for the Disney character Aladdin (1992).", "On April 3, 2013, Tom was presented with a Certificate of Irish Heritage by the Irish government in Dublin, Ireland. His Irish roots can be traced back 840 years to the arrival of the Norman lord Strongbow in Ireland. The knights in Tom's family were among the first wave of Anglo-Normans to invade Ireland between 1169 and 1176. Because the family-held land directly of the King, they were royal tenants, and by the early 1200s the de Cruise family were Barons in Ireland. Sir Maurice Cruys, a knight who died in 1216, is a direct ancestor of Tom's family. One of the lands they owned was called Hollywood in North County Dublin. They also had land in Meath; the civil parish of Cruicetown (in the parish of Nobber) was named after them.", "Was Guillermo del Toro's first choice for the role of Stacker Pentecost in Pacific Rim (2013), but Cruise declined due to schedule conflicts with Oblivion (2013). Idris Elba was cast instead.", "Attended the premiere of Mission: Impossible - Ghost Protocol (2011) premiere at the Cine Lagoon in Rio de Janeiro, Brazil on December 14, 2011.", "Attended the premiere of Valkyrie (2008) in Mexico City, Mexico in February 5, 2009.", "Attended the premiere of Mission: Impossible III (2006) in Paris, France. [April 2006]", "Along with Cameron Diaz, he attended the premiere of Knight and Day (2010) at Roppongi Hills in Tokyo, Japan on September 28, 2010.", "Attended the second Rome Film Festival in Italy. [October 2007]", "Attended the premiere of Mission: Impossible III (2006) in Tokyo, Japan. [June 2006]", "Attended the international premieres for Valkyrie (2008) in Rome, Italy (Jan. 28th); Madrid, Spain (Jan. 27th); Moscow, Russia (Jan. 26th); Amsterdam, Netherlands (Jan. 22nd); London, England (Jan. 21st); Berlin, Germany (Jan. 20th), and Seoul, South Korea (Jan. 18th). [January 2009]", "Along with co-star Cameron Diaz, he visited Rio de Janeiro, Brazil briefly (less then 24 hrs) to promote their latest film, Knight and Day (2010) on July 6, 2010.", "Attended the premiere of Knight and Day (2010) at the Cinemex Santa Fe in Mexico City, Mexico on July 7, 2010.", "As of 2014, has appeared in four films that were nominated for the Best Picture Oscar: Rain Man (1988), Born on the Fourth of July (1989), A Few Good Men (1992) and Jerry Maguire (1996). Rain Man (1988) won in the category.", "His huge fans call themselves \"Cruisers\".", "Both Tom Cruise and Ving Rhames are the only actors to have appeared in all five installments of the Mission: Impossible films series from 1996 through 2015.", "Revealed to People magazine in 2010, that his first celebrity crush was Ingrid Bergman in Notorious (1946). He chose an Ingrid Bergman lookalike, Rebecca Ferguson, to be his co-star in Mission: Impossible - Rogue Nation (2015) after he saw her in The White Queen (2013). Ferguson's character in \"Rogue Nation\" is named Ilsa, just like Bergman's character in Casablanca (1942).", "Tom Cruise was considered to play Henry Hill in Goodfellas (1990), which eventually went to Ray Liotta.", "All of his ex-wives are significantly taller than he is: Mimi Rogers is 5'8 1/2\" (1.74 m); Nicole Kidman is 5'11\" (1.80 m); and Katie Holmes is 5'9\" (1.75 m), while he himself is 5'7\" (1.70 m).", "As a child, he was used as kissing practice by his sister Lee Anne's friends.", "Worked with Christopher McQuarrie on Edge of Tomorrow (2014) and Mission: Impossible - Rogue Nation (2015); both are set in West London.", "Emily Blunt called Tom Cruise a Chatty Cathy at a premiere for Edge of Tomorrow (2014).", "Cruise did all his own stunts on Edge of Tomorrow (2014); Doug Liman felt he could make an amazing career out of it.", "Doug Liman felt he needed to keep up with Tom Cruise all throughout filming Edge of Tomorrow (2014).", "Emily Blunt thought it was fun to work with Cruise on Edge of Tomorrow (2014) because it was a challenging shoot and the exo-suits were arduous to wear every day.", "Sky Movies dedicated a whole channel to his movies in 2015, which was a world first.", "He was offered the lead role in Footloose (1984), but turned it down in order to star in All the Right Moves (1983).", "Has spent the last few years in big budget fantasy projects like Oblivion (2013) and Edge of Tomorrow (2014).", "During filming on Edge of Tomorrow (2014), Emily Blunt took Cruise and Doug Liman out for karaoke one night; she terrified Liman by getting to see her in that different light.", "It was his idea to do three film premieres for Edge of Tomorrow (2014) all in one day; his co-star Emily Blunt said it was harder on her because she needed a different dress, makeup and hairdo for each one, while all he needed was a new suit, but still said they were a lot of fun. One of the premieres was at 5am and it was wet; director Doug Liman said that was a testament to Cruise's star power. For the film's London premiere, Cruise landed a helicopter in Trafalgar Square.", "In the novel that inspired Edge of Tomorrow (2014), the author used the word Valkyrie, and Cruise was in the film of the same name; also, his character in the book won the order of the Valkyrie.", "He has worked with 8 Best Director Oscar-winners: Francis Ford Coppola, Martin Scorsese, Barry Levinson, Oliver Stone, Ron Howard, Sydney Pollack, Steven Spielberg, and Robert Redford.", "Good friends with: Steven Spielberg, Will Smith, David Beckham, Ben Stiller, Adam Sandler, and Jamie Foxx.", "Terminator 2: Judgment Day (1991) Was released on his 29th birthday. Phenomenon (1996) and Independence Day (1996) were released on his 34th birthday. He was offered a role in the latter.", "Was considered for the role of Vincent Mancini in The Godfather: Part III (1990).", "He was originally wanted for the film, Cold Mountain (2003).", "In the film, Rain Man (1988), the number \"3762\", seen on the windscreen of a car, is Tom's birthday - 3 July '62.", "His mother Mary Lee South died in her sleep. [February 2017]", "Says Vanilla Sky (2001) is the best film he's done.", "He is the only actor to have worked with both Steven Spielberg, and Stanley Kubrick.", "In 2000, he bought the screen rights to \"Heartswap\", Celia Brayfield's book about partner-swapping, for his wife, Nicole Kidman, to star in.", "Born on the same date as Hunter Tylo and Thomas Gibson.", "All three of his ex-wives were 34 when they divorced him.", "He was nominated for the 2017 New Jersey Hall of Fame in the Performing Arts category.", "He has played members of every branch of the United States Military, except the air force: He was a Naval aviator in Top Gun (1986), a member of the Marine Corps in Born on the Fourth of July (1989), a lawyer for the Navy in A Few Good Men (1992) and a member of the Army in Edge of Tomorrow (2014).", "Dated Cher and Sofía Vergara.", "During the Days of Thunder (1990) shoot in Florida on Mother's Day, Tom took his mom on a skydiving expedition where he was training in DeLand (FL) where they both jumped in tandem and had the entire descent recorded on video. Nobody in his family were ever told about the planned dive until they each received a Fedexed copy of the VHS tape.", "Was the first choice for the Bollywood film Dilwale Dulhania Le Jayenge (1995), when it was supposed to be made in English. The role eventually went to Shah Rukh Khan.", "He has appeared in one film that has been selected for the National Film Registry by the Library of Congress as being \"culturally, historically or aesthetically\" significant: Top Gun (1986).", "He and Jack Nicholson are the only actors to have worked with both Stanley Kubrick and Martin Scorsese."], "filmography": ["Luna Park ()", "Untitled Tom Cruise/SpaceX Project ()", "Live Die Repeat and Repeat ()", "Mission: Impossible 8", "Mission: Impossible 7", "Top Gun: Maverick", "Au Revoir, Chris Hemsworth", "Mission: Impossible - Fallout", "American Made", "The Mummy", "Jack Reacher: Never Go Back", "Mission: Impossible - Rogue Nation", "Edge of Tomorrow", "Oblivion", "Jack Reacher", "Rock of Ages", "Mission: Impossible - Ghost Protocol", "Knight and Day", "Valkyrie", "Tropic Thunder", "Lions for Lambs", "Mission: Impossible III", "War of the Worlds", "Collateral", "The Last Samurai", "Austin Powers in Goldmember", "Minority Report", "Vanilla Sky", "Mission: Impossible II", "Magnolia", "Aimee Mann: Save Me", "Eyes Wide Shut", "Jerry Maguire", "Mission: Impossible", "Interview with the Vampire: The Vampire Chronicles", "The Firm", "A Few Good Men", "Far and Away", "Days of Thunder", "Born on the Fourth of July", "Rain Man", "Cocktail", "The Color of Money", "Top Gun", "Legend", "All the Right Moves", "Risky Business", "Losin' It", "The Outsiders", "Taps", "Endless Love"]}