{"name": "Juliet Reeves London", "current role": "Front Point Receptionist", "birth name": "Juanita Diana Reeves", "birth date": "1978-09-12", "birth place": "Andrews, West Texas, USA", "height": "5' 3½\" (1.61 m)", "biography": "Juliet Reeves began performing at a very early age, with her family, in a traveling Circus. Juliet studied acting at \"Art Sake Studio\" in Winter Park, Florida, \"The Dee Wallace Stone Studio\" in Los Angeles and \"The Working Actors Studio\" in Tampa, Florida.Juliet Reeves has been acting in film for only a few short years but, in this time, has been the leading lady in over a dozen feature length indie films and several short films. Making a strong start in the low-budget horror film industry, where she garnered \"Scream Queen\" status for her level of intensity in these roles. She has since gone on to appear, in smaller roles, in major motion pictures, such as Abraham Lincoln: Vampire Hunter (2012) and has most recently wrapped a guest starring role on HBO's Emmy-winning series, Treme (2010). With a leading role in a unconventional, soon-to-be-released feature film shot in the Summer of 2011, in which Juliet is not only the lead but must carry the movie, nearly on her own, as she appears in every scene of the film, a survival tale. 2012 is proving to be off to a great start and she is working hard and is poised to be a successful player in the industry.::unknown", "trade mark": " ", "trivia": ["Took some time off after her son was born 2008-2010.", "Has photo doubled for Kate Beckinsale and Jennifer Aniston.", "Had a scene, with Nicolas Cage in the film, Season of the Witch (2011), that was deleted from the final edit.", "Has a strong improvisation background and was a member of Groundlings.", "Played Mary Elizabeth Winstead's sister in Abraham Lincoln: Vampire Hunter (2012).", "(June 3, 2014) Married her boyfriend of a year Jeremy London.", "Gave birth to her 2nd child at age 35, a son Wyatt London on June 5, 2014. Child's father is her husband, Jeremy London.", "First child, a son, Presley Elliott born August 13, 2008.", "Sister-in-law of Jason London."], "filmography": ["The Mangled ()", "The Dreamfactory", "Cornbread Cosa Nostra", "Branded", "Monsters Anonymous", "Girl in Woods", "The Big Short", "Category 5", "Barefoot", "The Hunger Games: Catching Fire", "Dallas Buyers Club", "Now You See Me", "Texas Chainsaw", "Tennessee Queer", "Treme", "The Iceman", "Common Law", "Abraham Lincoln: Vampire Hunter", "Lay the Favorite", "Illumination", "Purdie & Pepper", "Peripheral", "Second Coming", "Zombies! Zombies! Zombies!", "All Wrapped Up", "Automaton Transfusion", "Larry the Cable Guy: Health Inspector", "Girlfriends", "The Lunar Pack", "CSI: Miami"]}