{"name": "Lennox Lewis", "current role": "Boxing Opponent", "birth name": "Lennox Claudius Lewis", "birth date": "1965-09-02", "birth place": "London, England, UK", "height": "6' 5\" (1.96 m)", "biography": "After a long amateur career that included a gold medal winning performance in the 1988 Seoul Olympics that came in the form of a KO of 'Riddick Bowe' (who also went on to win the world heavyweight crown), former undisputed world heavyweight boxing champion Lennox Lewis turned professional in 1989. His 2 round win over Canadian boxer Donnovan Ruddock in Oct of 1992 gained him recognition as a threat among the tough heavyweight ranks. Lewis, a citizen of England and Canada, was slated for a shot at the winner of Evander Holyfield vs Riddick Bowe. Bowe, a victim of a brutal knockout suffered at the hands of Lewis in the amateur ranks, refused to live up to his end of the bargain by not giving Lewis a well-deserved title shot and infamously tossed the WBC title in a garbage bin. This act prompted the WBC commission to strip Bowe and crown Lewis as the new WBC champion. Lennox Lewis went on to defend the crown for several fights until he was defeated by Oliver McCall in 2 rounds in Sept of 1994. Lewis, with the help of new trainer Emanuel Steward, came back and began tearing his way through the ranks of the heavyweight division. Lewis was again denied a title shot when champion Mike Tyson relinquished his WBC title to fight Evander Holyfield rather than risk his titles against Lewis. Lewis recaptured the vacant WBC title by beating his conquerer Oliver McCall in a rematch. Lewis, after defeating every top contender thrown his way, was given his shot at Evander Holyfield in a championship unification fight on March 13, 1999. Lewis dominated the fight but due to controversial judging, the bout was declared a draw. Lewis defeated Evander Holyfield in a rematch on Nov 13, 1999 to become undisputed world champion. Due to promoter Don King's underhanded tactics, the WBA belt was stripped from Lewis in court. Lewis went on to beat every mandatory challenger while keeping his crown. While avidly issuing challenges to reluctant contender Mike Tyson, Lewis went to Johannesburg in South Africa at the invitation of Nelson Mandela. Lewis would defend his titles against supposed low-risk opponent Hasim Rahman. Due to Lewis' failure to prepare for the fight by dropping excessive weight rapidly, arriving in Johannesburg 2 weeks before the fight which, according to expert opinion, was too late to acclimatize to the thin air since Johannesburg was 5,000 feet above sea level, Lewis suffered one of the biggest upsets in boxing history. However, Lewis has had his rematch with Hashim Rahman and won the title back, and he also fought Mike Tyson and beaten him 'easily' in 8 rounds.::Kevin Buchan<buchan_kevin@hotmail.com", "trade mark": " ", "trivia": ["He was awarded the M.B.E. (Member of The Order of The British Empire) in the 1999 Queen's New Years Honours List and the C.B.E. (Commander of the Order of the British Empire) in 2002 Queen's Birthday Honours List for his services to Boxing.", "After defeating Mike Tyson, he took a years leave from boxing, causing people to question whether he would totally retire. He made his return to the boxing ring on June 21st 2003 when he fought Vitali Klitschko. Lewis stopped Vitali in the 6th Round by way of TKO after the ringside doctor declared a cut to Vitali's left eye limited his vision. Vitali claims he was head-butted and is demanding a rematch. Slow Motion Video shows the cuts to Vitali's face were caused by right hands in rounds 3 and 6. Lewis now looks likely to have one last fight with Roy Jones Jr. before hanging up his gloves.", "First child, son Landon, born in June 2004.", "Second child, a daughter, born May 20th, 2006.", "Attended Cameron Heights Collegiate Institute in Kitchener, Ontario, Canada.", "He was awarded the C.M. (Member of the Order of Canada) on November 17, 1988 for his services to Boxing.", "The Sunday Times List estimated his net worth at $147 million. [2009]", "Announced his retirement from boxing stating he \"had nothing left to prove.\" [February 2004]"], "filmography": ["Winter's Inferno ()", "Johnny Was", "Entourage", "Ocean's Eleven", "R. Kelly: Feelin' on Yo Booty", "Arli$$", "HBO: Tea Time", "The Real McCoy"]}