{"name": "Sue-Lynn", "current role": "Swimmer", "birth name": " ", "birth date": " ", "birth place": " ", "height": "5' 4\" (1.63 m)", "biography": "Sue-Lynn has studied Film and Television for much of her life, being one of the youngest college entered students of the 90's entering at age 11 then earning a degree at age 15. Aside from her education Sue-Lynn grew up in California from the age of 3 competing in Rodeos, Varsity Swimming, 4-H, Musical Theater, Ballet, Martial Arts, and conservation efforts. She has always had a deep love and respect for the craft of entertainment in TV/Film and has hailed her heroes of the screen: Steven Spielberg, Robin Williams, Nichelle Nichols, Gene Roddenberry, Kenneth Branagh, Danny Boyle, Maureen O'Hara, and Tim Burton. The last 5 years Sue-Lynn has had a highly active career in Film and television having worked over 60 productions in the southeast: acting, stunt acting, doubling, and production side on occasion. One of Sue-Lynn's greatest achievements was working for Roddenberry Productions during the 2008-2009 years. She organized all the Trek scripts, help build their online time-line of all things Star Trek, and frequently sent scripts to JJ Abrams office. She joined the company just one month before Majel Barrett Roddenberry passed who was a significant female figure for her in TV Film history. Sue-Lynn hopes to entertain the world with her stories, craft, and works for years to come.::Smytha Forest", "trade mark": " ", "trivia": ["She has played music and shared the stage with Johnny Cash's Family.", "Has a first degree black belt in Shotokan and has studied Tai Kwon Do, and Kung Fu."], "filmography": ["Red, White and Water", "Reminiscence", "Filthy Rich", "Capone", "Body Cam", "Jay and Silent Bob Reboot", "Claws", "The Perfect Date", "The Dirt", "Five Feet Apart", "The First", "NCIS: New Orleans (2015-2018)", "Geostorm", "Carter & June", "Jack Reacher: Never Go Back", "Deepwater Horizon", "Quarry", "When the Bough Breaks", "Kickboxer: Vengeance", "The Duel", "Keanu", "Misconduct", "The Free World", "Daddy's Home", "The Big Short", "One Mississippi", "The Hunger Games: Mockingjay - Part 2", "The Walking Dead", "Invisible Sister", "Navy Seals vs. Zombies", "Fantastic Four", "Joe Dirt 2: Beautiful Loser", "The Astronaut Wives Club", "Scream Queens", "Zoo", "Jurassic World", "A Walk in the Woods", "Survivor's Remorse", "The Song", "Boulevard", "Nashville", "The Game", "Pimp 24/7"]}