{"name": "Michael Bloomberg", "current role": "Self", "birth name": "Michael Rubens Bloomberg", "birth date": "1942-02-14", "birth place": "Boston, Massachusetts, USA", "height": "5' 7\" (1.7 m)", "biography": "Michael R. Bloomberg is an entrepreneur and philanthropist who served three terms as Mayor of the City of New York.Michael Rubens Bloomberg was in Boston, the son of Charlotte (Rubens) and William Henry Bloomberg, an accountant. He is of Russian Jewish descent. He was raised in a middle class home in Medford, Massachusetts. Michael attended Johns Hopkins University, where he paid his tuition by taking out loans and working as a parking lot attendant. After college, he attended Harvard Business School and in 1966 was hired by a Wall Street firm, Salomon Brothers, for an entry-level job.Bloomberg quickly rose through the ranks at Salomon, overseeing equity trading and sales before heading up the firm's information systems. When Salomon was acquired in 1981, he was let go from the firm. With a vision of an information technology company that would bring transparency and efficiency to the buying and selling of financial securities, he launched a small startup in a one room office. Today, Bloomberg LP is a global company that has more than 15,500 employees and offices in 73 countries around the world.During his tenure as mayor, from 2002 through 2013, Bloomberg brought his innovation-driven approach to city government. He turned around a broken public school system by raising standards and holding schools accountable for success. He spurred economic growth and record levels of job creation by revitalizing old industrial areas, spurring entrepreneurship, supporting small businesses, and strengthening key industries, including new media, film and television, bio-science, technology, and tourism. Mayor Bloomberg's economic policies helped New York City experience record-levels of private-sector job growth often in formerly depressed neighborhoods, even in the wake of the deep national recession.His passion for public health led to ambitious new strategies that became national models, including a ban on smoking in all indoor workplaces, as well as at parks and beaches. Life expectancy grew by 36 months during Mayor Bloomberg's twelve years in office. He launched cutting-edge anti-poverty efforts, including the Young Men's Initiative and the Center for Economic Opportunity, whose ground-breaking programs have been replicated across the country. As a result, New York City's welfare rolls fell 25 percent, and New York was the only big city in the country not to experience an increase in poverty between the 2000 Census and 2012. He also created innovative plans to fight climate change and promote sustainable development, which helped cut the city's carbon footprint by 19 percent. His belief that America's mayors and business leaders can help effect change in Washington led him to launch national bi-partisan coalitions to combat illegal guns, reform immigration, and invest in infrastructure. He was a strong champion of the city's cultural community, expanding support for artists and arts organizations and helping to bring more than 100 permanent public art commissions to all five boroughs.Upon leaving City Hall, Michael Bloomberg returned to the company he founded while also devoting more time to philanthropy, which has been a top priority for him throughout his career. Today, Bloomberg Philanthropies employs a unique data-driven approach to global change that grows out of his experiences as an entrepreneur and mayor. In addition to Bloomberg Philanthropies' five areas of focus - public health, arts and culture, the environment, education, and government innovation - Bloomberg has continued to support projects of great importance to him, including his alma mater, Johns Hopkins University, where he served as the chairman of the board of trustees from 1996-2001. The university's School of Hygiene and Public Health - the largest public health facility in the U.S. - is named the Bloomberg School of Public Health in recognition of his commitment and support. Bloomberg has donated more than $4.3 billion to a wide variety of causes and organizations.As chair of the C40 Climate Leadership Group from 2010 to 2013, Bloomberg drew international attention to cities' leading role in the fight against climate change. In 2014, U.N. Secretary-General Ban Ki-moon appointed Bloomberg to be U.N. Special Envoy for Cities and Climate Change where he is focusing on helping cities and countries set and achieve more ambitious climate change goals. In 2016, Bloomberg accepted World Health Organization director-general Margaret Chan's invitation to serve as the WHO global ambassador for noncommunicable diseases as part of the WHO's push to achieve UN goals of reducing premature NCD deaths by one-third by 2030, and halving the number of road deaths and injuries by 2020.Michael Bloomberg is the father of two daughters, Emma and Georgina.::Michael Bloomberg", "trade mark": " ", "trivia": ["Founded Bloomberg Financial Markets [1981]", "Elected mayor of New York City. [November 2001]", "He is the father of Georgina Bloomberg and Emma Bloomberg.", "Release of Bloomberg financial documents in June 2002 shows he lost $500,000 on his investment as exec producer of Focus (2001).", "Has a building named after him at his alma mater, Johns Hopkins University.", "Member of the Phi Kappa Psi fraternity at Johns Hopkins Univerisity", "Reportedly donated $100 million to his alma mater, Johns Hopkins University.", "Has frequently referred to Medford, Massachusetts as his birthplace. In a 2006 interview with The New York Times, his mother confirmed that he was actually born at St. Elizabeth's Hospital in Boston's Brighton neighborhood.", "Sworn in as mayor of New York City [January 2002]", "As of 2016 his net worth is forty six billion dollars.", "Is a close friend of Paul McCartney and has recalled seeing the Beatles on the Ed Sullivan Show on February 9, 1964.", "He is the son of Charlotte (Rubens) and William Henry Bloomberg, an accountant. His father was born in Chelsea, Massachusetts and his mother was born in Jersey City, New Jersey.", "Three of his grandparents were Jewish emigrants from the Russian Empire, while his maternal grandmother was born in New York, to Russian Jewish parents.", "His mayoralty drew controversy due to a policy known as stop-and-frisk, wherein police officers would randomly search people. This policy overwhelmingly affected African-American and Latino residents."], "filmography": ["The Good Wife", "New Year's Eve", "Curb Your Enthusiasm", "The Adjustment Bureau", "30 Rock", "Law & Order"]}