{"name": "Michelle Williams", "current role": "Dolores", "birth name": "Michelle Ingrid Williams", "birth date": "1980-09-09", "birth place": "Kalispell, Montana, USA", "height": "5' 4\" (1.63 m)", "biography": "A small-town girl born and raised in rural Kalispell, Montana, Michelle Ingrid Williams is the daughter of Carla Ingrid (Swenson), a homemaker, and Larry Richard Williams, a commodity trader and author. Her ancestry is Norwegian, as well as German, British Isles, and other Scandinavian. She was first known as bad girl Jen Lindley in the television series Dawson's Creek (1998). She appeared in the comedy film Dick (1999), which was a parody of the Watergate Scandal along with Kirsten Dunst, as well as Prozac Nation (2001) with Christina Ricci. Since then, Michelle has worked her way into the world of independent films such as The Station Agent (2003), Imaginary Heroes (2004), and The Baxter (2005). But her real success happened in 2005 when she starred in Ang Lee's Brokeback Mountain (2005) as Alma Beers Del Mar. A woman who realizes her husband is in love with another man. Her talent shown in Brokeback Mountain (2005) landed her an Academy Award nomination for Best Supporting Actress. In 2011, she received her first lead role Academy Award nomination for Blue Valentine (2010). She followed this in 2012 with a lead role Academy Award nomination for My Week with Marilyn (2011).Michelle has a daughter, Matilda, with late Australian actor Heath Ledger.::Matt < mattjmoczygemba@aol.com>", "trade mark": "Blonde hair", "trivia": ["In 1999, she was chosen as one of Teen People Magazine's \"21 Hottest Stars Under 21.\"", "Loves reading in her spare time.", "Legally emancipated from her parents at age 15.", "Wrote a script called \"Don't Blink\" which was sold but never made.", "Collects rare books. Owns a first edition of The Great Gatsby amongst others.", "Was in a relationship with Conor Oberst (1999-2001). Some songs for his band, Bright Eyes, are about her.", "In 2000, she was on Entertainment Weekly's annual It List.", "At age 16, she won the Robbins Trading Company World Cup Championship of Futures Trading by turning $10,000 into $100,000. It is the second highest profit in the tournament's history.", "Dated singer/songwriter Andy Herod (of \"The Comas\") for two years. His latest album \"Conductor\" is about their relationship and his heartbreak after it ended. Michelle also features in the accompanying short film of the same name.", "Was roommates with Christina Ricci whilst filming Prozac Nation (2001) with her.", "Has one younger sister Paige and three older half siblings from her father's first marriage - Jason, Kelley, and Sara.", "Her father Larry is a Commodities Trader and is divorced from her mother Carla.", "In 2003, she was one of Elle Girl's 25 Favorite Hot, Young, Talented New Stars.", "Michelle and her fiancé Heath Ledger had a girl, Matilda Ledger, on October 28, 2005, in Brooklyn, New York.", "The godparents of her daughter, Matilda, are Jake Gyllenhaal (her Brokeback Mountain (2005) co-star) and Busy Philipps (her Dawson's Creek (1998) co-star).", "Her father Larry is a former Republican candidate for Montana State Senate.", "First cast-member of Dawson's Creek (1998) to receive an Oscar nomination.", "Was in a relationship with Heath Ledger, having met on the set of Brokeback Mountain (2005) (June 2004-September 2007). They were both nominated for Oscars for their performances in the film.", "Her ex-fiancé and father of her daughter Matilda, Heath Ledger, died on January 22, 2008.", "Was in a relationship with Spike Jonze, having met on the set of Where the Wild Things Are (2009) (July 2008-September 2009).", "Returned to work 5 months after giving birth to her daughter Matilda to begin filming The Hottest State (2006).", "Michelle's father is of one half Norwegian, one quarter German, and approximately one quarter English, ancestry, along with distant Scottish roots. Michelle's mother is of three eighths Norwegian descent, with Michelle's mother's other ancestry including Swedish, Swiss-German, Danish, English, Welsh, and Scottish.", "Resides in Boerum Hill, Brooklyn, New York.", "Katharine Hepburn is one of her favorite actresses.", "Received the Desert Palm Achievement Actress award at the Palm Springs International Film Festival on January 7, 2012.", "The longest she has gone without an Oscar nomination is 5 years, between Brokeback Mountain (2005) and Blue Valentine (2010).", "Living in Brooklyn, New York with her daughter, Matilda Ledger. [February 2009]", "Was offered the role of Miss San Antonio in Machete Kills (2013) but declined. The role went to Amber Heard.", "Was director Liv Ullmann's original choice to play the title role of Miss Julie (2014), but she had to drop out due to scheduling conflicts.", "Face of Louis Vuitton handbags and jewelry since 2013.", "Accepted the role of Glinda in Oz the Great and Powerful (2013) so that her daughter Matilda could watch a movie with her in it.", "Was on director Baz Luhrmann's shortlist for the role of Daisy Buchanan in The Great Gatsby (2013). The role went to Carey Mulligan.", "Was considered for the role of Helene in Burnt (2015). The role went to Sienna Miller.", "Was considered for the role of Daisy Domergue in The Hateful Eight (2015). Jennifer Jason Leigh was cast instead.", "Has starred in three films directed by Kelly Reichardt: Wendy and Lucy (2008), Meek's Cutoff (2010) and Certain Women (2016).", "Williams and her Shutter Island (2010) co-star, Leonardo DiCaprio, have both appeared in Lassie productions. DiCaprio appeared in two episodes of The New Lassie (1989) when he was 15 years old, while Williams made her film debut in Lassie (1994), when she was 13.", "Appeared in two films with Ryan Gosling: The United States of Leland (2003) and Blue Valentine (2010). They lived in the same house for four weeks while filming Blue Valentine in Carbondale, Pennsylvania.", "Two of her films premiered at the 2016 Sundance Film Festival: Manchester by the Sea (2016) and Certain Women (2016). She couldn't attend the festival because she was in rehearsals for the Broadway play \"Blackbird\".", "Nominated for the 2016 Best Leading Actress in a Play Tony Award for her performance in \"Blackbird\". She lost the award to Jessica Lange for her performance in \"Long Day's Journey into Night\".", "Is the most Oscar-nominated actor born in the '80s, with 4 nominations as of 2017.", "As of 2017, she has appeared in 2 films that have been Oscar nominated for Best Picture: Brokeback Mountain (2005) and Manchester by the Sea (2016).", "In 2013, she was set to star in The Double Hour, a remake of the Italian film The Double Hour (2009), alongside Joel Edgerton, but the project fell apart.", "Was once roommates with Jessica Chastain. They were both nominated for Oscars in 2012 and have remained good friends.", "Was cast for the role of Kay in Gold (2016), but dropped out and was replaced by Bryce Dallas Howard.", "Was originally cast as Dabney in Mid90s (2018), but dropped out due to scheduling conflicts with All the Money in the World (2017) and was replaced by Katherine Waterston.", "On March 2, 2017, Katy Perry used Michelle's platinum short hair as an inspiration for her new hairstyle. Perry posted on her official Instagram account a photo of Williams in her Fall/Winter 2013 Louis Vuitton campaign with the caption \"shout out to my inspo\".", "Michelle Williams, who plays Anne Weying, began acting at a young age, her first big role being in the 1994 Lassie (1994) movie when she was only 14. After that, she emancipated herself from her parents and relocated to Los Angeles, landing a steady role on Dawson's Creek (1998) in 1998.", "Michelle Williams is a critically-acclaimed actress who has been nominated for four Academy Awards. She has also won a Golden Globe for My Week with Marilyn (2011) and a Tony award for \"Blackbird.\".", "Michelle Williams spent her early childhood years in her birthplace of Kalispell, Montana discovering a love of nature. In a recent interview, Williams said that she hopes her daughter has a similar childhood \"exploring snake skins and arrowheads and cliffs and plants and abandoned houses, and having that sense of freedom and safety in the world.\".", "After becoming known for doing smaller independent films like Blue Valentine (2010), Michelle Williams surprised audiences by appearing in the musical The Greatest Showman (2017), and the comedy I Feel Pretty (2018) with Amy Schumer. In response to doing big budget movies like All the Money in the World (2017) or Venom (2018), Williams told \"Vanity Fair,\" \"I always like to do things I haven't done before-genres, parts. I like a challenge.\".", "(April 19, 2019) Had separated from her husband of 9 months Phil Elverum.", "She has appeared in one film that has been selected for the National Film Registry by the Library of Congress as being \"culturally, historically or aesthetically\" significant: Brokeback Mountain (2005).", "Gave birth to her second child at age 39 in June 2020. Child's father is her second husband, Thomas Kail.", "Was five months pregnant with her second child when she completed filming on Venom: Let There Be Carnage (2021)."], "filmography": ["Fever ()", "Showing Up ()", "Venom: Let There Be Carnage", "Fosse/Verdon", "After the Wedding", "Venom", "I Feel Pretty", "The Greatest Showman", "All the Money in the World", "Wonderstruck", "Certain Women", "Manchester by the Sea", "Suite Française", "Oz the Great and Powerful", "Cougar Town", "My Week with Marilyn", "Take This Waltz", "Meek's Cutoff", "Shutter Island", "Blue Valentine", "Mammoth", "Synecdoche, New York", "Wendy and Lucy", "Deception", "Incendiary", "I'm Not There", "The Hottest State", "The Hawk Is Dying", "Brokeback Mountain", "The Baxter", "Imaginary Heroes", "Land of Plenty", "A Hole in One", "Dawson's Creek (1998-2003)", "The Station Agent", "The United States of Leland", "Prozac Nation", "Me Without You", "Perfume", "If These Walls Could Talk 2", "But I'm a Cheerleader", "Dick", "Halloween H20: 20 Years Later", "A Thousand Acres", "Killing Mr. Griffin", "My Son Is Innocent", "Raising Caines", "Timemaster", "Species", "Home Improvement", "Step by Step", "Lassie", "Baywatch (1993-1994)"]}