{"name": "Leonardo DiCaprio", "current role": "Teddy Daniels", "birth name": "Leonardo Wilhelm DiCaprio", "birth date": "1974-11-11", "birth place": "Hollywood, Los Angeles, California, USA", "height": "6' (1.83 m)", "biography": "Few actors in the world have had a career quite as diverse as Leonardo DiCaprio's. DiCaprio has gone from relatively humble beginnings, as a supporting cast member of the sitcom Growing Pains (1985) and low budget horror movies, such as Critters 3 (1991), to a major teenage heartthrob in the 1990s, as the hunky lead actor in movies such as Romeo + Juliet (1996) and Titanic (1997), to then become a leading man in Hollywood blockbusters, made by internationally renowned directors such as Martin Scorsese and Christopher Nolan.Leonardo Wilhelm DiCaprio was born November 11, 1974 in Los Angeles, California, the only child of Irmelin DiCaprio (née Indenbirken) and former comic book artist George DiCaprio. His father is of Italian and German descent, and his mother, who is German-born, is of German and Russian ancestry. His middle name, \"Wilhelm\", was his maternal grandfather's first name. Leonardo's father had achieved minor status as an artist and distributor of cult comic book titles, and was even depicted in several issues of American Splendor, the cult semi-autobiographical comic book series by the late 'Harvey Pekar', a friend of George's. Leonardo's performance skills became obvious to his parents early on, and after signing him up with a talent agent who wanted Leonardo to perform under the stage name \"Lenny Williams\", DiCaprio began appearing on a number of television commercials and educational programs.DiCaprio began attracting the attention of producers, who cast him in small roles in a number of television series, such as Roseanne (1988) and The New Lassie (1989), but it wasn't until 1991 that DiCaprio made his film debut in Critters 3 (1991), a low-budget horror movie. While Critters 3 (1991) did little to help showcase DiCaprio's acting abilities, it did help him develop his show-reel, and attract the attention of the people behind the hit sitcom Growing Pains (1985), in which Leonardo was cast in the \"Cousin Oliver\" role of a young homeless boy who moves in with the Seavers. While DiCaprio's stint on Growing Pains (1985) was very short, as the sitcom was axed the year after he joined, it helped bring DiCaprio into the public's attention and, after the sitcom ended, DiCaprio began auditioning for roles in which he would get the chance to prove his acting chops.Leonardo took up a diverse range of roles in the early 1990s, including a mentally challenged youth in What's Eating Gilbert Grape (1993), a young gunslinger in The Quick and the Dead (1995) and a drug addict in one of his most challenging roles to date, Jim Carroll in The Basketball Diaries (1995), a role which the late River Phoenix originally expressed interest in. While these diverse roles helped establish Leonardo's reputation as an actor, it wasn't until his role as Romeo Montague in Baz Luhrmann's Romeo + Juliet (1996) that Leonardo became a household name, a true movie star. The following year, DiCaprio starred in another movie about doomed lovers, Titanic (1997), which went on to beat all box office records held before then, as, at the time, Titanic (1997) became the highest grossing movie of all time, and cemented DiCaprio's reputation as a teen heartthrob. Following his work on Titanic (1997), DiCaprio kept a low profile for a number of years, with roles in The Man in the Iron Mask (1998) and the low-budget The Beach (2000) being some of his few notable roles during this period.In 2002, he burst back into screens throughout the world with leading roles in Catch Me If You Can (2002) and Gangs of New York (2002), his first of many collaborations with director Martin Scorsese. With a current salary of $20 million a movie, DiCaprio is now one of the biggest movie stars in the world. However, he has not limited his professional career to just acting in movies, as DiCaprio is a committed environmentalist, who is actively involved in many environmental causes, and his commitment to this issue led to his involvement in The 11th Hour, a documentary movie about the state of the natural environment. As someone who has gone from small roles in television commercials to one of the most respected actors in the world, DiCaprio has had one of the most diverse careers in cinema. DiCaprio continued to defy conventions about the types of roles he would accept, and with his career now seeing him leading all-star casts in action thrillers such as The Departed (2006), Shutter Island (2010) and Christopher Nolan's Inception (2010), DiCaprio continues to wow audiences by refusing to conform to any cliché about actors.In 2012, he played a mustache twirling villain in Django Unchained (2012), and then tragic literary character Jay Gatsby in The Great Gatsby (2013) and Jordan Belfort in The Wolf of Wall Street (2013).DiCaprio is passionate about environmental and humanitarian causes, having donated $1,000,000 to earthquake relief efforts in 2010, the same year he contributed $1,000,000 to the Wildlife Conservation Society.::Pedro Borges", "trade mark": "Often appears in the films of Martin Scorsese", "trivia": ["(April 16, 1999) While filming The Beach (2000) off the coast of Thailand, Leonardo and others were swept off a camera boat by strong winds and waves. No one was injured.", "His first publicity spot was about MILK.", "In March 1998, he sued Playgirl magazine over plans to publish pictures -- including full frontal nudity -- of himself.", "Ranked #75 in Empire (UK) magazine's \"The Top 100 Movie Stars of All Time\" list. [October 1997]", "Was considering starring in a movie about actor James Dean, but turned down the role because he felt he wasn't experienced enough to do the film. [1996]", "Auditioned for the role of Dick Grayson/Robin in Batman Forever (1995), which went to 'Chris ODonnell.", "Chosen by People Magazine as one of the 50 Most Beautiful People in the World. [1998]", "Younger stepbrother of Adam Farrar.", "He and his family funded a state-of-the-art computer center at the Los Feliz branch of the Los Angeles Public Library, which was rebuilt after the 1994 Northridge earthquake.", "A Manhattan appeals court decided to go ahead with a $45 million lawsuit against DiCaprio by actor and screenwriter Roger Wilson for allegedly encouraging his friends in a street fight with Wilson over advances DiCaprio's friends made toward Wilson's girlfriend, Elizabeth Berkley, outside the midtown Manhattan restaurant Asia de Cuba in the early hours of May 4, 1998. In 2004, the lawsuit was dismissed. Judge Paula Omansky said the lawsuit could proceed against a fourth man, Todd Healy, who admitted to hitting Wilson, though Healy claimed the move was in self-defense when he thought he saw Wilson reaching for something, possibly a weapon. In dismissing the action against DiCaprio, the jurist said Healy never heard the actor's alleged remark, and therefore could not have been incited by it. [2000]", "At age 10, his agent advised him to change his name to a more American-friendly Lenny Williams. Needless to say, he did not follow that advice.", "Was initially set to star as Alan Jensen in Harvard Man (2001), but the film's low budget could not afford to pay his salary, so he dropped out and Adrian Grenier took the lead.", "Was initially cast as \"Patrick Bateman\" in American Psycho (2000) - for which he was reputedly offered over $20 million - but had to drop out due to scheduling conflicts. Christian Bale took the role instead.", "In January 1999, his lawyers filed an application to allow DiCaprio to copyright his own name.", "Attended Seeds Elementary School at UCLA where he took summer courses in performance art.", "Ranked #42 in Premiere's 2003 annual Power 100 List. Had ranked #74 in 2002 and #60 in 2001.", "Ranked #6 in Star TV's \"Top 10 Box Office Stars of the 1990s\" (2003).", "Childhood friends with Tobey Maguire and the late Christopher Pettiet.", "When his camera went missing, he offered a substantial reward of many thousands of pounds for its return. [November 2003]", "Openly supported John Kerry in the 2004 election. He went around 11 states and gave 20 speeches about the environment and how the Bush Administration has damaged it.", "Was offered the role of the porn star Dirk Diggler in Boogie Nights (1997) at around the same time as he was offered his role in Titanic (1997). The Dirk Diggler role eventually went to Mark Wahlberg.", "(December 23, 2004) Mentioned in an interview with Katie Couric that while filming The Aviator (2004), it brought back his own obsessive-compulsive disorder that he had as a child.", "He is an environmental conservationist and often advocates and supports natural causes.", "Was considered for the role of Peter Parker/Spider-Man in Spider-Man (2002), which went to Tobey Maguire.", "Filed police charges after being attacked with a bottle by a Canadian ex-model while leaving a private party. Although the wound was very close to his jugular vein, it was not expected to delay production on his latest movie. [June 2005]", "Won the role of Arthur Rimbaud in Total Eclipse (1995) after the death of actor River Phoenix in 1993.", "Robert De Niro and Jack Nicholson are his favorite actors.", "Was considered for the role of Anakin Skywalker for Star Wars: Episode II - Attack of the Clones (2002), which went to Hayden Christensen.", "He and Jason Robards received Oscar-nominations for portraying Howard Hughes. Robards played Hughes in Melvin and Howard (1980) and Leonardo played him in The Aviator (2004)", "Was originally cast in The Good Shepherd (2006).", "Very good friends with actresses Kate Winslet and Marion Cotillard and actors Tom Hardy and Vincent Gallo.", "He once said that playing Arnie in What's Eating Gilbert Grape (1993) was \"the most fun I've ever had\".", "Has appeared on the television series Parenthood (1990), in the role originally played by Joaquin Phoenix. In the original film, Phoenix's grandfather is played by Jason Robards, who, like DiCaprio, has played Howard Hughes.", "He purchased a 104-acre island off the coast of Belize in 2005 and plans to develop a resort with renewable energy sources. Purchase price for the island, Blackadore Caye, was estimated to be $1.75 million.", "Good friends with Lukas Haas, Mark Wahlberg Kevin Connolly, and Alan Thicke.", "In 2006 in \"The Independent\", he named his ten favorite movies as: Bicycle Thieves (1948), Taxi Driver (1976), Lawrence of Arabia (1962), 8½ (1963), The Third Man (1949), Yojimbo (1961), Sunset Blvd. (1950), The Shining (1980) and East of Eden (1955).", "Was cast in the title role for Baz Luhrmann's doomed \"Alexander the Great\" project.", "In his childhood, he and his mother lived in poor neighborhoods in Los Angeles which he describes as \"Ghettos of Hollywood\".", "Early in his career he appeared as a contestant on a game show called \"Fun House\" where stunts were performed - his involved trying to catch fish in a small pool with only his teeth.", "Attended the Los Angeles Center for Enriched Studies and, later, John Marshall High School in Los Feliz. Other JMHS alums include Bo Barrett, Heidi Fleiss, Jon Park, Anne-Marie Johnson and Julie Newmar. DiCaprio dropped out of Marshall High, but later earned his GED.", "Turned down Michael Pitt's role in The Dreamers (2003) because he felt he was too old to play a twenty-year-old student.", "Was trained by renowned Hollywood Gun Coach Thell Reed, who has also trained such actors as: Brad Pitt, Val Kilmer, Edward Norton, Russell Crowe, Ben Foster and Girard Swan.", "Has once said his favorite female performance is Gena Rowlands' Mabel Longhetti in A Woman Under the Influence (1974).", "Has said his two favorite performances are Robert De Niro's Travis Bickle in Taxi Driver (1976) and James Dean's Cal Trask in East of Eden (1955).", "Martin Scorsese is his favorite director.", "Named #36 on Empire Magazine's 100 Sexiest Movie Stars (2007).", "His German grandmother died at age 93 in August 2008.", "Has a Dutch song about him called \"Ik ben verliefd op Leonardo DiCaprio/I'm in love with Leonardo DiCaprio\" by Flemish girl band K3 (Kathleen Aerts, Karen Damen, and Kristel Verbeke).", "His father, George DiCaprio, is of German and Italian ancestry and is an underground writer, editor and distributor of comic books. His mother, Irmelin DiCaprio, is of German and Russian ancestry and a former legal secretary.", "In 1994, he became the seventh youngest actor ever to be nominated for an Academy Award for Best Supporting Actor at age 19. He was nominated for his performance in What's Eating Gilbert Grape (1993).", "When he was a child, his favorite films were Willy Wonka & the Chocolate Factory (1971), Watership Down (1978), and Bedknobs and Broomsticks (1971).", "Thanked by Blink-182 in the liner notes of their album \"Enema of the State\".", "Ranked #8 on VH1's 40 Hottest Hotties of the '90s.", "DiCaprio, along with Kate Winslet and director James Cameron, publicly pledged to support the financial future of the last living Titanic survivor, Millvina Dean, after it was reported that she had been forced to sell her mementos to pay for nursing home bills. [May 2009]", "Bought Kate Winslet an inscribed gold ring, after they finished filming Revolutionary Road (2008) together. However, Winslet keeps the inscription a secret.", "Campaigned for the role of John Dillinger in Public Enemies (2009), but Johnny Depp was cast in the role instead.", "He stated in a Rolling Stone interview that in his younger years his mother took him to Germany about 10 times to visit his grandmother.", "Quentin Tarantino considered casting Leo as SS Colonel Hans Landa in Inglourious Basterds (2009), but he eventually chose Christoph Waltz to play the role instead.", "Purchased a unit in Manhattan's new, eco-friendly Riverhouse development in Battery Park, paying $3,665,700. Other real estate holdings include: A 1765-square-foot house on Carbon Beach in Malibu that he purchased in 1998 for $1.6 million. A 2633-square-foot house in the Malibu Colony that he purchased in 2002 for exactly $6 million. A 4551-square-foot house in the Bird Streets area of Los Angeles' Hollywood Hills that he bought in late 1999 for $2,515,000. A 3980-square-foot house in the Bird Streets area of Los Angeles' Hollywood Hills (next door to the one mentioned above) that he purchased in the summer of 2003 for $3,780,000. A two-bedroom, 2374-square-foot contemporary-style oceanfront house in Malibu, California that he paid $6.350 million for in 2007. And in Las Vegas, he spent $1.5 million for two adjacent two-bedroom units at Las Vegas's Panorama Towers in 2004. [2008]", "His favorite actress of all time is Meryl Streep.", "Has been in a relationship with Bar Refaeli twice. They began a relationship in December 2005, but separated in October 2007. However, they later reconciled in December 2007, only to separate again in May 2011.", "As a board member with World Wildlife Fund (WWF), he has traveled to such places as Bhutan, Nepal and Russia.", "While attempting to travel to St. Petersburg, Russia to attend the International Tiger Conservation Forum as a guest of the World Wildlife Fund (WWF), but he was held up not once, but twice by flights. The first, Delta Flight 30, which departed from JFK bound for Moscow, was forced to make an emergency landing back at JFK shortly after takeoff due to engine flame out and malfunction, later his replacement flight had to make an unscheduled landing in Helsinki, Finland to refuel due to strong winds over the Atlantic ocean that used up the plane's fuel. Prime Minister of Russia, Vladimir Putin, who hosted the event, acknowledged that a lesser man, \"could have read it as a sign - that it was not worth going,\" but instead Leo, who's late grandparents were Russian, made it to the summit and gained Putin's respect. The summit's aim is to double wild tiger populations worldwide from 3,500 to 7,000 by 2022. While in St. Petersburg, DiCaprio committed $1 million to WWF for urgent tiger conservation efforts through his Fund at the California Community Foundation. [November 2010]", "Has appeared three times on the cover of GQ magazine: December 2006, December 2008 and October 2011.", "Won the 2010 'Do Something' Award for his Haiti relief efforts and the television show \"Greensburg\".", "Has worked with numerous acclaimed directors: Martin Scorsese, Steven Spielberg, Woody Allen, Clint Eastwood, Ridley Scott, James Cameron, Christopher Nolan, Quentin Tarantino, Alejandro G. Iñárritu, Sam Mendes, Danny Boyle, Lasse Hallström, Baz Luhrmann, Sam Raimi, and Edward Zwick.", "Kate Winslet considers him the best actor of his generation.", "Celebrated his 37th birthday at New York City's Hotspot Avenue, which he rented out. Guests included pals Russell Simmons and Bradley Cooper, and Leo's mother Irmelin. The party raised money for DiCaprio's various wildlife protection projects and disaster relief for Haiti. Moreover, his movie J. Edgar (2011) was released to theaters in the United States and Canada on that same day. [November 2011]", "Owns a production company - Appian Way Productions.", "Is a staunch liberal Democrat who has been both personally and financially active in the campaigns and elections of Bill Clinton, Al Gore, John Kerry and Barack Obama.", "Was named Commander of the Order of the Arts and Letters in France in the same day that Martin Scorsese received the Legion of Honour. Recipients of the order are honored for their significant contribution to the enrichment of French culture. France's Culture Minister Renaud Donnedieu de Vabres described DiCaprio as an 'icon, little Hollywood prince, bad boy from Los Angeles, modern romantic hero, Peter Pan of American cinema'. [January 5, 2005].", "Was considered for the role of Roark Jr./ Yellow Bastard in Sin City (2005), which went to Nick Stahl.", "(January 19, 2007) Attended The Departed (2006) premiere in Tokyo, Japan.", "Attended the Blood Diamond (2006) premieres in Madrid, Spain (January 26th) and London, England (January 23rd). [January 2007]", "American representative at Tiger Conservation Efforts At Russia Summit. Donated $1.000.000 to preservation of Asian Tiger. [November 2010]", "Attended the 2007 Cannes Film Festival in France. [May 2007]", "(November 4, 2008) Attended the Body of Lies (2008) premiere in Rome, Italy.", "Attended the Inception (2010) premiere in Tokyo, Japan. [July 2010]", "Attended the international premieres for Catch Me If You Can (2002) in Paris, France (January 28th) and London, England (January 27th). [January 2003]", "(February 9, 2009) Attended the 59th Berlin International Film Festival.", "Attended the international premieres for The Aviator (2004) in Madrid, Spain (January 11th) Paris, France (January 6th) and Rome, Italy (January 4th). [January 2005]", "(June 9, 2006) Attended the 2006 French Open in Paris, France.", "(October 15, 2006) Attended the 1st Annual Rome Film Festival in Italy.", "(January 19, 2009) Attended the London premiere of Revolutionary Road (2008).", "Ranked #8 on Forbes list of Hollywood's Top Earning On-Screen Couples alongside Marion Cotillard in 2012. They are the only couple from a non-franchise film: Inception (2010), the film made $825 million at the global box-office.", "Bought a multi-million-dollar apartment, in Manhattan's Greenwich Village area, at 66 E. 11th Street. [November 2013]", "Optioned the 2013 biography of President Woodrow Wilson by Pulitzer Prize-winner A. Scott Berg, and hopes to play the President himself. A previous biopic about the 28th U.S. president was made in 1944, but was a major failure with audiences despite being nominated for 10 Oscars, and being the costliest film ever made up to that point.", "Perhaps one of the most outrageous on-camera introductions ever given to a person (celebrity or otherwise) was the one co-host Tina Fey bestowed on DiCaprio during the 2014 Golden Globes telecast when she asked the audience to give him the same type of warm welcome he's used to receiving from \"supermodels' vaginas.\".", "As of 2016, Leo has been nominated for 38 different awards (6 Academy Awards, 4 BAFTA Awards, 11 Golden Globe Awards, 9 Screen Actors Guild Awards, 7 Critics' Choice Awards and 1 Emmy Award), but has only won 3 Golden Globes (the first was for The Aviator (2004) in 2005, the second for The Wolf of Wall Street (2013) in 2014 and the third for The Revenant (2015) in 2016), 1 SAG Award (for The Revenant), 1 BAFTA award (for The Revenant) and 2 Critics' Choice awards (the first for The Wolf of Wall Street in 2014 and the second for The Revenant in 2016). He won his first Oscar for The Revenant on February 28, 2016, on his fifth acting nomination and 22 years after his first nomination for What's Eating Gilbert Grape (1993).", "Mentioned in the song \"Eu Te Devoro\" by Brazilian singer/composer Djavan. [1998]", "The longest he has gone without an Oscar nomination is the 11 years between What's Eating Gilbert Grape (1993) and The Aviator (2004). His nomination for The Wolf of Wall Street (2013) came 7 years after his previous nomination for Blood Diamond (2006).", "As of 2018, has appeared in 9 films that were nominated for the Best Picture Oscar: Titanic (1997), Gangs of New York (2002), The Aviator (2004), The Departed (2006), Inception (2010), Django Unchained (2012), The Wolf of Wall Street (2013), The Revenant (2015), and Once Upon a Time... In Hollywood (2019). Of those, Titanic (1997) and The Departed (2006) are winners in the category. He was nominated for Best Actor in three of these: The Aviator, The Wolf of Wall Street, The Revenant (which he won), and Once Upon a Time... in Hollywood.", "(December 26, 2012) Attended Kate Winslet and Ned Rocknroll's wedding in a private ceremony in New York. He also gave the bride away.", "Ranked on Forbes' \"Highest-Paid Actors List\". He was ranked #5 in 2008, #5 in 2010, #1 in 2011, #2 in 2012, #6 in 2013, #4 in 2014 and #13 in 2015 - this year the list was changed from \"Hollywood's Highest-Paid Actors\" to \"The World's Highest-Paid Actors\", including actors who work in other countries.", "In 2012, he was featured on Kate Winslet's book \"The Golden Hat: Talking Back To Autism\", with celebrity self-portraits to raise awareness and support for autism.", "DiCaprio, Tilda Swinton, Marion Cotillard, Emma Thompson, Tom Hanks, Daniel Brühl, Jake Gyllenhaal and Amy Adams are the only actors to receive a Golden Globe, SAG, BAFTA and Critics' Choice Award nomination for the same performance and then fail to be Oscar-nominated for it: for their performances in The Departed (2006), We Need to Talk About Kevin (2011), Rust and Bone (2012), Saving Mr. Banks (2013), Captain Phillips (2013), Rush (2013), Nightcrawler (2014) and Arrival (2016), respectively.", "Attended amfAR Cinema Against Aids Gala in France [May 22, 2014].", "Attended FIFA World Cup Brazil 2014 opening ceremony in São Paulo, wearing a scarf with Brazil's flag. [June 12, 2014].", "Turned down the role of Steve Jobs in Steve Jobs (2015). Michael Fassbender was cast instead.", "Hosted the first gala for the Leonardo DiCaprio Foundation in Saint-Tropez, France on July 23, 2014. Over 500 guests attended the event, including Marion Cotillard, Jared Leto and Bono. The event raised $25 million to help protect animals and plants from extinction.", "Turned down the role of Max in Disney's Hocus Pocus (1993) in order to star in the indie flick What's Eating Gilbert Grape (1993).", "Is named after Leonardo Da Vinci because he first kicked in his mother's womb when she saw Leonardo Da Vinci's artwork at the Uffizi Gallery, his artist father felt it was apt. His paternal grandfather's middle name happens to be Leon.", "Shares the 2015 Special Humanitarian Award with Veronica Grey for their environmental documentary Worst Shark Attack Ever (2014). He was also awarded the Special Jury Award and Socially Responsible Conservationist Award for this project, from three different, relevant film festivals.", "Donated a Banksy painting from his art collection for the amfAR Gala charity auction in Cannes, where it fetched $1 million. The painting was introduced by Marion Cotillard and Michael Fassbender. [May 21, 2015].", "Won the Socially Responsible Conservationist award from the New Media Film Festival for the environmental documentary Worst Shark Attack Ever (2014).", "Possibly the only actor to play a character in almost every decade spanning the last 165 years.", "Outbid Paris Hilton at a Cannes charity auction for a Chanel handbag, which he gave to his mother.", "After The Wolf of Wall Street (2013), took a 2 year hiatus from acting, citing exhaustion. His next film The Revenant (2015) will debut more than two years after The Wolf of Wall Street (2013)'s release.", "Leo was born in L.A.'s Cedars-Sinai (4810 Sunset Blvd), a building that was later purchased by the Church of Scientology for its West Coast headquarters in 1976.", "While being interviewed by Entertainment Tonight at the red carpet of the 2016 Golden Globes, he stated that his long-time friend Kate Winslet is his favorite actress in the industry and he would love to work with her again.", "DiCaprio and his Shutter Island (2010) co-star Michelle Williams, have both appeared in Lassie productions. DiCaprio appeared in two episodes of The New Lassie (1989) when he was 15 years old, while Williams made her film debut in Lassie (1994), when she was 13.", "DiCaprio and his Titanic (1997) and Revolutionary Road (2008) co-star (as well as close friend), Kate Winslet, have been nominated for Oscars in the same year three times: in 2005 for The Aviator (2004) (DiCaprio) and Eternal Sunshine of the Spotless Mind (2004) (Winslet), in 2007 for Blood Diamond (2006) (DiCaprio) and Little Children (2006) (Winslet), and in 2016 for The Revenant (2015) (DiCaprio) and Steve Jobs (2015) (Winslet).", "Every time DiCaprio was nominated for the Best Actor Oscar, one of his co-stars was nominated in the Best Supporting Actor category for the same movie (Alan Alda in The Aviator (2004), Djimon Hounsou in Blood Diamond (2006), Jonah Hill in The Wolf of Wall Street (2013) and Tom Hardy in The Revenant (2015)). Cate Blanchett is his only female co-star to be nominated (and win) an Oscar for a movie in which she co-starred with him, for her performance in The Aviator (2004), for which DiCaprio was nominated for Best Actor.", "DiCaprio and his The Aviator (2004) co-star, Cate Blanchett, have been nominated for Oscars in the same year four times: in 2005 both of them were nominated for The Aviator; in 2007 for Blood Diamond (2006) (DiCaprio) and Notes on a Scandal (2006) (Blanchett); in 2014 for The Wolf of Wall Street (2013) (DiCaprio) and Blue Jasmine (2013) (Blanchett), and in 2016 for The Revenant (2015) (DiCaprio) and Carol (2015) (Blanchett). Blanchett won the Oscar in 2005 and 2014 and DiCaprio won in 2016.", "A 8-bit web-game titled \"Leo's Red Carpet Rampage\" was released in February 16, 2016 by British multimedia group The Line Animation. The game places a miniature animated Leonardo DiCaprio in a never-ending quest to reach the end of the red carpet where his Oscar awaits him. It featured a series of challenges involving DiCaprio's career: paparazzis, the iceberg that sinks Titanic (1997), the Quaalude overdose from The Wolf of Wall Street (2013), the bear from The Revenant (2015), his competitors for the Best Actor Oscar, write an acceptance speech, find the black nominee, etc. The game racked up 6,000 plays per minute two hours after the official launch and quickly spread around the world, inexplicably finding its largest audience in Russia.", "His first Oscar win in February 28, 2016 broke the internet and generated 440,000 Tweets per minute, making it the most-tweeted moment of an Oscars telecast ever, surpassing Ellen DeGeneres' selfie from the 2014 ceremony.", "DiCaprio's first Oscar win was celebrated in Brazil's most famous street Avenida Paulista in São Paulo (the city's main boulevard) and at Avenida Atlântica in Copabana, Rio de Janeiro. Hundreds of people blocked streets in Mexico to celebrate his win.", "Fans in Russia's Republic of Yakutia donated their jewelry to craft an Oscar of their own for the actor. DiCaprio has been invited to the Russian Far East to receive the so-called 'Yakutian Oscar'. Around 1.4 kilograms of silver were collected and melted to make the Yakutian Oscar.", "His first agent refused to sign him in the beginning unless he would change his name to \"Lenny Williams\", saying that Leonardo Wilhelm DiCaprio was \"too ethnic\" to work.", "He has a total of 8 directors on his resume who have won an Oscar for Best Director: James Cameron, Woody Allen, Danny Boyle, Martin Scorsese, Steven Spielberg, Sam Mendes, Clint Eastwood, and Alejandro G. Iñárritu.", "Voluntarily surrendered several works of art worth millions of dollars and an Oscar statuette that once belonged to Marlon Brando to the U.S. Government, as part of its ongoing investigation into a money laundering operation connected to Malaysian prime minister Najib Razak.", "The paintings and photograph were reportedly gifts from Malaysian financiers connected to Riza Aziz, co-founder of Red Granite Pictures, the group that produced the DiCaprio-starring \"The Wolf of Wall Street.\" The Justice Department has been investigating whether Aziz assisted Prime Minister Razak, his father-in-law, in embezzling more than $4 billion. Some of that money was used to finance Red Granite, and several of the company's films.", "The surrendered items include: a Picasso painting, \"Nature Morte au Crane de Taureau,\" valued at more than $3 million; a Basquiat collage, \"Redman One,\" valued at at least $9 million; a Diane Arbus photograph valued at $750,000; and the Oscar Brando won for his performance in \"On the Waterfront.", "Rarely ever goes on talk shows except The Ellen Show.", "His birthday is Veterans Day.", "Is one of 14 actors to have won the Academy Award, BAFTA Award, Critics' Choice Award, Golden Globe Award and SAG Award for the same performance. The others in chronological order are Geoffrey Rush for Shine (1996), Jamie Foxx for Ray (2004), Philip Seymour Hoffman for Capote (2005), Forest Whitaker for The Last King of Scotland (2006), Javier Bardem for No Country for Old Men (2007), Daniel Day-Lewis for There Will Be Blood (2007) and Lincoln (2012), Heath Ledger for The Dark Knight (2008), Christoph Waltz for Inglourious Basterds (2009), Colin Firth for The King's Speech (2010), Christopher Plummer for Beginners (2010), J.K. Simmons for Whiplash (2014), Sam Rockwell for Three Billboards Outside Ebbing, Missouri (2017), and Gary Oldman for Darkest Hour (2017).", "By many publications such as Variety, The Economist, The Atlantic, he is said to be the last true American \"movie star\", because he has remained the most bankable actor while eschewing genres such as superhero films.", "He is the fourth actor to portray the character of Jay Gatsby in a major motion picture released in cinemas. Warner Baxter portrayed the character in The Great Gatsby (1926), Alan Ladd in The Great Gatsby (1949), and Robert Redford in The Great Gatsby (1974).", "As of 2019, hasn't worked with a female director since Total Eclipse (1995).", "One of his first TV appearances was \"Romper Room\". He got himself ejected from the set for being disruptive.", "Was rejected for the role of Hobie Buchannon on \"Baywatch\". In later years, DiCaprio considered this setback a blessing in disguise.", "In early 2014, CNN did a segment at the factory where the Oscar statue and nameplates are made. Presenter Ted Rowlands held Leonardo DiCaprio's nameplate leading people to assume CNN spoiled the big surprise, though voting hadn't even taken place yet. The award ended up going to Matthew McConaughey.", "He has appeared in one film that has been selected for the National Film Registry by the Library of Congress as being \"culturally, historically or aesthetically\" significant: Titanic (1997).", "He has been in three movies which had the extinct Air Line Company \"Pan Am(Pan American Airlines)\": Catch Me if You Can(2002), The Aviator(2004) and Once Upon a Time in Hollywood(2019).", "He signed on to star in \"The Crowded Room\", to be directed by Alejandro G. Iñarritu in 2015, where he would play the real life criminal Billy Milligan who used multiple personalities (two out of 24 of them) to commit crimes. The project sadly, has remained in development hell.", "Is an avid beekeeper."], "filmography": ["Roosevelt ()", "The Devil in the White City ()", "Killers of the Flower Moon ()", "The Black Hand ()", "Don't Look Up", "Grant", "Once Upon a Time... In Hollywood", "Lil Dicky: Earth", "BYD: Build Your Dreams", "BYD: Make History", "The Revenant", "The Audition", "Jim Beam: Black", "Telecom: La tecnologia e importante ma anche tutto il resto", "Jim Beam: Bourbon", "The Wolf of Wall Street", "The Great Gatsby", "Django Unchained", "Oppo: Find Me", "Wild Aid: Leonardo DiCaprio and Jackie Chan", "J. Edgar", "Inception: The Cobol Job", "Inception", "Shutter Island", "Revolutionary Road", "Body of Lies", "Blood Diamond", "The Departed", "The Aviator", "Catch Me If You Can", "Gangs of New York", "Don's Plum", "The Beach", "Celebrity", "The Man in the Iron Mask", "Titanic", "Marvin's Room", "Romeo + Juliet", "Honda: Miracle Civic", "Total Eclipse", "The Quick and the Dead", "The Basketball Diaries", "The Foot Shooting Party", "What's Eating Gilbert Grape", "This Boy's Life", "Growing Pains (1991-1992)", "Poison Ivy", "Kraft: Kraft Free Singles", "Critters 3", "Parenthood (1990-1991)", "Roseanne", "Street Safe, Street Smart", "Santa Barbara", "The Outsiders", "Bubble Yum: Keeps it Poppin'", "Fred Meyer: You'll Find it at Freddy's", "The New Lassie", "Romper Room"]}