{"name": "Russ Tamblyn", "current role": "Doc", "birth name": "Russell Irving Tamblyn", "birth date": "1934-12-30", "birth place": "Los Angeles, California, USA", "height": "5' 9½\" (1.77 m)", "biography": "Russ wasn't discovered, he discovered show business at the age of 5 when . . . with other youngsters at Inglewood, California . . . he went to Saturday matinees at the Granada Theatre. One afternoon while waiting for the show to start he got on the stage and did an impromptu dance which the kids loved. He repeated it the following week and became so popular that when he didn't appear there was almost a riot. The theater manager spoke to his parents and his mother let him take dancing lessons. Once started on a career he expanded his talents to take in singing and acrobatics performing his first back flip at 10. He later added juggling, a magic act, piano, and drums to his talents which made him a regular performer at local clubs. He made his stage debut with a small theater group directed by Lloyd Bridges which in turn led to his film debut in 'The Boy With Green Hair' followed by a part in 'Samson and Delilah' and the title role in 'The Kid From Cleveland.' He had an Oscar nomination as Best Supporting Actor for 'Peyton Place' receiving high praise from both director Mark Robson and choreographer Michael Kidd who was a close friend of Jerome Robbins who'd worked with Russ on 'Seven Brides For Seven Brothers.' Summoned for both a dancing and acting screen test with Robert Wise and Jerome Robbins he was cast as Riff the leader of 'The Jets' in the Oscar winning film 'West Side Story.' In his films up to 1952 he was credited as Rusty Tamblyn and Russ Tamblyn after that. He was nominated for a Best Supporting Actor Oscar in 1957 for his role in 'Peyton Place.'::Tonyman 5", "trade mark": "Has often played odd, slightly off-kilter characters", "trivia": ["Son of Eddie Tamblyn. Brother of Larry Tamblyn of the rock band The Standells. His daughter with third wife Bonnie Tamblyn is Amber Tamblyn.", "Was a gymnast at North Hollywood High School. A buoyant dancer and tumbler, Tamblyn began acting in films in 1948. His abilities as an acrobat and gymnast led to his being cast in such spectacular and dynamic dance films as Seven Brides for Seven Brothers (1954) among others.", "Married three times; all his wives were involved in show business. Venetia Stevenson was a film actress, British Elizabeth Kempton (born 1935) was a Vegas showgirl and present wife, Bonnie Tamblyn, is a folk singer.", "In 1997, he made a one-shot guest appearance on General Hospital (1963) in a song-and-dance sketch that featured his daughter, Amber Tamblyn.", "Appeared in three episodes of Joan of Arcadia (2003) on which his daughter Amber Tamblyn starred: \"Night without Stars\", \"Do the Math\" and \"Friday Night\".", "Has always claimed that his biggest professional disappointment was not getting the title role in the post-Broadway tour of \"Barnum\". The part went to Tony Orlando, instead.", "His standout dance sequence while performing the role of Eric in The Fastest Gun Alive (1956) duplicated some of his dance moves from Seven Brides for Seven Brothers (1954) and, in fact, added some athletics that went beyond those original moves.", "Has done art work such as painting, drawing and creating collages. His \"spacescapes\" have been displayed at exhibitions at the Los Angeles County Art Museum and the Los Angeles Institute of Contemporary Art.", "In July 2006, he was a guest at the Western Film Fair in Charlotte, North Carolina along with Ben Murphy, Roger Davis, Steve Kanaly, Marjorie Lord, Coleen Gray, Mark Goddard, Ronnie Schell, Tom Reese and Cheryl Rogers.", "Father of China Tamblyn (member of the Kirby Grips musical group).", "Co-starred with Richard Beymer in West Side Story (1961) and Twin Peaks (1990).", "Originally auditioned for the part of \"Tony\" in West Side Story (1961), but was cast as \"Riff\" instead, while the part of \"Tony\" went to Richard Beymer.", "Godfather of his daughter Amber Tamblyn is Dean Stockwell.", "Attended North Hollywood High School.", "Currently writing his autobiography \"Dancing On The Edge\". [November 2011]", "Currently playing \"Capt. John Green\" in Neil Young's multimedia \"Greendale\" tour. He is also directing and choreographing the production numbers for the tour. [June 2003]", "Lives in Santa Monica, California and manages daughter Amber's career. [April 2002]", "Was friends with Dennis Hopper, who introduced him to David Lynch. He expressed an interest in working with Lynch, which led to his role on 'Twin Peaks (1990)(TV)'.", "Appears in six Oscar Best Picture nominees: Father of the Bride (1950), Seven Brides for Seven Brothers (1954), Peyton Place (1957), West Side Story (1961), How the West Was Won (1962) and Django Unchained (2012). West Side Story is the only winner.", "Early in his career, he worked with several other actors who would also work with director David Lynch. Dean Stockwell has worked with him several times, the first being in The Boy with Green Hair (1948). In Deep in My Heart (1954), he worked with José Ferrer, who not only appeared in Dune (1984), but was also the father of Twin Peaks (1990) cast member Miguel Ferrer. Also appearing in that film was Ann Miller, who appeared in Mulholland Drive (2001). Peyton Place (1957) featured Hope Lange, who also appeared in Blue Velvet (1986). And of course, he worked with his own future Twin Peaks cast mate, Richard Beymer, in West Side Story (1961).", "Appeared in both Cinerama movies of 1962: The Wonderful World of the Brothers Grimm (1962) and How the West Was Won (1962).", "He has appeared in four films that have been selected for the National Film Registry by the Library of Congress as being \"culturally, historically or aesthetically\" significant: Gun Crazy (1950), Seven Brides for Seven Brothers (1954), West Side Story (1961) and How the West Was Won (1962)."], "filmography": ["The Haunting of Hill House", "Twin Peaks", "The Increasingly Poor Decisions of Todd Margaret (2010-2016)", "Chatty Catties", "The Both: Volunteers of America", "Twin Peaks: The Missing Pieces", "Hits", "Django Unchained", "Drive", "The Further Adventures of Edmund and Pablo", "Joan of Arcadia", "Inviati speciali", "General Hospital", "Days of Our Lives", "Inherit the Wind", "Little Miss Magic", "My Ghost Dog", "Johnny Mysto: Boy Wizard", "Nash Bridges", "Rebellious", "Starstruck", "Attack of the 60 Foot Centerfolds", "Babylon 5", "Desert Steel", "Cabin Boy", "Little Devils: The Birth", "Running Mates", "Twin Peaks: Fire Walk with Me", "Wizards of the Demon Sword", "Twin Peaks (1989-1991)", "Aftershock", "The Bloody Monks", "Quantum Leap", "B.O.R.N.", "The Phantom Empire", "Necromancer", "Rags to Riches", "Commando Squad", "Fame (1986-1987)", "Human Highway", "Nero Wolfe", "The Life and Times of Grizzly Adams", "The Quest", "Black Heat", "The World Through the Eyes of Children", "Win, Place or Steal", "Cade's County", "Dracula vs. Frankenstein", "The Last Movie", "The Female Bunch", "Scream Free!", "The Name of the Game", "Satan's Sadists", "Iron Horse", "Tarzan", "The War of the Gargantuas", "Son of a Gunfighter", "Gunsmoke", "Burke's Law", "The Long Ships", "Channing", "The Greatest Show on Earth", "The Haunting", "Follow the Boys", "How the West Was Won", "The Wonderful World of the Brothers Grimm", "West Side Story", "Cimarron", "Tom Thumb", "High School Confidential!", "Peyton Place", "Don't Go Near the Water", "The Young Guns", "The Fastest Gun Alive", "The Last Hunt", "Hit the Deck", "Many Rivers to Cross", "Deep in My Heart", "Seven Brides for Seven Brothers", "Take the High Ground!", "The Winning Team", "Retreat, Hell!", "Cave of Outlaws", "As Young as You Feel", "Father's Little Dividend", "What Happened to Jo Jo?", "Father of the Bride", "The Vicious Years", "Gun Crazy", "Captain Carey, U.S.A.", "Samson and Delilah", "The Kid from Cleveland", "Reign of Terror", "The Boy with Green Hair"]}