{"name": "Finn Wittrock", "current role": "Jamie Shipley", "birth name": " ", "birth date": "1984-10-28", "birth place": "Lenox, Massachusetts, USA", "height": "5' 9\" (1.75 m)", "biography": "Finn Wittrock was born in Lenox, Massachusetts. Finn grew up near the stage of Shakespeare and Company, where his father worked. He moved to Los Angeles at 12 years old and attended the Los Angeles County High School for the Arts (LACHSA). After high school he took a year off and pounded the pavement as an actor, appearing in \"ER,\" \"Cold Case,\" \"CSI: Miami\" and the unforgettable \"Halloweentown High.\" He then got out of town and attended the Juilliard School, where no one saw him for 4 years. After resurfacing on the daytime soap opera \"All My Children\" he appeared in Tony Kushners \"The Illusion\" off Broadway at the Signature Theatre. Mike Nichols attended the play and asked him to audition for the role of Happy in \"Death of a Salesman on Broadway.\" He got the job and thereby made his Broadway debut. Mike Nichols. He returned to Broadway in 2017 with \"The Glass Menagerie\" starring Sally Field and directed by Sam Gold, after playing Cassio in Sam's production of Othello at New York Theatre Workshop with Daniel Craig and David Oyellowo. He has also appeared at the Goodman Theatre opposite Diane Lane in Tennessee Williams's \"Sweet Bird of Youth\", directed by David Cromer. Recent films include \"Judy,\" \"Semper Fi,\" \"The Last Black Man in San Francisco,\" \"If Beale Street Could Talk,\" and \"The Big Short.\" He has been nominated for two Emmy Awards: for American Crime Story: The Assassination of Gianni Versace\" as well as \" American Horror Story: Freakshow.\" He has also appeared in the AHS seasons \"Hotel,\" \"Roanoke\" and \"1984.\" Other films included Winter's Tale (2014), Noah (2014), and Unbroken (2014). He appeared in Masters of Sex (2013) on Showtime as well as The Normal Heart (2014) on HBO. Wittrock originated the role of Damon on All My Children (1970), and has made appearances on shows such as Criminal Minds (2005), Harry's Law (2011), CSI: Miami (2002), Cold Case (2003), and ER (1994). His screenplay The Submarine Kid (2015), which he wrote with lifelong friend Eric Bilitch, has been turned into a film.::pcw", "trade mark": " ", "trivia": ["He expressed a desire to play the DC Comics character Dick Grayson/Nightwing in a live-action film upon learning that he was a popular choice among fans for the role.", "His father Peter Wittrock is also an actor and his mother Kate is a professor of occupational therapy at the University of Southern California.", "He grew up in Los Angeles, where he attended the Los Angeles County High School for the Arts.", "He initially turned down an offer to attend Juilliard to look for acting work in Los Angeles. He auditioned a year later and was accepted again.", "He has a younger brother named Dylan Wittrock.", "Nominated for the 2018 Emmy Award in the Outstanding Supporting Actor in a Limited Series or Movie category for his role as Jeffrey Trail in American Crime Story (2016), but lost to Jeff Daniels from Godless (2017).", "His father is of Danish, Norwegian, and Austrian descent. The surname Wittrock originates in Denmark.", "Is pigeon-toed, meaning his feet angle towards each other when standing or walking."], "filmography": ["A Mouthful of Air", "Deep Water", "Louie ()", "Long Weekend", "American Horror Story (2014-2021)", "Ratched", "Cake", "Semper Fi", "Judy", "Alternatino with Arturo Castro", "Big Boy Pants", "Plus One", "The Last Black Man in San Francisco", "If Beale Street Could Talk", "Interpol: If You Really Love Nothing", "Locating Silver Lake", "Write When You Get Work", "American Crime Story", "A Futile and Stupid Gesture", "A Midsummer Night's Dream", "Landline", "La La Land", "The Big Short", "The Submarine Kid", "My All-American", "Deadbeat", "Home Is Where Your Heart Aches", "Unbroken", "The Normal Heart", "Noah", "Winter's Tale", "Masters of Sex", "Law & Order: Special Victims Unit", "Criminal Minds", "Harry's Law", "Torchwood", "All My Children (2009-2011)", "Twelve", "CSI: Miami", "Halloweentown High", "ER", "Cold Case", "Le Dernier Tour"]}