{"name": "Oscar Isaac", "current role": "Standard", "birth name": "Oscar Isaac Hernandez", "birth date": "1979-03-09", "birth place": "Guatemala City, Guatemala", "height": "5' 8½\" (1.74 m)", "biography": "Oscar Isaac was born Óscar Isaac Hernández Estrada in Guatemala, to a Guatemalan mother, María Eugenia, and a Cuban father, Oscar Gonzalo Hernández-Cano, a pulmonologist. Oscar was raised in Miami, Florida. Before he became an actor, he played lead guitar and sang vocals in his band the Blinking Underdogs. He graduated from the Juilliard School in 2005.Isaac's first major film role was Joseph in the film The Nativity Story (2006). He also had a small role in All About the Benjamins (2002) and the Ché Guevara biopic Guerrilla (2011). In addition to movie appearances, he made an appearance in the television series Law & Order: Criminal Intent (2001). He also had a part in the movies The Life Before Her Eyes (2007); Body of Lies (2008), alongside Leonardo DiCaprio and Russell Crowe; Agora (2009), alongside Rachel Weisz; and the Australian film Conspiration (2009), where he played José Ramos-Horta, former president of East Timor, set amid the Indonesian invasion of East Timor in 1975; Isaac won the Australian Film Institute Award for Best Supporting Actor for the role.In 2013, Oscar starred in the Coen Brothers' folk music-themed comedy-drama, Inside Llewyn Davis (2013), for which he received a Golden Globe Award nomination. He subsequently starred in the crime drama A Most Violent Year (2014) and the science fiction thriller Ex Machina (2014), and appeared in the Star Wars films Star Wars: Episode VII - The Force Awakens (2015) and Star Wars: Episode VIII - The Last Jedi (2017), as X-wing pilot Poe Dameron, and the ninth X-Men film, X-Men: Apocalypse (2016), as the mutant supervillain Apocalypse. He has also headlined the HBO miniseries Show Me a Hero (2015), as politician Nick Wasicsko in 2015, which earned him the Golden Globe Award for Best Actor - Miniseries or Television Film.He has a son with his wife, Danish director Elvira Lind.::Ângela Oliveira and Pedro Borges", "trade mark": " ", "trivia": ["He was born in Guatemala, to a Guatemalan mother, María Eugenia Estrada Nicolle, and a Cuban father, Oscar Gonzalo Hernández-Cano. Oscar's maternal grandfather was of French origin.", "Studied acting at Juilliard.", "Is friends with fellow Juilliard alumna, Academy Award-nominated actress Jessica Chastain.", "Worked as an orderly at the same hospital as his doctor-father.", "Is a musician and singer, playing guitar. In high school he played in punk bands and later became lead singer of his own band, the Blinking Underdogs.", "Member of the 'Academy of Motion Picture Arts and Sciences' (AMPAS) since 2016.", "He was expelled from private grade school Westminster Christian due to various pranks and instances of misbehavior such as setting off a fire extinguisher in a gym and defacing a mural to make other kids laugh.", "Isaac's family settled in the U.S. when he was five months old, and he was raised in Miami, Florida.", "Lives in Williamsburg, Brooklyn in an apartment that he renovated himself.", "Has been playing guitar since he was twelve.", "Started acting in small local play in Miami at Area Stage Company. Till this day, he has a good relationship with owner and manager John Rodaz Sr. to the point that he was one of the first people whom he told that he got the part of Poe Dameron in Star Wars: The Force Awakens. Likewise, John often asks Oscar for his input in any plays that he is producing and thus tends to get a thank you credit in the playbill.", "He was an avid fan and collector of X-Men comics growing up. He would later play the titular villain in X-Men: Apocalypse (2016).", "In a relationship with director Elvira Lind as of 2012.", "In April 2017, he became a father for the first time, to a baby boy, at age 38. Child's mother is his partner Elvira Lind."], "filmography": ["Metal Gear Solid ()", "Armageddon Time ()", "Moon Knight ()", "Scenes from a Marriage", "Big Gold Brick", "The Card Counter", "Untitled Addams Family Sequel", "Dune", "The Letter Room", "Star Wars: Episode IX - The Rise of Skywalker", "Star Wars: Rise of the Resistance", "The Addams Family", "Triple Frontier", "Star Wars Resistance (2018-2019)", "Spider-Man: Into the Spider-Verse", "Life Itself", "At Eternity's Gate", "Operation Finale", "Annihilation", "Star Wars: Episode VIII - The Last Jedi", "Suburbicon", "The Promise", "Lego Star Wars: The Force Awakens", "Lightningface", "X-Men: Apocalypse", "Star Wars: Episode VII - The Force Awakens", "Show Me a Hero", "Disney Infinity 3.0", "Mojave", "Ex Machina", "A Most Violent Year", "Ticky Tacky", "The Two Faces of January", "Trentemøller: Gravity", "Making a Scene", "In Secret", "Inside Llewyn Davis", "Won't Back Down", "The Bourne Legacy", "Revenge for Jolly!", "Cristeros", "10 Years", "W.E.", "Drive", "Star Tours: The Adventures Continue", "Sucker Punch", "Robin Hood", "Conspiration", "Agora", "Body of Lies", "Che: Part One", "The Life Before Her Eyes", "The Nativity Story", "Pu-239", "Law & Order: Criminal Intent", "Lenny the Wonder Dog", "All About the Benjamins", "Illtown"]}