{"name": "Richard Thaler", "current role": "Richard Thaler", "birth name": " ", "birth date": " ", "birth place": " ", "height": " ", "biography": "Thaler was born in East Orange, New Jersey, the son of Roslyn (Melnikoff), a teacher, and Alan M. Thaler, who was an actuary at the Prudential Financial in Newark, New Jersey and born in Toronto His family is Jewish and he grew up with two younger brothers. He is married to France Leclerc, a former marketing professor. He has three children from his first marriage.He graduated from Newark Academy, before going on to the receive his Bachelor of Arts in 1967 from Case Western Reserve University, and his master's in 1970 and doctorate in 1974 from the University of Rochester, writing his thesis on \"The Value of Saving A Life: A Market Estimate\" under the supervision of Sherwin Rosen.After completing his studies, began his career as a professor at the University of Rochester. From 1978 to 1995, he was a faculty member at the SC Johnson College of Business at Cornell University and then at the University of Chicago's Booth School of Business in 1995. Since 1999, he has been the Principal of the Fuller & Thaler Asset Management, which he co-founded in 1993. He has also been the co-director of the National Bureau of Economic Research Behavioral Economics Project since 1991.One of the founders of behavioral finance, Thaler studies how cognitive limitations influence financial markets, Thaler developed a model for explaining how people tend to focus on the narrow impact rather than the overall effect of each decision they make, which is called limited rationality.This includes the study of how people's loathing of losses can explain why they value the same things more when they own them as opposed to when they don't, which is called the endowment effect.Influential in theoretical and experimental research on fairness, Thaler showed 'how consumers' fairness concerns may stop firms from raising prices in periods of high demand, but not in times of rising costs', the Nobel economics committee said in a statement.Thaler's work even earned him a glamorous foray into the movie business when he made a cameo appearance, alongside Christian Bale, Steve Carell and Ryan Gosling, in the 2015 movie 'The Big Short' about the credit and housing bubble collapse that led to the 2008 global financial crisis. In his cameo, he appeared in a scene alongside pop star Selena Gomez to explain the 'hot hand fallacy,' in which people think whatever's happening now is going to continue to happen into the future. The movie grossing $10,531,026 (USA) (23 December 2015) over the opening weekend and grossing more than $70,259,870 in the USA. This was the second film based on a Michael Lewis book that Brad Pitt produced and appeared in. The first was Moneyball (2011).::Jayanta Pramanik", "trade mark": " ", "trivia": ["Thaler's work even earned him a glamorous foray into the movie business when he made a cameo appearance, alongside Christian Bale, Steve Carell and Ryan Gosling, in the 2015 movie 'The Big Short' about the credit and housing bubble collapse that led to the 2008 global financial crisis. In his cameo, he appeared in a scene alongside pop star Selena Gomez to explain the 'hot hand fallacy,' in which people think whatever's happening now is going to continue to happen into the future. The movie grossing $10,531,026 (USA) (23 December 2015) over the opening weekend and grossing more than $70,259,870 in the USA. This was the second film based on a Michael Lewis book that Brad Pitt produced and appeared in. The first was Moneyball (2011)."], "filmography": ["The Big Short"]}