{"name": "Paul X. Campanella", "current role": "Banker", "birth name": " ", "birth date": " ", "birth place": " ", "height": "5' 9\" (1.75 m)", "biography": "Born & raised in Buffalo, New York, Paul began performing in his early teens acting & singing in bands. Over the span of his career he has performed live in front over a quarter million people from baseball stadiums to arenas and the Las Vegas stage. His travels have allowed him to perform throughout the U.S., Canada and the Caribbean. He has co-starred in film or shared the stage with such names as Vincent Pastore, Holly Valance, Barry Williams, Rowdy Roddy Piper, Tiffany, Joey Ganniscoli, Jackie \"The Jokeman\" Martling, Kato Kaelin, Rich Little, Pete Barbuti and many more. In 2008 & 2009 he co-produced two star studded charity events in Las Vegas to rave reviews. As an Actor, Singer & Comedic Performer, Paul is what's known as a \"Triple Threat\".In 2011, Paul opened up 231 Productions LLC to begin laying the ground work for producing films based on his original screenplays. The first title is Power Play which is expected to go into production in early 2012. Paul also co-starred with one of his favorite actors, Michael Madsen, in the feature film Dirty dealing 3D set for release in 2012. C. Thomas Howell also stars in this entertaining casino heist film.Think Like a Man Too opened on June 20, 2014 and hit Number 1 at the Box Office it's opening weekend.::The Remington Agency", "trade mark": "Intimidating characters", "trivia": ["In late 2010 Paul established his production company, 231 Productions, for the purpose of getting several screenplays he has written produced. His first venture partners him with Pagano Manwiller Casting Director, Russell Boast, to get the project \"Power Play\" to the big screen."], "filmography": ["The Oath: Outbreak ()", "Pops! ()", "Tripwire", "Dirty Dealing 3D", "Mr. Invincible", "The Idiot: Two Schmucks Looking for Trouble", "The Cross", "Mother", "The Big Short", "Red Herring", "Paul Blart: Mall Cop 2", "Pop Star Puppy", "Midnight Las Vegas", "Think Like a Man Too", "Hard Out", "Here and Now Thereafter", "One Long Day", "Heroes", "Ocean's Thirteen"]}