{"name": "Joe Bucaro III", "current role": "Chauffeur", "birth name": " ", "birth date": "1964-04-04", "birth place": "Wheaton, Illinois, USA", "height": "6' 4\" (1.93 m)", "biography": "Joe grew up in Park Ridge and Wheaton, Illinois, for 27 years. Ever since watching Evel Knievel live at the old Chicago amphitheater jump 10 buses at age 8 and seeing Hooper (1978) in the theaters as an impressionable 13-year-old boy, he knew he wanted to become a Hollywood Stuntman. Climbing the local water towers, hopping freight trains, skateboarding, BMX racing and all sports would prove to be vital in facilitating his dream. He attended Wheaton Central H.S. and graduated in 1982. Central was also the home of John Belushi and writer Bob Woodward who broke the Nixon Watergate scandal. Joe was a 2-sport athlete in H.S. and college, but college was short-lived. He was legendary for his 1/4-mile-long wheelies on his Ninja 900 and hurdling over the roofs of stationary cars. After many odd jobs, sales was his niche, but stunts always loomed in the background. He was a successful food broker, selling steak and seafood door to door throughout the Chicagoland area. When a stunt school opened in Chicago in 1988, Joe jumped at the opportunity. From there, he honed his stunt skills and learned about the motion picture industry, hustling sets and working as an extra in such films as Uncle Buck (1989), The Package (1989) and Flatliners (1990). His first break came when Universal Studios on a nationwide search were looking for stuntman/actors for their Wild West Stunt Show down in Orlando. Out of 2000 or so applicants, he was cast and moved to Florida in 1991. After a 2-year stint in Florida, he was off to Vegas for the stunt Pirate show at the MGM Grand. Bored and agitated, he was too close to LA not to take a chance. Not knowing a soul or having any connections, he hustled the sets and got THE big break doubling for Steven Seagal and hasn't looked back. Since then, Joe has also doubled for Arnold Schwarzenegger, 'Will Ferrell', 'John Cusack', Jeff Goldblum, David Hasselhoff and Dan Marino. He stunt coordinates and doubles for Vince Vaughn and is regarded as one of Hollywood's elite all-around stunt men. He has been nominated twice for the World Stunt Awards and has won two Emmy awards for best action sequence's for television. When he's not doing gags, you'll find him on the golf course (USGA 3 handicap) or scraping pegs on a variety of motorcycles. He is happily married to his wife Lisa and they have two children, Ryder and Raquel. He's living out his GOD-given boyhood dream...::Al Sears - NCAA's All-Time Wrestling Pin Record Holder", "trade mark": " ", "trivia": ["Has a son and a daughter.", "5th cousin of Rock Hudson."], "filmography": ["Birds of Prey", "Lying and Stealing", "Ant-Man and the Wasp", "Blindsided: The Game", "Traffik", "NCIS: New Orleans", "Fathom Premieres 6 Below: Miracle on the Mountain", "Agents of S.H.I.E.L.D.", "Supergirl", "Ant-Man", "Revolution", "Banshee", "Drive", "Hawaii Five-0", "Leverage", "My Name Is Khan", "Chuck", "Californication", "The Cleaner (2008-2009)", "The Apostles", "Heroes", "Underdog", "The Wizard of Gore", "Live Free or Die Hard", "Look", "Cougar Club", "Jericho", "Damages", "The Hard Easy", "Zathura: A Space Adventure", "Supercross", "The Island", "Threat Matrix (2003-2004)", "Bad Santa", "The Guardian", "S.W.A.T.", "National Security", "The 4th Tenor", "xXx", "Bette", "V.I.P. (1999-2000)", "Coyote Ugly", "Martial Law", "Soldier of Fortune, Inc.", "Mike Hammer, Private Eye", "The Replacement Killers", "Ed", "Under Siege 2: Dark Territory", "Only the Strong"]}