{"name": "Angie Dickinson", "current role": "Boxing Spectator", "birth name": "Angeline Brown", "birth date": "1931-09-30", "birth place": "Kulm, North Dakota, USA", "height": "5' 5\" (1.65 m)", "biography": "Angie Dickinson was born in Kulm, North Dakota, in 1931, the daughter of Mr. and Mrs. L. H. Brown. Mr. Brown was the publisher of The Kulm Messenger. The family left North Dakota in 1942 when Angie was 11 years old, moving to Burbank, California. In December of 1946, when she was a senior at Bellamarine Jefferson High School in Burbank, she won the Sixth Annual Bill of Rights Contest. Two years later her sister Janet, did likewise. Being the daughter of a printer, Angie at first had visions of becoming a writer, but gave this up after winning her first beauty contest. After finishing college she worked as a secretary in a Burbank airplane parts factory for 3-1/2 years. In 1953 she entered the local Miss America contest one day before the deadline and took second place. In August of the same year she was one of five winners in a beauty contest sponsored by NBC and appeared in several TV variety shows. She got her first bit part in a Warner Brothers movie in 1954 and gained television fame in the TV series The Millionaire (1955) and got her first good film role opposite John Wayne and Dean Martin in Rio Bravo (1959). Her success then climbed until she became one of the nation's top movie stars.::Kulm Diamond Jubilee Supplement", "trade mark": "Large brown eyes", "trivia": ["Attended Immaculate Heart College and Glendale Community College.", "Attended and graduated from Bellarmine-Jefferson High School in Burbank, California, at age 15, in 1947.", "Had a ten-year, on-again/off-again relationship with Frank Sinatra.", "Ranked #42 on Playboy magazine's \"100 Sexiest Stars of the Century\". [January 1999]", "Said she initially declined to play the ill-fated, sexually frustrated Kate Miller in Dressed to Kill (1980) because she felt her role on the television series Police Woman (1974) had made her into something of a role model, but director Brian De Palma eventually persuaded her to accept the role.", "Sisters: Mary Lou Belmont, who is deceased, and younger sister, Janet Lee Brown.", "Originally had a major role as the main villain in Mel Gibson's Payback (1999) as Mrs. Bronson (there originally was no Kris Kristofferson role). When Mel Gibson took over, the role was deleted. It will be restored on \"Payback - Straight Up\" in 2007.", "Her daughter (with Burt Bacharach), Nikki Bacharach, died at age 40 on January 4, 2007 of suicide in Ventura County, California. She was born prematurely on July 12, 1966 and battled Asperger's disorder, a form of autism.", "Ranked #3 in TV Guide's \"50 Sexiest TV Stars of All Time\" list. [2002]", "Turned down the role of Krystle Carrington on the soap opera Dynasty (1981), which went to Linda Evans.", "First husband Gene Dickinson was a college football star, turned semi-pro. He later moved into the electronics business but they separated in 1956 after four years of marriage.", "One of three daughters born to Leo Henry and Frederica Brown. Her family owned and operated the North Dakota newspaper offices the Kulm Messenger and, later, the Edgeley Mail in the 1930s. The family moved to California when she was around 10 years old.", "Was mentioned in the song \"Putting the Damage On\" by Tori Amos.", "According to director Steve Carver, Dickinson allowed all of the crew to remain on set during the filming of her extensive nude scenes in Big Bad Mama (1974).", "Received a star on the Hollywood Walk of Fame at 7000 Hollywood Boulevard in Hollywood, California on September 10, 1987.", "Worked as a secretary at Lockheed Air Terminal (now Bob Hope Airport) and in an airplane parts factory for 3½ years.", "One of her sisters was an actual \"Police Woman\" with the Burbank Police Department.", "Good friends with singer-comedienne Vicki Lawrence, Frank Sinatra's widow Barbara Marx and actress June Blair.", "Her daughter, Nikki, attended The Newbridge School in Beverly Hills.", "For years she had her legs insured for $1,000,000. She finally stopped when her advancing age made the premiums too expensive.", "Along with Henry Silva, she is one of only two actors to appear in both Ocean's 11 (1960) and its remake Ocean's Eleven (2001).", "In 1993, she became the first and only This Is Your Life (1950) honoree to refuse to do the retrospective show. Friends, acquaintances, and co-workers from her career were waiting to regale viewers with their memories of Dickinson, but as part of the program's format, honorees were never told in advance. She had been lured to a studio on the pretext that she was appearing in a tribute to Brian De Palma, who had directed her in Dressed to Kill (1980). When Ralph Edwards, the show's host, walked on stage and said, \"Angie Dickinson, this is your life!\" she responded, \"F*** no, I won't do it.\".", "Dated musician Billy Vera.", "Her ex-husband Burt Bacharach composed the song, Nikki, for her daughter.", "Was supposed to guest-star on Falcon Crest (1981) as Jane Wyman's long-lost daughter, when storyline development has changed.", "Sam Peckinpah considered her for the role of Carol McCoy in The Getaway (1972).", "Recently asked which actor she wishes she'd done a film with, she answered Clint Eastwood. When interviewer said \"That can still happen\" Dickinson replied, \"Noooooo it can't!\".", "Was almost 40 when she appeared naked onscreen for the first time in Pretty Maids All in a Row (1971). As a younger woman she could not have done this due to the Hays Code, which wasn't dissolved until 1967. Yet when offered the chance to pose for Playboy, she turned it down.", "Turned down advance fee of $75,000 to write her autobiography.", "Separated from Burt Bacharach on September 12, 1976 but didn't file for divorce until 1980.", "Her role in Even Cowgirls Get the Blues (1993) was originally slated for Elizabeth Taylor.", "During a day off of work, she dropped by a rehearsal and [Frank Sinatra] was singing/rehearsing.", "In the same situation as Julie London, Dickinson had to take a break from the movies, in 1967, to become a stay-at-home mother to Nikki, full-time, due to her daughter's problems. She resumed her acting career, a year later.", "After her role in Mending Fences (2009), she retired from acting at age 77.", "In the early 1980s, she starred in two unsuccessful TV series.", "When asked to do the Police Woman (1974) series, Dickinson presented it to Burt Bacharach. He wanted her to make that choice as to whether she needed to star in it or not. She said, yes.", "After traveling continuously, Dickinson gave Burt Bacharach his first gig, in London, England.", "10 weeks before she married Burt Bacharach in Las Vegas, Nevada, they both returned to the United States.", "The hardest scene she ever performed was the taxi scene in Dressed to Kill (1980).", "She eventually placed her daughter, Nikki, at the Wilson Center, a psychiatric residential treatment facility for adolescents in Faribault, Minnesota, where she remained for nine years. Later, Nikki studied geology at California Lutheran University, but her poor eyesight prevented her from pursuing it as a career.", "Lived not too far from Tom Snyder.", "She has appeared in two films that have been selected for the National Film Registry by the Library of Congress as being \"culturally, historically or aesthetically\" significant: Rio Bravo (1959) and Point Blank (1967).", "Ex-daughter-in-law of Bert Bacharach and Irma Bacharach.", "Not only was she once married to a renowned songwriter, but her Beverly Hills neighbor was the legendary Ira Gershwin with whom she regularly played poker for over three decades."], "filmography": ["Mending Fences", "Judging Amy", "Elvis Has Left the Building", "Ocean's Eleven", "Big Bad Love", "Pay It Forward", "Duets", "The Last Producer", "Happily Ever After: Fairy Tales for Every Child", "Comanche", "Sealed with a Kiss", "George & Leo", "Ellen", "Diagnosis Murder", "The Don's Analyst", "Deep Family Secrets", "The Larry Sanders Show", "The Sun, the Moon and the Stars", "Remembrance", "Sabrina", "The Maddening", "Daddy Dearest", "Even Cowgirls Get the Blues", "Wild Palms", "Angie, the Lieutenant", "Treacherous Crossing", "Empty Nest", "Kojak: Fatal Flaw", "Prime Target", "Fire and Rain", "Once Upon a Texas Train", "Big Bad Mama II", "Billy Vera: I Can Take Care of Myself", "Police Story: The Freeway Killings", "Stillwatch", "Hollywood Wives", "A Touch of Scandal", "Jealousy", "One Shoe Makes It Murder", "Cassie & Co.", "Dial 'M' for Murder", "Death Hunt", "Charlie Chan and the Curse of the Dragon Queen", "Dressed to Kill", "Klondike Fever", "The Suicide's Wife", "L'homme en colère", "Pearl", "Overboard", "Ringo", "Police Woman (1974-1978)", "A Sensitive, Passionate Man", "Big Bad Mama", "Police Story", "Pray for the Wildcats", "Hec Ramsey", "The Norliss Tapes", "Rowan & Martin's Laugh-In", "The Outside Man", "Circle of Fear", "See the Man Run", "The Resurrection of Zachary Wheeler", "The Man and the City", "Thief", "Pretty Maids All in a Row", "The Love War", "Some Kind of a Nut", "Young Billy Young", "Sam Whiskey", "A Case of Libel", "Point Blank", "The Last Challenge", "Bob Hope Presents the Chrysler Theatre (1963-1966)", "The Virginian", "The Poppy Is Also a Flower", "Cast a Giant Shadow", "The Chase", "The Art of Love", "The Jack Benny Program", "Dr. Kildare", "The Alfred Hitchcock Hour (1962-1965)", "The Man Who Bought Paradise", "The Fugitive", "This Is the Life", "The Killers", "Captain Newman, M.D.", "The Dick Powell Theatre", "Rome Adventure", "Checkmate", "Jessica", "The Sins of Rachel Cade", "A Fever in the Blood", "Ocean's 11", "Lock Up", "The Bramble Bush", "I'll Give My Life", "Men Into Space", "Wagon Train", "Rio Bravo", "Man with a Camera", "Northwest Passage", "Target", "Mike Hammer", "The People's Choice", "Cry Terror!", "Studio 57", "I Married a Woman", "Colt .45", "State Trooper", "Tombstone Territory", "The Bob Cummings Show (1957-1958)", "Perry Mason", "The Restless Gun", "The Gray Ghost", "The Adventures of McGraw", "M Squad", "The Lineup (1956-1957)", "Have Gun - Will Travel", "Alcoa Theatre", "Run of the Arrow", "Calypso Joe", "China Gate", "Shoot-Out at Medicine Bend", "Cheyenne", "Gunsmoke", "The Black Whip", "Broken Arrow", "Gun the Man Down", "Schlitz Playhouse", "Tension at Table Rock", "The Millionaire", "Down Liberty Road", "It's a Great Life", "Four Star Playhouse", "Chevron Hall of Stars", "The Life and Legend of Wyatt Earp", "General Electric Theater", "Hidden Guns", "Matinee Theatre", "Man with the Gun", "The Return of Jack Slade", "Tennessee's Partner", "Cameo Theatre", "Buffalo Bill, Jr.", "City Detective", "I Led 3 Lives", "Les aventuriers du Far-West", "The Mickey Rooney Show", "Lucky Me", "The Colgate Comedy Hour"]}