{"name": "Billy Slaughter", "current role": "Real Estate Agent", "birth name": "William H. Slaughter", "birth date": "1980-06-03", "birth place": "New Orleans, Louisiana, USA", "height": "5' 7\" (1.7 m)", "biography": "Billy Slaughter has performed in nearly 100 feature films and television series, including: The Magnificent 7, The Campaign, The Big Short, Bad Moms, Daddy's Home, and American Horror Story; and has starred in films such as 4 To Go and Laundry Day. He additionally starred in and Executive Produced Dark Meridian, which won \"Action Film of the Year\" at the 2017 Action on Film Festival, and for which he received a nomination for \"Best Actor.\" Slaughter has worked with numerous industry icons from Denzel Washington, Anthony Hopkins, Robert DeNiro and Gene Hackman to Tom Cruise, Will Ferrell, Will Smith, Mark Wahlberg, and Sylvester Stallone.A New Orleans native, Billy is considered one of the top actors to come out of \"Hollywood South\" and was brought to Los Angeles at the invite of Dustin Hoffman. Since he began acting, Billy was recognized for being an outstanding young talent. He was the youngest \"Lead Actor\" recipient of The Marquee Award for his role in Equus, the youngest acting instructor in New Orleans, and one of the youngest company members of Louisiana's Shakespeare Festival. He has been on the cover of Biz Magazine; featured in Variety, The Hollywood Reporter, and The Times Picayune's 'Best of New Orleans' edition; and listed as one of Gambit Magazine's top young movers and shakers.Slaughter trained classically in England at The British American Dramatic Academy (BADA) and has lived and worked in New York and L.A. He holds a B.A. in Drama and Communications from the University of New Orleans, where he graduated #1 in the Drama program (Cum Laude), and was offered a personal scholarship to The Strasberg Institute by Anna Strasberg. Billy has recently worked on new series with Disney/Marvel, Netflix, Hulu, YouTube, and Blumhouse and has a slate of projects in development under his company Panta Rei Productions.::Panta Rei Productions", "trade mark": " ", "trivia": ["A commercial he did for the New Orleans Saints won the National Sports Forum ADchievement Award for \"Best TV Ad Campaign.\"", "Billy was granted a personal scholarship to the Lee Strasberg Institute by Anna Strasberg.", "Received his second \"Marquee Award\" nomination for a production of \"Romeo & Juliet,\" which he co-produced and swapped in the roles of Romeo and Mercutio ala John Gielgud and Laurence Olivier in their famous 1935 production."], "filmography": ["Butterfly in the Typewriter ()", "In the Cage ()", "Mysterious Circumstance: The Death of Meriwether Lewis ()", "Dark Well", "Mona Lisa and the Blood Moon ()", "One Month Out ()", "The Ravine ()", "They Whisper ()", "The Card Counter", "It's Time ()", "Spring Break '83 ()", "Secrets of Sulphur Springs", "Holidate", "One Nation Under God", "Bill & Ted Face the Music", "One of These Days", "Christmas Cars", "Richard Jewell", "On Becoming a God in Central Florida", "Hot Date", "Jay and Silent Bob Reboot", "Eat Brains Love", "Mindhunter", "Queen Sugar", "Patsy & Loretta", "The Highwaymen", "Bayou Tales", "The First", "The Purge", "Billionaire Boys Club", "Cloak & Dagger", "Laundry Day", "Camera Store", "4: GO", "Geostorm", "Happy Death Day", "Dead on Arrival", "Dark Meridian", "Salem", "Arceneaux: Melpomene's Song", "Max Steel", "Jack Reacher: Never Go Back", "The Magnificent Seven", "Don't Kill It", "Bad Moms", "Cold Moon", "Midnight Special", "Daddy's Home", "The Big Short", "Trumbo", "American Ultra", "Zoo", "Return to Sender", "The Livingston Gardener", "The Red Road", "Kidnapping Mr. Heineken", "Demonic", "Focus", "Zipper", "American Horror Story", "Veronica", "When the Game Stands Tall", "Get on Up", "The Lookalike", "Nashville", "Homefront", "White Rabbit", "Laundry Morning", "Anna Nicole", "Cody the Robosapien", "Remember Sunday", "Shadow People", "The East", "Parker", "The Campaign", "The Philly Kid", "Breakout Kings", "Battleship", "Snatched", "Things We Do for Love", "Storm War", "Colombiana", "Treme (2010-2011)", "Love, Wedding, Marriage", "51", "The Chaperone", "Cell Phone Psycho", "Cigarettes & Nylons", "Cool Dog", "Revenge of the Bridesmaids", "The Gates", "Beauty & the Briefcase", "Wolvesbayne", "Welcome to Academia", "The Open Road", "The Final Destination", "Drop Dead Diva", "12 Rounds", "Deal", "The Staircase Murders", "The Year Without a Santa Claus", "The Last Time", "Click", "Stay Alive", "Growing Pains: Return of the Seavers", "Happy Here and Now", "Blood Feast 2: All U Can Eat"]}