{"name": "Mark Gantt", "current role": "Bartender", "birth name": "Mark Willingham Gantt IV", "birth date": "1968-12-10", "birth place": "Stockton, California, USA", "height": "6' 2\" (1.88 m)", "biography": "As one of the early pioneers of the digital era, Mark is best known for co-creating, writing, producing, and starring in Crackle's groundbreaking, Streamy award-winning series, The Bannen Way. Mark's feature directorial debut, Murder In Mexico, was based on the actual events of Bruce Beresford-Redman and premiered on Lifetime.Mark, a twenty-year film and TV veteran, is a multi-hyphenate who learned the business from the ground up and has had the good fortune of collaborating with many top directors, including Steven Soderbergh, David O. Russell, Sam Raimi, and Robert Rodriguez.As a director, Mark feature directorial debut, Murder In Mexico, starring Colin Egglesfield premiered on Lifetime in Sept of 2015. He's also directed a digital pilot, Intricate Vengeance for Ron Howard and Brian Grazer's New Form Digital, as well as several branded series for AOL, Lifetime, and the Better Sleep Council. In 2019, Mark directed two features in New Mexico, Model Citizen, which premiered on Lifetime in March. He's in post-production on the second feature, The Surrogate. He's also directed commercials and promos for Fox, Capital One, ESPN, Nissan, and GMC.He's also won several awards, including Best Director at Philadelphia First Glance Film and Best of the Fest at the Cinema Series Festival for the short film Donor. The branded series, Suite 7, was nominated for the 2011 BANFF Rockies and the 2012 Webby Awards. Shannen Doherty was awarded Best Performance by the Webbys for her work in the episode.Mark is also co-executive producing and writing two Audible Original True Crime books, Injustice Collector and Contra Costa. The projects hail from XG Productions. The authors of Audible's best selling originals Evil Has A Name and Call Me God.Mark's onscreen credits include Criminal Minds, American Horror Story: Hotel, Ocean's Eleven, Charlie's Angels: Full Throttle, Buffy, the Vampire Slayer, Dexter, Major Crimes, Bluff, Barely Famous and a recurring on The Arrangement on E!As a producer, Mark has produced Psychophonia, a thriller that his wife, Brianne Davis, directed and produced. Mark stars opposite Vedette Lim (True Blood). The two also produced two horror/sci-fi films, The Night Visitor and The Night Visitor 2: Heather's Story with Blanc-Biehn Productions' Jennifer Blanc-Biehn, Michael Biehn, Lony Ruhmann. Mark and Brianne are pitching and developing several feature films and TV series.::Anonymous", "trade mark": " ", "trivia": " ", "filmography": ["Breath ()", "Not a Fairytale", "Criminal Minds", "Escaping Dad", "The Arrangement", "The Night Visitor 2: Heather's Story", "Deadly Signal", "Barely Famous", "Foe", "American Horror Story", "The Program", "Lifeline", "Hidden in the Woods", "Major Crimes", "Bluff (2013-2014)", "Whoa!", "The Night Visitor", "D-TEC: Pilot", "WHOA! Comedy Short", "The Inn", "Meridian", "Among Friends", "Oishi High School Battle", "Sound Advice", "Once Upon", "Dexter", "The Guild", "Leap Year", "Fleshlightning", "Taken by Force", "The Temp Life", "The Bannen Way", "First Strike", "Paradise Hills", "Small Jeans", "What About Brian", "The Shield", "Devil's Highway", "Alias", "Pura Lengua", "Unscripted", "29 and Holding", "The Untitled J.C. Project", "Don't Sing", "Object of Affection", "Charlie's Angels: Full Throttle", "Reach Out", "Without a Trace", "Good for Nothing", "Seoul Mates", "Days of Our Lives", "Ocean's Eleven", "The Hollywood Sign", "Arrest & Trial", "Straight Right", "Buffy the Vampire Slayer", "Volcano"]}