{"name": "Jaclyn Bethany", "current role": "Casino Patron", "birth name": " ", "birth date": " ", "birth place": " ", "height": "5' 9\" (1.75 m)", "biography": "Jaclyn Bethany is an actress and Emmy award winning filmmaker. Called \"fast rising\" and \"one to watch\" by Variety Magazine, she is a recent graduate of the prestigious American Film Institute Conservatory with an M.F.A. in Directing. She has written, produced and directed numerous short films which have played festivals worldwide. Her AFI Thesis Film The Delta Girl starring Isabelle Fuhrman and Caitlin Carver premiered at Holly Shorts in 2018. Jaclyn's work focuses on complex women, stories rooted in her Southern upbringing and LGBTQ stories from the female gaze.In addition to AFI, Ms. Bethany holds a B.A. in Acting from Fordham University, an M.A. in Screenwriting from The London Film School. The Rehearsal, her digital series in which she created and stars, recently won an Emmy Award for Best Supporting Actress in a Digital Drama. Her first feature film Indigo Valley, praised by critics for its subtle, natural performances was released by Giant Pictures and is available via Amazon and Apple TV. She is currently in post-production on her second feature Highway One, an ensemble dramedy set on New Year's Eve. Jaclyn is currently working on an anthology of features shot during the pandemic highlighting dark moments of the elite in American culture and the misrepresentation of the American dream. The first in this series Before the World Set Fire featuring Brooke Bloom (She's Lost Control) and Samuel Levine (Broadway's The Inheritance) recently wrapped shooting in September, followed by the second in this series The Falling World, featuring an ensemble cast. As an actor, she will next be seen in David Fincher's Mank for Netflix, indie feature Under the Lantern Lit Sky and British arthouse film Venice at Dawn. Her theater credits include workshops and productions at Clubbed Thumb (Off-Bway), Powerhouse/NY Stage and Film, the Berkshire Theatre Festival, Arcola Theatre (London), among others. She is represented by Buchwald.::anonymous", "trade mark": " ", "trivia": ["Directed and starred in the musical \"Annie\" in her backyard at age eight."], "filmography": ["Venice at Dawn", "Fun Sized Trouble", "Under the Lantern Lit Sky ()", "Chronicles: Or the Chronicles of a Night Forlorn by Love and Hopefulness", "Mank", "Indigo Valley", "Braided", "The Rehearsal", "Hurt by Paradise", "Moth", "Sunday Tide", "In: Transit", "Mojave", "Indigo Valley", "Same Kind of Different as Me", "Good Luck Marc", "Between Departures", "Dear Annabel", "Resistance", "Miles", "Blindness", "The Devil's Dolls", "Olivia Martha Ilse", "The Big Short", "Trumbo", "I Saw the Light", "Get on Up"]}