{"name": "George W. Bush", "current role": "Self", "birth name": "George Walker Bush", "birth date": "1946-07-06", "birth place": "New Haven, Connecticut, USA", "height": "5' 11½\" (1.82 m)", "biography": "The 43rd President of the United States of America, George Walker Bush (known colloquially as \"W\" to distinguish himself from his father, George Bush, the 41st president of the U.S.), was born two days after the national holiday of the Fourth of July, 1946 in New Haven, Connecticut. There, his father was attending Yale College in the Class of 1949. His mother was Barbara Bush (the former Barbara Pierce), whom his father had married on January 6, 1945. \"W\" was their first child. Bush disliked being called \"Junior\" or Bush II, or even having the term \"Jr.\" abbreviated next to his name.Initially, W's prospects of living up to his illustrious pedigree were dim. Possibly hobbled by dyslexia (a condition little understood and seldom treated during his childhood), Bush proved an uninspired student in high school. He did maintain a gentlemanly \"C+\" average at Yale and acquired a Masters of Business Administration degree from Harvard Business School, but until he turned 40, he seemed to be floundering. He admittedly had a drinking problem in his youth, but a late marriage to Laura Welch helped stabilize him. His rebirth as a believing Christian (he is a Methodist whereas his parents were Episcopalian) in 1986 helped put him on the straight and narrow path that led him to the Presidency.Bush has been discounted many times in his life and career for being wooden and unintelligent due to his fractured speaking style, but in fact, his academic performance was on par if not slightly better than that of his better-spoken, fellow Yalie John Kerry. As Bush's test scores and subsequent achievements suggest an above average intelligence, it is appropriate to believe that he likely has benefited from other's underestimation of his gifts. This was apparent in the first televised debate with Al Gore in 2000, when Bush held his own against the condescending vice president, and in doing so, triumphed in the eyes of the political handicappers.After W. turned his life around in the late 1980s, he began achieving success on his own, though that success inevitably was indebted to his social position and his father's business and political connections, particularly after he himself ascended to the Presidency after the expiration of Ronald Reagan's second term. The first President Bush (Bush 41, as he is colloquially known) had great connections in the Middle East, particularly with the Saudi royal family and the powerful Bin Laden clan. Using his father's Saudi connections, Bush Jr. became a millionaire twice over through Middle Eastern oil projects. His most notable achievement in private life was in becoming president and chief operating partner of the Texas Rangers professional baseball team, which was financially invigorated by the building of a new stadium with taxpayers' funds. For a man whose greatest ambition was not the presidency but to be baseball commissioner, the \"job\" of Rangers owner suited him just fine, and his stint as the amiable owner of the team helped generate good publicity that wiped out his past image as a playboy. When he cashed out his ownership stake, Bush had a $14 million profit. More importantly, ownership of the Rangers positioned him financially and in the public eye for a successful run for the governorship of Texas, which proved to be his springboard to the presidency.Under the quirky Texas constitution, the governor of Texas is primarily a ceremonial position, somewhat akin to that of the president in a Parliamentary system. The true political power in Texas lies with the lieutenant governor, who acts as a prime minister (or provincial premier in Canada) in that that he/she runs the legislature. In a life characterized by luck, the capricious Bush was luckier still in that he was told by the lieutenant governor, a Democrat, that he would make Bush a great governor if he would let him. Bush did and established an enviable reputation, one that crossed both party lines in Texas, where it would have been futile for the governor to act in a partisan fashion.With his father's Eastern Establishment credentials that linked him to the \"Rockefeller Republicans\" (conservative on financial matters, liberal on social issues) and his mother's own noted social liberalism, Bush was seen as being a moderate with a difference. That difference was his connections to the powerful evangelical Christian wing of the Republican Party, due to his own rebirth as a believing Christian and his immersion in day-to-day Texas politics. In the Sun Belt, fundamentalists and evangelicals were considered ordinary, run-of-the-day folk, not the exotics that Washington and the Eastern Establishment looked at them as.With a foot in both wings of the party, Bush was seen as a natural candidate for president after Bob Dole's dolorous 1996 candidacy. That he was a \"straight shooter\" with no scandal attached to him since his misbegotten youth (which he had confessed to and had put behind him) made him attractive to the Republicans, who had tried to terminate William Jefferson Clinton's presidency through impeachment due to his lies linked to his \"bimbo eruptions.\" Bush seemed like a \"Man for All Seasons\" that would be the GOP's best shot of unseating the Clintonistas as represented by Al Gore in the 2000 presidential election.With the Republican Establishment firmly behind him as a kind of \"Great White Hope\" of the Grand Old Party, Bush managed to wrap up the nomination easily, after stumbling initially when confronted with the candidacy of the renegade Republican senator from Arizona, John McCain. Although viewed by most Republicans as a RINO (Republican in name only), McCain dominated the early primaries in states that allowed cross over voting by attracting middle-of-the-road independents and conservative Democrats, but stumbled himself when the primary season headed South. He was badly defeated by Bush in South Carolina, a deeply conservative state that had voted for favorite son (and segregationist) Strom Thurmond in 1948, uber-conservative Barry Goldwater in 1964, and segregationist George Wallace in 1968. McCain also was victimized by smear tactics, such as the whispering campaign started by Mississippi Senator Trent Lott that claimed the renegade McCain had been mentally discombobulated by his seven years as a POW in Vietnam. The dirty tricks used against McCain by Bush campaign manager/major domo Karl Rove would prove to be harbingers of the paranoid style of politics that would come to fruition during Bush's first term.)McCain, a maverick senator with the support of many moderate Republicans and Independents as well as a following among conservative Democrats, was not only smeared, but his attempts to get on the ballot in such states as New York were stymied until the federal courts stepped in. (In 2004, even though he endorsed Bush against Kerry, McCain found himself smeared again by elements connected with Karl Rove when he defended Kerry's war record and patriotism.) The Republican Establishment were determined to give the nomination to a true blue Republican who could win (the color red was not associated with the GOP until Election Night 2000, when it was used as the map color for the Party after a century wherein the Republicans were blue and the Democrats red). After his defeat of McCain in South Carolina, Bush had as easy a time wrapping up the nomination as if he had been an incumbent.At the beginning of the fall campaign, what with the U.S. still enjoying the tail end of almost eight years of prosperity under President Bill Clinton, his vice president, Al Gore, started out as a prohibitive favorite to win the presidency. Gore, whoever, turned out to be unable to shed his past reputation as an uninspiring campaigner, and failed to fire up the uncommitted. Bush, on the other hand, a relative unknown commodity who had enjoyed good press for the past decade as a baseball owner and governor, did not make many errors after appearing at Bob Jones University several weeks after it had banned interracial dating during the early Republican primaries (for which he apologized). He capitalized on the low expectations others had for him, and won respect - and votes - for going the distance without stumbling or embarrassing himself, while Gore had to live down the bimbo eruptions of his past running mate and his own faux pas, such as his claim to have invented the \"Information Superhighway\" (Internet). His stiff, \"Wooden Indian\" style came off as pompous on the campaign trail, giving Bush's persona a boost as it could have been portrayed as bumbling if he had been up against a natural born campaigner such as Bill Clinton or Ronald Reagan.In the game of politics as played in the US, Gore had everything to lose and Bush had everything to gain. Gore had to rise and exceed expectations while Bush merely had to live up to lowered expectations to rise above them and gain credence, and he did, beginning with the first debate. Going into the first debate, pundits expected the better-spoken Gore to eviscerate the syntactically challenged Bush (whose intelligence they disparaged), but it did not happen. Gore was haughty, and since Bush held his own, the governor of Texas was adjudged the winner. From there to the end of the campaign, Gore could never consolidate his early lead, which slipped away.On election day, Bush and Gore were locked in a dead heat. In the closest election in a century, it all came down to a matter of 537 votes in Florida. Out of the nearly six million votes cast in the Sunshine State (5,861,785 total, with 36,742 won by third party candidates), Bush was certified as the winner, with a margin representing 0.0087%, less than nine one-thousandths of a percentage point.After a long drawn-out process involving recounts and court challenges, Bush took the oath of office on January 20, 2001 and won re-election in November 2004 to become the first son of a president to win two terms in office.::Jon C. Hopwood", "trade mark": "heavy texan accent", "trivia": ["Son of 41st President of the United States George Bush (George Herbert Walker Bush) and Barbara Bush, and paternal grandson of Connecticut U.S. Senator Prescott Bush.", "Elected to two terms as Texas Governor, defeating Governor Ann Richards in 1994, winning re-election in 1998, and thereby became the first governor in Texas history to be elected to two consecutive four-year terms.", "Served in the Texas Air National Guard.", "Arrested in 1976 for driving under the influence of alcohol, in Kennebunkport, Maine. Pled guilty, paid fine, and had driver's license suspended for 30 days.", "He began his career in the oil and gas business in Midland, Texas in 1975 and worked in the energy industry until 1986.", "Has fraternal twin daughters, Barbara Bush and Jenna Bush, were born November 25, 1981.", "He was the managing general partner of the Texas Rangers baseball team from 1989-1994.", "He graduated from Yale University with a degree in history, and then earned an MBA from Harvard University. Despite this, his supposed lack of intelligence was often the subject of ridicule by comedians. Robin Williams criticized Bush's malapropisms and said \"Comparing him to Churchill is akin to comparing Margaret Thatcher and Paris Hilton.\" Similarly, British satirist Ian Hislop once commented that Bush \"makes Reagan look like Einstein\".", "Is only the second President in United States history to be the son of a former President, after 2nd President of the United States John Adams, and his son, 6th President of the United States John Quincy Adams.", "He was named Time magazine's \"Person of the Year 2000\" on December 18, 2000, which was just five days after the Supreme Court decided the landmark case of Bush v. Gore, deciding the 2000 U.S. Presidential Election in his favor.", "Collects autographed baseballs and owns over 250.", "(Fall 2000) Daughter Barbara Bush is attending Yale University, her father's (class of 1968), her grandfather's (George Bush, class of 1948), her great grandfather's (US Senator Prescott Bush, class of 1917), and her great-great-great grandfather's (Rev. James Smith Bush, class of 1844) alma mater.", "Portrayed by Will Ferrell on Saturday Night Live (1975).", "Arrested twice for college pranks (charges dropped) for celebrating a Yale football victory by pulling up Princeton goal posts and for \"borrowing\" a large Christmas wreath from a store door (source: Washington Post).", "Is the only U.S. president ever to father twins.", "His twin daughters have been in trouble with the law in recent months. In October 2000, Barbara Bush tried to use a fake ID to buy alcohol at a bar in New Haven, CT, but was not served and was not arrested. In February 2001, Jenna Bush sent her Secret Service agents to bail her friend out of jail after he had been arrested for underage drinking. In April 2001, Barbara gave her Secret Service agents the slip while on her way to a WWF match in NYC. Also in April 2001, Jenna was cited for underage drinking at an Austin bar and pleaded no contest to the charges. She paid $51.25 in court costs, performed eight hours of community service doing clerical and research work at the Mexic-Arte Museum in Austin, and attended eight hours of alcohol awareness classes. In May 2001 both Barbara and Jenna were cited for alcohol offenses. Barbara pleaded no contest to being a minor in possession of alcohol and was sentenced to probation, eight hours of community service, alcohol awareness classes, and a $100 fine. Jenna pleaded innocent to trying to buy alcohol with a fake ID and will be tried in Austin on July 31, 2001. [June 2001]", "Named one of People Magazine's \"25 Most Intriguing People of 2001.\"", "Is the first US president to hold an MBA (Master of Business Administration) degree.", "His 1500-acre Crawford, TX, ranch is named Prairie Chapel.", "Is the cousin of Billy Bush.", "He owns his look-alike puppet from the French show Les Guignols de l'info (1988).", "His succession to the Presidency was ultimately decided by the Supreme Court, in a 5-4 split decision, after a six week battle over who actually won the election.", "Lost the popular vote, just like John Quincy Adams, the first president to be the son of a former president. However, Adams did not win the electoral college; that election was decided by Congress. Bush was able to win the disputed electoral college, ultimately receiving 271 electoral votes to Al Gore's 266 electoral votes.", "Calls all regular White House strategy meetings \"strategery\" meetings in honor of Will Ferrell's portrayal of him on Saturday Night Live (1975).", "Recognized as President-elect of the United States on December 13, 2000, following the concession of Vice President Al Gore, ending over a month of controversy over the result of the election.", "He played baseball and was a cheerleader at Phillips Academy at Andover. One of his classmates was Dick Wolf.", "Enjoys playing golf.", "He, his father, and grandfather, all held membership in Yale University's Skull and Bones Society, as did his 2004 presidential election opponent, John Kerry.", "9th cousin twice removed of John Kerry, his rival in the 2004 election. Both are descended from Edmund Reade (1563-1623).", "His SAT score was 1206 (566 verbal, 640 math).", "His cumulative undergraduate GPA at Yale was 2.35.", "Was the first president in four presidential elections to win the majority of the popular vote, 51% in 2004. The last previous president to do so was his father, George Bush in 1988. Additionally, in 2004, he was the only Republican nominee to win the popular vote in a string of six elections, which included his win of the electoral college in 2000 while losing the popular vote to Al Gore. Republicans lost the popular vote in 1992, 1996, 2000, 2008, 2012 and 2016.", "Is the first father or son of a president to serve two terms. John Adams, John Quincy Adams, and his own father, George Bush, all lost their bids for re-election.", "Since 1932, the fate of the incumbent party has always paralleled the outcome of the final pre-election football game played by the Washington Redskins. In 2004, he became the first presidential candidate to break that pattern, by winning a second term as president despite a Redskins loss.", "Was re-elected as President of the United States on Tuesday, November 2, 2004, receiving 59,459,765 votes (51% of the popular vote) and 286 electoral votes to Democratic challenger John Kerry's 55,949,407 votes (48% of the popular vote) and 252 electoral votes. Headed a Republican Party that controlled the White House, Senate and Congress, and also has a majority (28 of 49, with one to-be-announced) of Governors in the U.S. until the 2006 mid-term congressional elections, at which time the Republican party lost control of both the Senate and the House of Representatives.", "Brother of Jeb Bush, former governor of Florida.", "He has been portrayed on Saturday Night Live (1975) by Will Ferrell, Darrell Hammond, Chris Parnell and Will Forte.", "According to Karl Rove, his favorite science fiction TV series is Babylon 5 (1993).", "Named Time magazine's Person of the Year for 2004.", "Is the first U.S. President to receive an acting nomination and then subsequently the win, from the Razzie Awards. He was nominated for and won Worst Actor in the film Fahrenheit 9/11 (2004). Though technically he was not acting in the film, merely playing himself via archive footage.", "He is the first president whose actions have prompted the release of a major motion picture (Fahrenheit 9/11 (2004)), the launch of an entire radio network (Air America Radio), and the premiere of a television series (Sundance Channel's The Al Franken Show (2004)).", "Unlike his father, he has no sons to pass on the name of George Bush. Instead, he has a nephew named George P. Bush, who is the son of his brother Jeb Bush.", "His favorite actors are Chuck Norris and Sylvester Stallone. Both attended his first presidential inauguration on January 20, 2001.", "Is a member of the Phi chapter of Delta Kappa Epsilon fraternity from his days at Yale.", "A statement Bush made in January 2001 referred to the \"operating location near Groom Lake\", which is the first official recognition of the existence of Area 51.", "In the late 1960s attended Yale University along with future Doonesbury cartoonist Garry Trudeau. They served on the dormitory social committee simultaneously.", "Is the only serving U.S. President to never have been portrayed on The Simpsons (1989). The only exception was when Homer Simpson used a crude cut-out of him to fool his father, ex-President George Bush, in episode The Simpsons: Two Bad Neighbors (1996). At the time, he was the Governor of Texas.", "Born in Yale New Haven Hospital in New Haven, Connecticut. Actor Girard Swan, who was born in the same hospital, is the first cousin of former FBI Director Robert S. Mueller III, a George W. Bush appointee.", "He was the first sitting US President to visit an Olympic games outside the United States when he observed the 2008 Olympic Summer Games in Beijing, China.", "Went to Yale University with Lanny Davis, a well known Democrat who was appointed Special White House Counsel by President Bill Clinton. Davis and Bush were close friends and fraternity brothers. In 2005, Bush appointed Davis to serve on the five-member Privacy and Civil Liberties Oversight Board, which had been created by the U.S. Congress as part of the 2005 Intelligence Reform Act. Davis was the only Democrat appointed to that board by Bush.", "The first President in 112 years to lose the popular vote and win the Electoral College vote. The next time that this happened was 16 years later, when Donald Trump was elected.", "Was an F-102 pilot with the Air National Guard.", "Quit smoking cigarettes in the 1980s, but continues to smoke occasional cigars.", "Had both the highest and lowest approval ratings of any president according to Gallup polls. Bush enjoyed a 90 percent approval rating following the 9/11 attacks, but by the end of his presidency his approval ratings were around 25 percent in late 2008 as his presidency was nearing its end.", "He was the first sitting president to visit Sweden, in 2001.", "Was elected as 43rd President of the United States. (November 2004) Was re-elected 43rd President of the United States. [November 2000]", "Resides, with his wife Laura Bush, outside Dallas, Texas in semi-retirement, in a house purchased during his last few months in office; and makes occasional public appearances as a motivational speaker. [February 2010]", "He was raised in Midland and Houston, Texas, USA, with four siblings, Jeb Bush, Neil Bush, Marvin Bush, and Doro Bush (Dorothy Bush Koch). His fifth sibling, younger sister Robin, died from leukemia at the age of three in 1953.", "Daughters Barbara Bush and Jenna Bush were named for their grandmothers, George W. Bush's mother Barbara Bush, and Laura Bush's mother Jenna Welch.", "Bush ran for, and lost, the 1978 race for Congress from Texas's 19th congressional district. The Democrat who won, Kent Hance, portrayed him as out of touch with the constituents of the district. Bush lost the election by approximately 6,000 votes (6%) out of the 103,000 votes cast in the general election.", "Is one of three former Presidents of the United States, also including 39th President Jimmy Carter, and 42nd President Bill Clinton, along with 44th and current President Barack Obama to attend the funeral and other events surrounding the death of former South African President Nelson Mandela in December 2013. This is only the second time that four current and former Presidents of the United States have been together on foreign soil.", "Under a law signed by immediate predecessor President Bill Clinton, George W. Bush was the first president to earn $400,000 salary per year as of his inauguration on January 20, 2001. This represented a doubling of the previous presidential salary of $200,000 per year, which had been in place since January 20, 1969, and was the pay rate of Presidents Richard Nixon, Gerald Ford, Jimmy Carter, Ronald Reagan, George Bush, and Bill Clinton.", "Was the third Republican, and fourth President overall, from Texas since 1953, after Republicans Dwight D. Eisenhower (1953-1961), George Bush (1989-1993), and Democrat Lyndon B. Johnson (1963-1969).", "Between 1952 and 2004, every Republican presidential ticket, except one, included the name of either Richard Nixon, Bob Dole, or someone named Bush. 1952 - Eisenhower/Nixon, 1956 - Eisenhower/Nixon, 1960 - Nixon/Lodge, 1964 - Goldwater/Miller (the only exception), 1968 - Nixon/Agnew, 1972 - Nixon/Agnew, 1976 - Ford/Dole, 1980 - Reagan/Bush, 1984 - Reagan/Bush, 1988 - Bush/Quayle, 1992 - Bush/Quayle, 1996 - Dole/Kemp, 2000 - Bush/Cheney, 2004 - Bush/Cheney. This was a period of 52 years and 14 presidential elections.", "Is a stanch Republican.", "Is a distant relative of British actress Lily James.", "Has two granddaughters, both through his daughter, Jenna Bush Hager: Margaret Laura and Poppy Louise. They are named after their great-grandparents.", "Began painting after leaving the Presidential office.", "Refuses to publicly criticize or critique his Presidential successors.", "Graduated from Harvard Business School.[1975].", "Was paid $10 million for his memoir Decision Points.[2010].", "Was the 43rd President of the United States. In addition to being 41st President, his father, George Bush, was 43rd Vice-President.", "Born on the same date as [Fred Dryer] and [Sylvester Stallone].", "Born on the same date as Fred Dryer and Sylvester Stallone.", "He formed a close political and personal relationship with UK prime minister Tony Blair, especially following the September 11th attack and Operation Iraqi Freedom, for which Blair offered unwavering support for the US foreign policy. This was despite the fact that Blair was generally regarded as closer in his political outlook to Bush's predecessor as President, Democrat Bill Clinton, who had been a big influence on Blair's \"New Labour\" reinvention of the UK Labour Party.", "He was the second of three US Presidents born in 1946 (the others are Bill Clinton and Donald Trump).", "The iconic image of a seated Bush being first notified of the 9/11 attacks, captured then White House Chief of Staff Andrew Card, stooped, as he whispered in a horrified Bush's ear [Emma E. Booker Elementary School, Sarasota, Florida, 09:05, Sept. 11, 2001].", "Shortly after the 9/11 terrorist attacks, Bush signed into law the controversial \"Patriot Act\" on October 26, 2001.", "Was the second Republican Presidental candidate to win the election without the help of Pennsylvania & Michigan (key swing states). Richard Nixon was the first. However, Bush is so far, the only Republican President to win two terms without the help of Pennsylvania & Michigan."], "filmography": ["George W. Bush: Character Actor"]}