{"name": "Tupac Shakur", "current role": "Self", "birth name": "Lesane Parish Crooks", "birth date": "1971-06-16", "birth place": "East Harlem, Manhattan, New York City, New York, USA", "height": "5' 10¾\" (1.8 m)", "biography": "Born in New York City, Tupac grew up primarily in Harlem. In 1984, his family moved to Baltimore, Maryland where he became good friends with Jada Pinkett Smith. His family moved again in 1988 to Oakland, California. His first breakthrough in music came in 1991 as a member of the group Digital Underground. In the same year he received individual recognition for his album \"2Pacalypse Now,\" but this album was also the beginning of his notoriety as a leading figure of the gangster permutation of hip-hop, with references to cop killing and sexual violence. His solo movie career also began in this year with Juice (1992), and in 1992 he co-starred with Janet Jackson in Poetic Justice (1993).However, law confrontations were soon to come: A 15-day jail term in 1994 for assault and battery and, in 1995, a conviction for sexual assault of a female fan. After serving 8 months pending an appeal, Shakur was released from jail.::Bruce Cameron <dumarest@midcoast.com>", "trade mark": "Socially conscious lyrics", "trivia": ["Renamed Tupac Amaru Shakur in 1972 by his mother after Tupac Amaru, an Inca who was sentenced to death by the Spaniards. Tupac Amaru, in the Inca language, means \"shining serpent\".", "Son of black panther Afeni Shakur; grew up in Harlem, Baltimore, and Marin County, California.", "He had the words \"thug life\" tattooed across his abdomen.", "Was engaged to Kidada Jones after time of his death.", "Was going to play the role of Malik in Higher Learning (1995)", "Died on a Friday the 13th.", "More of his music has been released since his death than was while he was alive.", "Appeared in the Salt-N-Pepa video, \"Whatta Man.\".", "Founding Member of the Outlawz", "Used the name Makaveli which is an altered spelling of Machiavelli, about whom he read while in prison.", "In the song \"Life Goes On\" from the \"All Eyez on Me\" album, he rhymes about his own funeral.", "As a young man, Tupac also studied dance, including ballet.", "Tupac is listed as the most successful gangsta MC in the \"Guinness Book of World Records.\"", "Grew up in Baltimore, Maryland, USA.", "Jim Carrey was his favorite actor.", "Was cast in the movie Woo (1998), but was shot five days before principal photography began.", "He was offered a record contract at the age of 13. However, his mother refused to let him sign anything at such a young age. She felt he had a lot to learn about the world before joining the music industry.", "He read for the part of \"Bubba\" in Forrest Gump (1994).", "10 albums have been released after his 1996 death; all have gone platinum.", "He was voted the 86th Greatest Rock 'n Roll Artist of all time by Rolling Stone.", "In November 1994, he was robbed and shot five times by a pair of muggers in the lobby of a New York recording studio. Tupac survived the attack, and afterwards frequently boasted of his durability in his lyrics.", "Was originally cast in Menace II Society (1993) but was fired after a physical altercation with director Allen Hughes.", "As a teenager, he studied drama at Baltimore's School for the Arts, where he rhymed under the name MC New York.", "When he was 12 years old, his mother enrolled him in Harlem's 127th St Ensemble. He played Travis in \"A Raisin in The Sun\" in his first acting role", "Started his career on Tommy Boy/Warner Bros. Records with Digital Underground.", "As a young man, he also studied ballet and dance", "His 1996 song \"Ghetto Gospel\" was released in 2005, with some vocals by Elton John, and went to #1 in the UK, despite the fact he had been dead for eight years.", "Was a good friend of fellow hip-hop MC M.C. Hammer, who also was from Oakland, California, USA.", "His albums have sold 38 million copies in the USA alone.", "Had been rapping since he was 18 years old (1989).", "According to Guiness Book of Records 2004, he is the highest selling rap/hip-hop artist selling over 67 million copies worldwide", "In a 2005 Rolling Stones Magazine Vote, Tupac was named #6 of the '100 immortal artists of all time' behind the likes of Elvis and Lennon", "He is the first rap/hip-hop artist in history to have a wax model of himself set to be placed in Madamme Tussaud's in Las Vegas", "Appeared on Forbes' \"Top Earning Dead Celebrities\" list in 2002, 2003 and 2004 with earnings of $7 million, $12 million and $5 million in each respective year.", "Wrote a song, but died before he could finish it. Rap artist Eminem finished the song with his own lyrics and released it shortly afterwards.", "First music artist to have a #1 LP while being in jail", "Biological Father Is Billy Garland.", "The harmonica in \"So Many Tears\" is a sample from Stevie Wonder's song \"That Girl\", which spent 9 weeks at number one on the R&B charts in 1982.", "His song \"Hit 'Em Up\", which Shakur considered a \"classic battle record\" is scathing attack on one-time friend 'Notorious BIG', Bad Boy Records, and 'Sean 'Diddy Combs. In addition, Shakur claimed that he slept with Faith Evans (Notorious BIG's wife) in the song's lyrics.", "Was a fan of actor Tim Roth and was delighted to learn he would work with him on Gridlock'd (1997), released after Shakur's death.", "Read the article in \"Entertainment Weekly\" about his \"Me Against The World\" album's debut at number one, while incarcerated. The album's title song also appeared in Bad Boys (1995), which opened in March-- while Shakur was behind bars.", "Cited Prince as an inspiration and sampled his music on the \"All Eyez On Me\" album. Shakur mentioned in an MTV interview that \"he [Prince] loves women like I love women.\".", "Used an interpolation of the 1984 El DeBarge song \"A Dream\" for his hit \"I Ain't Mad At Ya\". Tupac's version, however, is at a faster tempo than the original.", "Recorded much of his vocals of the \"All Eyez On Me\" album with a Neumann U87 microphone. In addition, entire album was recorded on analog tape. This was considered somewhat archaic by 1995 recording standards, as much of the recording industry had transitioned to digital recording. (However, it should be noted that Dr. Dre, who produced two songs for the album still uses analog tape to record his music, as of late 2006).", "The song \"To Live and Die in LA\", was called by Shakur (who recorded the song under the name \"Makaveli\", for the \"Seven Day Theory\" album) \"California Love, part 2-- without gay-ass Dre.\" It is unknown if \"gay-ass Dre\" is serious slur against Dr. Dre, who left Shakur's label Death Row records shortly after producing two tracks for \"All Eyez On Me\".", "Shakur considered singer Don McClean (best known as the singer/songwriter of the 1972 hit \"American Pie\") and Kate Bush as two influences in his life. Shakur also saw McClean's hit \"Vincent\" (a tale of painter Vincent Van Gogh) as one particular inspiration. In addition, Shakur cited African-American poet Maya Angelou and William Shakespeare as being equally important to him.", "Gang member Orlando Anderson, often cited as Tupac's killer, was later murdered himself during an altercation at a LA car wash, on May 29th 1998. It should be noted that Anderson was never charged in the slaying.", "He completed the 27 song \"All Eyez On Me\", considered by many to be his magnum opus, in only two weeks. Often cited as rap's first double album, \"All Eyez\" sessions began just hours after Shakur was released from jail. Released on February 13th 1996, the album debuted at number one on the Billboard 200 album chart.", "His career triumphs--a number one album and pop single-- both happened on the 13th: Rap's first double album, \"All Eyez on Me\" (certified by the RIAA as of December 2006 at 9 million copies sold) hit store shelves on February 13th 1996. His only number one pop single \"How Do U Want It?\", reached the apex of the Hot 100 on July 13th 1996. Sadly, it was on September 13th (a Friday) that Shakur succumbed to injuries sustained in a Las Vegas shooting.", "\"The Don Killuminati: The 7 Day Theory\" was recorded and mixed in a mere 7 days in August 1996. It was released November 5, 1996 and debuted at number one on both the pop album and R&B/Hip-Hop album charts, with 663,000 albums sold in its first week. It is certified at 7 million albums sold in the US and 28 million albums worldwide, making it both Tupac's best-selling album.", "His first album, \"2Pacalypse Now\" was released November 12, 1991 and was certified gold. It contains 13 songs and reached number 13 on the R&B/Hip-Hop albums.", "Shakur was shot in Las Vegas on September 7, 1996 at approximately 11:15pm, at the corner of Flamingo and Koval streets.", "Shakur renamed his publishing company to \"Joshua's Dream\" in honor of a young, terminally ill child whose dying wish was to meet him.", "His number one single, \"California Love\" was certified at sales of 2 million copies in 1998.", "Tupac used the Roland D70 synthesizer for his album \"All Eyez On Me\" (as seen in an interview with MTV in 1996).", "Recorded close to 150 songs during the final year of his life, and often completed three songs per day in the same period. Shakur also wrote lyrics in the studio and often performed his verses in one take. He felt that rappers who could not perform their verses properly on the first take weren't ready to be rappers. R&B music, on the other hand, was worthy of multiple takes for the vocal tracks, he felt.", "His 1996 song \"Me and My Girlfriend\" (from the rapper's posthumously released \"Don Killuminati\" album) chronicles Shakur's relationship with his pistol, which he frequently carried for protection. The \"finger fucking\" Shakur refers to in the song is actually a euphemism for pulling the trigger. The song was covered in 2003 by Beyoncé and Jay-Z with a slightly altered chorus; it reached the top ten of the American pop charts.", "Moved out of his mother's house when he was 17.", "Along with friends, he founded the \"Junior Black Panthers\" in his youth.", "His favorite singer was Prince.", "Mentioned in the rap-rock song \"Mope\" by Bloodhound Gang, along with personalities like Luciano Pavarotti, The Notorious B.I.G., Falco, Tori Spelling, Bo Jackson and Wolfgang Amadeus Mozart.", "Ranked #3 on VH1's 50 Greatest Hip Hop Artists.", "Tupac died with less than $100,000 in the bank.", "Is portrayed by Anthony Mackie in Notorious (2009).", "His godfather was Geronimo Ji Jaga, a member of Black Panther Party for Self Defense, a radical group advocating violence in obtaining civil rights for African-Americans. Shakur's parents, Afeni Shakur and Billy Garland, were also members of the group.", "Was planning to record with the Wu-Tang Clan near the end of his life, as he revealed his admiration for their sound and lyrics.", "New album 'Pac's Life' (originally titled 'Ready 2 Die') is released. [November 2006]", "\"Loyal To The Game\" was released on Dec. 14. It is the 9th album of his to be released after his death. [December 2004]", "Has another posthumous album tentatively tiled \"Ready 2 Die\". It's also his 14th album. [2005]", "A fan of Tim Roth, Shakur was excited when he found out he was going to be in a movie with Roth. Roth, however, didn't like the idea of a rapper being in the movie with him, as he didn't know he was an actor before he became a rapper. Roth's attitude changed, when they tested together and the two were very good friends until Shakur's death.", "Was John Singleton's first choice to star in Shaft (2000) when the film was going to be called Son Of Shaft.", "Was the original choice for Jody in Baby Boy (2001).", "His godmother Assata Shakur, was found guilty of the 1973 murder of a New Jersey state trooper. She broke out of prison and fled to Cuba. In 2013 she was added to the FBI's list of Most Wanted Terrorists.", "Died on the same day that the pilot episode of Everybody Loves Raymond (1996) premiered.", "Auditioned for the role of Gerald \"Gee Money\" Wells in New Jack City(1991) but was turned down because he was than that of leading star Wesley Snipes.", "Inducted into the Rock & Roll Hall of Fame in 2017.", "Was friends with Jasmine Guy, Snoop Dogg, Keyshia Cole, and Jon B..", "He played the role of Travis Younger in the play, A Raisin in the Sun, at the Apollo Theater.", "He also performed under the stage name Makaveli. His song \"Dear Mama\" was added to the Library of Congress in 2010.", "A hologram of his body performed alongside his former friends Dr. Dre and Snoop Dogg at the Coachella music festival in 2012."], "filmography": ["R.I.P. Tribute - Collector's Edition II - EYES ON HIP HOP", "Gang Related", "Makaveli Feat. Outlawz & Prince Ital Joe: Hail Mary", "Gridlock'd", "2Pac: All About U", "2Pac Feat. Dr. Dre & Roger Troutman: California Love", "2Pac Feat. Outlawz: Made Niggaz", "Makaveli Feat. Val Young: To Live & Die in L.A.", "Makaveli Feat. Danny Boy, Aaron Hall, K-Ci & JoJo: Toss It Up", "2pac Feat. Danny Boy: I Ain't Mad at Cha", "2Pac Featuring Dr. Dre: California Love, Version 2", "2pac Feat. K-Ci & JoJo: How Do U Want It", "2pac Feat. K-Ci & JoJo: How Do U Want It, Live", "2Pac Feat. Outlawz: Hit 'Em Up", "2Pac & Snoop Doggy Dogg: 2 of Amerikaz Most Wanted", "Bullet", "2Pac: So Many Tears", "2Pac: Temptations", "Eyes on Hip Hop", "2Pac: Dear Mama", "Murder Was the Case: The Movie", "Dr. Dre and Ice Cube: Natural Born Killaz", "Thug Life: Pour Out A Little Liquor", "Above the Rim", "2Pac Feat. Wycked: Papa'z Song", "Papaz Song by Tupac", "Salt 'N' Pepa Feat. En Vogue: Whatta Man", "2Pac: Holler If Ya Hear Me", "2Pac: Keep Ya Head Up", "2Pac Feat. Digital Underground: I Get Around", "Poetic Justice", "A Different World", "2Pac: Brenda's Got a Baby", "2Pac: If My Homie Calls", "2Pac: Trapped", "Naughty by Nature: Uptown Anthem", "Drexell's Class", "Juice", "Nothing But Trouble"]}