{"name": "Pharrell Williams", "current role": "Self", "birth name": " ", "birth date": "1973-04-05", "birth place": "Virginia Beach, Virginia, USA", "height": "5' 9\" (1.75 m)", "biography": "Pharrell Williams was born on April 5, 1973 in Virginia Beach, Virginia, USA. He has been married to Helen Lasichanh since October 12, 2013. They have four children.::Anonymous", "trade mark": "Often wears clothes from his own range", "trivia": ["The Neptunes have a record label under Arista Records called Star Trak Entertainment.", "Lead vocalist of the hip hop group N.E.R.D. (No One Ever really Dies) along with Neptunes partner Chad Hugo and rapper Shay.", "N.E.R.D. does a small tour of the United States at clubs, parks and other small venues (2002).", "One half of The Neptunes, one of the biggest music producing teams working today. Has produced hits for music acts ranging from pop acts Britney Spears and *NSYNC, bands No Doubt and Limp Bizkit, R&B crooners Babyface and Usher, to rappers Nelly, Jay-Z, Ray J, Noreaga, Busta Rhymes, Mystikal, P. Diddy, Ludacris, Ma$e, and Fabolous among many others.", "Grew up in Virginia Beach with lifelong friend and producing partner Chad Hugo.", "Attended Princess Anne High School in Virginia Beach. Teddy Riley built his studio Future Records next to Princess Anne HS.", "Parents are Carolyn L. (Hoggard) and Pharaoh Williams, Jr.", "Has two younger brothers, Cato and Psolomon. Cato Williams is a professional skateboarder. There is a 10 year age difference between Pharrell and Cato and a 20 year age difference between Pharrell and Psolomon.", "Has two half brothers, Pharoah and David. David is a furniture salesmen in Delaware.", "Has his own clothing line name BBC (billionare boys club)", "Collabarated with Gwen Stefani, Jay-Z, Slim Thug, Snoop Dogg, Pusha T, Kanye West and Nelly on his debut solo album \"In My Mind\".", "Has a line of Shoes and T-Shirts called Ice-Cream.", "His debut album \"In My Mind\" was nominated for Best Rap Album at the 49th Annual Grammy Awards in 2007. He was beaten by Ludacris' album \"Release Therapy\".", "Established his own clothing line, the Billionaire Boys Club (BBC), in collaboration with Nigo, who is best known for his brand A Bathing Ape (also known as BAPE). Billionaire Boys Club is also based in line with Ice Cream Footwear, a brand of shoe designed by Pharrell and produced by Reebok.", "Has modeled for Louis Vuitton (2006).", "Voted the Best Dressed Man in the World by Esquire magazine (2005).", "Established a jewelery line through Louis Vuitton called Blason with Camille Miceli.", "In 2012, he became engaged to model and fashion designer Helen Lasichanh.", "Performed his current single \"Can I Have It Like That?\" at the Nordic Music Awards in Copenhagen, Denmark. [October 2005]", "One of Time magazine's 100 Most Influential People in the World. [April 2014]", "He was awarded a Star on the Hollywood Walk of Fame for Recording at 6270 Hollywood Boulevard in Hollywood, California on December 4, 2014.", "His wife Helen Lasichanh are expecting 2nd child together in the spring 2017.", "His estimated net worth is $1.5 million.", "Bought a home in Laurel Canyon, Los Angeles in 2015.", "Nephew of Bishop Ezekiel Williams."], "filmography": ["Sing 2", "Pharrell Williams Feat. Jay-Z: Entrepreneur", "Black Is King", "The Chanel Pharrell Collection", "The Grinch", "Mike Will Made It Feat. Pharrell Williams & Quavo & Big Sean & Rae Sremmurd: Aries (YuGo) Part 2", "Migos: Stir Fry", "Justin Timberlake: Supplies", "Louis XIII presents Pharrell Williams 100 Years", "Calvin Harris Feat. Pharrell Williams, Katy Perry, Big Sean: Feels - Version 2", "Calvin Harris Feat. Pharrell Williams, Katy Perry, Big Sean: Feels", "Pharrell Williams: There's Something Special", "Yellow Light", "J. Balvin Feat. Pharrell Williams, BIA, Sky: Safari", "Popstar: Never Stop Never Stopping", "Puff Daddy & The Family Feat. Pharrell Williams: Finna Get Loose", "Pharrell Williams: Freedom", "Entourage", "Snoop Dogg Feat. Stevie Wonder & Pharrell Williams: California Roll", "Pitch Perfect 2", "Snoop Dogg: So Many Pros", "The Simpsons", "Reincarnation", "BBC Music: God Only Knows", "Pharrell Williams: Gust of Wind", "Usher Feat. Nicki Minaj & Pharrell Williams: She Came to Give It to You", "Amex Unstaged Pharrell Williams Live at the Apollo", "Ed Sheeran, feat. Pharrell Williams: Sing", "Pharell Williams: Sprint Sound Sessions", "Alicia Keys Feat. Kendrick Lamar: It's on Again", "Beyoncé Feat. Frank Ocean: Superpower", "Pharrell Williams: Happy", "Azealia Banks Feat. Pharrell: ATM Jam", "Tyler, The Creator: Tamale", "Cris Cab: Liar Liar", "Daft Punk Feat. Pharrell Williams: Lose Yourself to Dance", "Azealia Banks Feat. Pharrell: ATM Jam", "Nelly Feat. Nicki Minaj & Pharrell Williams: Get Like Me", "Busta Rhymes Feat. Nicki Minaj: Twerk It", "Daft Punk Feat Pharrell Williams: Get Lucky", "Robin Thicke, feat. T.I. & Pharrell: Blurred Lines", "T.I. Feat. Sk8brd: Here Ye, Hear Ye", "Chris Brown & Benny Benass: Beautiful People", "The Greatness", "Swedish House Mafia Feat. Pharrell: One", "N.E.R.D. Feat. Nelly Furtado: Hot-n-Fun", "Get Him to the Greek", "Pitbull Feat. Pharrell Williams: Blanco", "90210", "Madonna: Celebration - The Video Collection", "Fall Out Boy: I Don't Care", "Madonna: Give It 2 Me", "N.E.R.D.: Everyone Nose", "The Game Feat. Kanye West: Wouldn't Get Far", "Sleepy Brown Feat. Pharrell & Big Boi: Margarita", "Ludacris Feat. Pharrell: Money Maker", "Mariah Carey Feat. Snoop Dogg: Say Somethin'", "Pharrell Ft. Gwen Stefani: Can I Have It Like That", "The Notorious B.I.G. Feat. P. Diddy, Nelly, Jagged Edge & Avery Storm: Nasty Girl", "Snoop Dogg Feat. Pharrell Williams: Drop It Like It's Hot", "The Ecology of Love", "Dude... We're Going to Rio", "Kardinal Offishall Feat. Pharrell Williams: Belly Dancer", "Pharrell Ft. Jay-Z: Frontin'", "Diddy Feat. Lenny Kravitz & Loon & Pharrell: Show Me Your Soul", "Justin Timberlake: Señorita", "The Rolling Stones: Sympathy for the Devil", "Snoop Dogg Feat. Pharrell & Uncle Charlie Wilson: Beautiful", "Justin Timberlake: Like I Love You", "Britney Spears Feat. Pharrell Williams: Boys", "Busta Rhymes Feat. P. Diddy & Pharrell: Pass the Courvoisier, Part II", "Ray J: Wait A Minute"]}