{"name": "Christina Hendricks", "current role": "Blanche", "birth name": "Christina Rene Hendricks", "birth date": "1975-05-03", "birth place": "Knoxville, Tennessee, USA", "height": "5' 8\" (1.73 m)", "biography": "Christina Rene Hendricks was born in Knoxville, Tennessee, and grew up in Twin Falls, Idaho. Her father, Robert, originally from England, worked for the U.S. Forest Service, while her mother, Jackie Sue (Raymond), was a psychologist. At the age of 13 her father transferred to the Forest Service Washington, D.C. headquarters and the family moved to nearby Fairfax, Virginia. She began acting at school and went into modeling from the ages of 18 to 27. In her early 20s, she also began appearing on television, landing a recurring role in Beggars and Choosers (1999) in 2000 and another on Kevin Hill (2004) before rising to international fame in Mad Men (2007). As well as her more famously conventional awards nominations (Emmys) and wins (SAG Awards) she also won a SyFy Genre Award in for \"Best Special Guest/Television\" for her role as Saffron in Joss Whedon's short-lived Firefly (2002).::IMDb Editors", "trade mark": "Known for playing intelligent and dominating women", "trivia": ["Her character in the television series Firefly (2002) never gave her real name. The three aliases the character used (Yolanda, Saffron, and Bridget) were contracted into the nickname \"Yo-Saf-Bridge\" in the episode Firefly: Trash (2003).", "Born in Knoxville, Tennessee, but raised in Twin Falls, Idaho, since the age of three.", "Although known as a redhead, Hendricks is a natural blonde having dyed her hair since she was 10 years old.", "In 1989, her family moved to Fairfax, Virginia, where she appeared in several high school plays and local community theatre.", "She was a model from the ages of 18 to 27.", "Engaged to Geoffrey Arend [January 2009].", "Always loved redheads like Ginger Grant from Gilligan's Island (1964).", "Dyed her hair because of \"Anne of Green Gables\".", "Ranked #89 in the 2012 FHM list of \"100 Sexiest Women in the World\".", "Ranked #33 in the 2011 FHM Australia list of \"100 Sexiest Women in the World\".", "Ranked #82 in the 2011 FHM list of \"100 Sexiest Women in the World\".", "Ranked as having one of the most \"beautiful famous faces\" by \"The Annual Independent Critics List of the 100 Most Beautiful Famous Faces From Around the World.\" She was ranked #10 in 2010 and #21 in 2009.", "Ranked #87 in Men's Health 100 Hottest Women of All Time (2011).", "Ranked #14 on Askmen's list of the top 99 \"most desirable\" famous women for 2013.", "Lived in Islington, London, England, UK. [1996]", "Her father is originally from England. Her mother, who is American-born, has English, and small amounts of Norwegian and German, ancestry.", "On her wedding day, she and her husband Geoffrey Arend danced to \"The Origin of Love\" from the film Hedwig and the Angry Inch (2001) as their first dance as a married couple.", "Is a fan of British writer-director Richard Curtis.", "(December 13, 2019) Filed for divorce from her husband of 10 years Geoffrey Arend. Hendricks cited \"irreconcilable differences\" in the documents as her reasoning for the split, and listed their date of separation as April 19, 2019.", "Her hand appears on the poster for American Beauty (1999) (the navel belonging to actress Chloe Hunter).", "Wanted to play Wonder Woman and her Drive (2011) director Nicolas Winding Refn wanted to cast her as well.", "Has marionettes and makes crafts.", "Her father is from Birmingham, England.", "She has dual US and UK citizenship."], "filmography": ["Scoob!", "Solar Opposites", "Good Girls (2018-2020)", "Good Girls: Cash Couch", "Toy Story 4", "Henrietta Bulkowski", "Tin Star (2017-2019)", "The Romanoffs", "American Woman", "Candy Jar", "Egg", "The Strangers: Prey at Night", "Robot Chicken", "Pottersville", "Crooked House", "Fist Fight", "Bad Santa 2", "Another Period (2015-2016)", "The Neon Demon", "Hap and Leonard", "Zoolander 2", "Rick and Morty", "Mad Men (2007-2015)", "Dark Places", "Modern Office with Christina Hendricks", "Lost River", "The Pirate Fairy", "God's Pocket", "Ginger & Rosa", "Struck by Lightning", "Need for Speed: The Run", "I Don't Know How She Does It", "The Family Tree", "From Up on Poppy Hill", "Company", "American Dad!", "Drive", "Detachment", "All-Star Superman", "Body of Proof", "Broken Bells: The Ghost Inside", "Life as We Know It", "Leonie", "Life (2007-2008)", "Notes from the Underbelly", "South of Pico", "La cucina", "Jake in Progress", "Las Vegas", "Without a Trace", "Cold Case", "Kevin Hill (2004-2005)", "Tru Calling", "Miss Match", "Firefly (2002-2003)", "Presidio Med", "Hunger Point", "The Big Time", "The Court", "ER", "Thieves", "Beggars and Choosers (2000-2001)", "Angel", "Sorority", "Undressed", "Everclear: One Hit Wonder", "Visa 'Tomorrow Never Dies' Television Commercial"]}