{"name": "Judd Lormand", "current role": "Lawyer", "birth name": " ", "birth date": " ", "birth place": " ", "height": " ", "biography": "Actor Judd Lormand plays the role of Lt. Commander Eric Blackburn each week on CBS's Seal Team series. Recent roles include playing Secretary of State Robert McNamara in the LBJ feature opposite Woody Harrelson in the title role, the uptight bank manager Mr. Freely in the upcoming indie comedy Carter & June, and the corrupt police officer who tries to subdue Tom Cruise in the opening of a the latest Jack Reacher film.Born in Marshall, Texas, Lormand grew up in Houston and spent a number of years in Saudi Arabia, where his father worked as a civil engineer building natural gas pipelines. The family later moved to Lafayette, Louisiana, where Lormand attended Comeaux High School and The University of Louisiana. Lormand credits his high school drama teacher Sandra LaBorde for encouraging his interest in theater arts. Lormand now splits his time between Los Angeles and Atlanta, GA. Between acting assignments Lormand is often busy at home as a father of three, and he delves occasionally into an interest in astronomy.Additional feature credits include: The Hunger Games, Joyful Noise, Pitch Perfect, Snitch, The Last Exorcism Part II, The Hunger Games: Catching Fire, When the Game Stands Tall, 99 Homes, American Heist, Left Behind, Bad Ass 3: Bad Asses on the Bayou, Navy Seals vs. Zombies, The Big Short, Miracles from Heaven, USS Indianapolis: Men of Courage, and The Case for Christ.Additional television series credits include: Memphis Beat, Common Law, Drop Dead Diva, Treme, Revolution, Necessary Roughness, Homeland, The Vampire Diaries, Sleepy Hollow, Ravenswood, Wild Card, Finding Carter, Perception, Satisfaction, Nashville, American Horror Story, Banshee, Secrets and Lies, Zoo, Scream: The TV Series, Devious Maids, NCIS: New Orleans, Star, Lore, and Good Behavior.::Anonymous", "trade mark": " ", "trivia": " ", "filmography": ["SEAL Team (2017-2021)", "The Call", "Texas Cotton", "An Actor Prepares", "Texas Cotton", "Good Behavior", "Lore", "Geostorm", "Naked", "Carter & June", "Camera Obscura", "The Case for Christ", "Star", "NCIS: New Orleans", "The Christmas Swap", "Christmas in Homestead", "Scream: The", "Jack Reacher: Never Go Back", "LBJ", "USS Indianapolis: Men of Courage", "Devious Maids", "Here Comes Rusty", "Miracles from Heaven", "The Big Short", "Navy Seals vs. Zombies", "Zoo", "The Runner", "Secrets and Lies", "Bad Asses on the Bayou", "Zipper", "Banshee", "American Horror Story (2013-2015)", "Nashville", "Left Behind", "American Heist", "Satisfaction", "99 Homes", "The Remaining", "Perception", "When the Game Stands Tall", "Finding Carter", "Wild Card", "13 Sins", "Rage", "Ravenswood", "Sleepy Hollow (2013-2014)", "Grudge Match", "Bonnie & Clyde", "The Vampire Diaries", "Homeland", "The Hunger Games: Catching Fire", "Brother's Keeper", "Devil's Knot", "The Last of Robin Hood", "Necessary Roughness", "Revolution", "Hours", "The Last Exorcism 2", "Standing Up", "Snitch", "Broken City", "Scent of the Missing", "Treme", "Pitch Perfect", "Drop Dead Diva", "Common Law", "The Hunger Games", "Joyful Noise", "Hound Dogs", "Johnny's Gone", "Memphis Beat", "Quarantine 2: Terminal", "Where Strippers Go to Die", "Red Cars"]}