{"name": "Britney Spears", "current role": "Self", "birth name": "Britney Jean Spears", "birth date": "1981-12-02", "birth place": "McComb, Mississippi, USA", "height": "5' 4\" (1.63 m)", "biography": "Britney Jean Spears was born on December 2, 1981 in McComb, Mississippi & raised in Kentwood, Louisiana. As a child, Britney attended dance classes, and she was great at gymnastics, winning many competitions and the like. But, most of all, Britney loved to sing. At age 8, Britney tried out for The All New Mickey Mouse Club (1989), but was turned down due to her young age. This directed her to an off-Broadway show, \"Ruthless\", for a 2-year run as the title character. At age 11, she again tried for The All New Mickey Mouse Club (1989) and, this time, made it as a mouseketeer alongside many stars of today (Justin Timberlake and JC Chasez of *NSYNC and Ryan Gosling). Her big break, however, came when she was signed as a Jive Recording Artist in the late 90s. With the release of her debut album, \"...Baby One More Time\" in early 1999, Britney became an international success, selling 13 million copies of \"Baby\" and 9 million (as of July 2001) of her sophomore album, \"Oops!...I Did It Again\", released in May of 2000.::Matt Zerby", "trade mark": "Shows her midriff during performances", "trivia": ["Attended Parklane Academy, a private school in McComb, Mississippi until October 1994. She was on the girls' basketball team.", "Was offered a role in Scary Movie (2000), but was forced to turn down, due to concert scheduling.", "Younger sister of Bryan Spears and older sister of Jamie Lynn Spears.", "Her idol is Madonna.", "Sister-in-law of Graciella Sanchez & Jamie Watson.", "Studied at NYC's Professional Performing Arts School.", "Lynne Spears & Jamie Spears' oldest daughter.", "First solo artist ever to have a #1 album and single on the Billboard charts at the same time with a debut.", "Worked at a novelty shop before succeeding as a singer.", "One of Teen People magazine's \"21 Hottest Stars Under 21\" (1999).", "Caused a stir with the American Family Association by posing in her underwear on the cover of Rolling Stone (1999).", "Was one of People magazine's 50 Most Beautiful People in the World (1999).", "Ended up as the youngest cast member of The All New Mickey Mouse Club (1989); during the initial audition, she won the role after Jessica Simpson freaked out at the final question during the initial audition.", "Purchased a $1.5-million loft in Greenwich Village, Manhattan, for her brother Bryan Spears (2000).", "Announced that she will attend college and eventually wants to study entertainment law (2000).", "In her first song \"Baby One More Time\", there is a line \"My loneliness is killing me\", and in another of her songs \"Stronger\", there is a line \"My loneliness ain't killing me no more\".", "Is a natural brunette. She often prefers to dye her hair blonde.", "Her flesh-colored outfit at the MTV Video Music Awards created a stir, as it made her look scantily clad. [September 2000]", "Requested that the writers change the lyrics of her song \"Born to Make You Happy\". The original version contained sexually explicit lyrics, and Britney felt she was too young to be singing it.", "Chicago-based DNA Visual Business Solutions filed a lawsuit against her and her marketing companies, including Britney Brands, Inc., claiming that they failed to pay fees due to the web-designing company for helping set up her website, www.britneyspears.com. [October 2000]", "Accepted an endorsement from Pepsi to do TV commercials promoting the soft drink. The first commercial was slated for the 2001 Academy Awards (2001).", "Ranked #2 in the 2001 FHM list of \"100 Sexiest Women in the World\".", "Her video for \"Don't Let Me Be the Last to Know\" features her doing a love scene with a 23-year-old male model. The original cut contained material so sexually explicit that mother Lynne Spears ordered that parts of the video be edited for content before its release to the public in the spring of 2001. [March 2001]", "In her first starring role in the film Crossroads (2002), her character was supposed to swear. She ordered that the curse words be taken out so as not to tarnish her image for the younger pre-teen viewers of the film.", "2001: During the concert \"Rock in Rio\" in Brazil, a tape recorder caught her swearing on a microphone she was not aware was connected. She was complaining about the fact that they were not playing a vamp before she was to go on stage. Tape recordings of the incident were downloaded by Napster users.", "2001: Host of the American Music Awards.", "Two Texas disc jockeys created a panic for her fans when they falsely reported that the pop princess and her boyfriend, *NSYNC's Justin Timberlake, were in a car accident and that she had died in the crash. [June 2001]", "Wrote two books about herself, one with her mother.", "The People for the Ethical Treatment of Animals (PETA) complained to her about the use of four caged cheetahs and a snake for her performance at the 2001 MTV Video Music Awards, claiming that animals trained for performances are mistreated during the training. [September 2001]", "Announced that she aims to raise $2 million from her fall tour earnings to donate to the children of police officers and firemen who died when the World Trade Center collapsed. [September 2001]", "2001: Her deal with Pepsi netted her upwards of $10 million.", "November 11, 1999: She was the big winner at the MTV Europe Music Awards held in Dublin, winning the awards for Best Female, Best Pop, Best Breakthrough Artist, and Best Song for her hit \"...Baby One More Time\".", "2001: Named one of E!'s \"top 20 entertainers of 2001\".", "She was an aerobic instructor at the gym her parents owned.", "2001: Turned down an offer to pose nude for a PETA anti-fur campaign ad.", "2002: Voted one of the \"Fun and Fearless Females\" by Cosmopolitan magazine.", "Though it had been rumored that she would be guesting on the sexually suggestive HBO series Sex and the City (1998), playing the niece of Kim Cattrall's character Samantha Jones, a spokesman for HBO denied the reports, saying no such negotiations ever took place.", "Her Crossroads (2002) co-star Taryn Manning denied reports that she, Spears, and Zoe Saldana did a topless scene that was cut from the final edit of the film. According to her and the film's producer, Ann Carli, the \"flashing\" scene was filmed only from the neck up, and none of the three actresses involved was actually topless during the shoot. [March 2002]", "2002: Arrived an hour late for the British premiere of Crossroads (2002) and snubbed fans who had been waiting for her to arrive.", "2000: Was voted by People magazine as the fourth most influential person of that year.", "2002: Was one of People magazine's 50 Most Beautiful People in the World.", "Ranked #5 in the 2001 FHM Taiwan list of \"100 Sexiest Women in the World\".", "Ranked #2 in the American edition of FHM magazine's Sexiest Girls of 2002 poll. [June 2002]", "Ranked #30 on Maxim magazine's Hot 100 Women of 2003. Placed just ahead of Brittany Murphy and Mya, and behind Rebecca Romijn, Rachel Nichols, Kelly Clarkson and Halle Berry.", "Ranked #2 in the 2003 FHM list of \"100 Sexiest Women in the World\", in front of Carmen Electra and behind top-ranked Halle Berry.", "2003: Ranked #2 in the \"Awesome Multitaskers\" section of Stuff's 125 Sexiest Women of the Year 2003 issue, along with hyphenates Jennifer Love Hewitt, Tyra Banks , Mandy Moore, Beyoncé, Jaime King, Samantha Mumba, Janet Jackson, Estella Warren and Taryn Manning.", "Received a star on the Hollywood Walk of Fame on November 17, 2003. She is tied with Melissa Gilbert for being the youngest person to accept a Walk of Fame star.", "January 3, 2004: \"Taking a joke too far,\" according to a statement released by her label, she married childhood friend Jason Alexander at the Little White Wedding Chapel in Las Vegas, but quickly had it annulled.", "Is a huge fan of Björk.", "She has English, with smaller amounts (to varying degrees) of Maltese, Scottish, Scots-Irish (Northern Irish), Irish, French, and Welsh ancestry. Her maternal grandmother, Lilian Irene Portell, was an English-born war bride. Britney's Maltese ancestry is from one of Lilian Portell's grandfathers, Edward Richard Portelli.", "She finally gained the top spot in the FHM list of \"100 Sexiest Women in the World 2004\", moving up from #2 last year. [May 2004]", "The other understudy for her off-Broadway role in \"Ruthless\" was now famous actress Natalie Portman. The two still keep in touch and met recently through a party in New York City.", "Is good friends with Sarah Michelle Gellar.", "Was ranked #4 on VH1's 100 Hottest Hotties.", "Was considered for a role in Chicago (2002), which went to Lucy Liu.", "2004: Acquired a white Maltese dog named Lacy.", "Was considered for the role of Daisy Duke in The Dukes of Hazzard (2005), which eventually went to Jessica Simpson.", "Is the first woman to have four albums go straight to #1 on the American charts.", "Spring 2004: Had emergency arthroscopic surgery after she injured her knee an the set of her music video \"Outrageous\".", "Her wedding dress was designed by Monique Lhuillier.", "Has a tattoo of a small black-winged fairy on the back of her spine.", "Wrote a \"letter of truth\" to her fans which was published on her official website, telling her fans that she needed to take a hiatus from her career to concentrate on her marriage with her new husband Kevin Federline and start a family with him. The move thus displeased her bosses at Jive Records. She later had two children with Federline before divorcing him.", "2004: Her perfume \"Curious\" was one of the best-selling fragrances of the year.", "Angered the animal rights group PETA for wearing a fur jacket on the cover of her \"Greatest Hits Album: My Prerogative\". She claims she was told it was fake fur. This is the second time PETA has criticized her after she performed on stage with a caged tiger and a snake at the 2001 MTV music awards, after which she apologized and posed for an anti-fur poster.", "2002: Ranked #1 in Stuff magazine's \"102 Sexiest Women in the World\".", "Her name is an anagram of \"Presbyterians\".", "Is mentioned in the songs \"The Real Slim Shady\" by Eminem, \"Riot Girl\" by Good Charlotte, \"Don't Let Me Get Me\" by Pink and \"Party in the U.S.A.\" by Miley Cyrus.", "As of 2010, she is the best-selling female artist of the decade.", "Won her first Grammy Award for Best Dance Recording for \"Toxic\". [February 2005]", "In her music video \"Baby One More Time\", her love interest is played by her cousin.", "The school scenes in her music video \"Baby One More Time\" were filmed in the same place the movie Grease (1978) was shot.", "The man in her Curious fragrance commercial is played by actor Eric Winter of the soap opera Days of Our Lives (1965). [April 2005]", "Spears scored a second Google+ record after becoming the first person to gain more than two-million followers on the site. [February 2012]", "Opened a trendy restaurant on East 41st Street, New York City, called \"Nyla\", which is themed around her home state of Louisiana. [July 2002]", "Good friends with singer Madonna. They made a song together called \"Me Against the Music\". The song is on her album \"In the Zone\".", "Is mentioned in Eminem's song \"The Real Slim Shady\" and is spoofed in the song's music video.", "Shares her birthday with Nelly Furtado, Lucy Liu and Gianni Versace.", "She wrote her song \"Someday\" two weeks before she found out she was pregnant.", "1996, 1997: Elected junior high most beautiful.", "Is the only female artist of the Nielsen Soundscan era to have her first four albums debut at No. 1.", "She was awarded a Star on the Hollywood Walk of Fame for Recording at 6801 Hollywood Boulevard in Hollywood, California on November 17, 2003.", "Likes to wear T-shirts with slogans on them.", "She and Kevin Federline were forced to leave their home in California because a brush fire threatened to destroy it and several other houses in that area (including the one of Will Smith and Jada Pinkett Smith). [October 2005]", "January 11, 2006: Topped the 2005 \"Worst Dressed\" list of fashion critic Richard Selzer (aka Mr. Blackwell) for wearing clothes that he said made her look like an \"over-the-hill Lolita\".", "Loves Betsey Johnson, Bebe, A/X by Giorgio Armani, Rampage, Abercombie & Fitch, Fred Segal, Gap, Victoria's Secret and Urban Outfitters.", "2003: Accompanied Colin Farrell to the American premiere of S.W.A.T. (2003).", "Portrayed as a character in the rock musical \"We Will Rock You\" by Queen and Ben Elton. The role is being played by Colin Charles in London's West End production. [May 2006]", "Was best friends with Christina Aguilera when they performed together on The All New Mickey Mouse Club (1989).", "Lived with her brother in an apartment in New York City for some time.", "Posed nude for the cover of \"Harper's Bazaar\", in a photo similar to Demi Moore's famous September 1991 cover of \"Vanity Fair\". [August 2006]", "2006: Was named most searched name on internet search engine Yahoo!.", "2006: Named \"Most Controversial Celebrity of 2006\" by CNN Headline News for her actions making people discuss about everything from proper parenthood to appearing in public without panties.", "2006: Michael Fredo wrote a song about her called \"Popstar Lovelife (Britney, I Know)\".", "January 10, 2007: After topping the 2005 \"Worst Dressed\" list of fashion critic Richard Selzer (aka \"Mr. Blackwell\"), she shared the #1 spot with Paris Hilton in 2006 for wearing clothes that made them look like \"two peas in an overexposed box\".", "2004: Offered to perform at the Republican National Convention, but was turned down.", "2007: Ranked #12 in Forbes magazine's \"The 20 Richest Women in Entertainment\" list, estimating her net worth at around $100 million.", "After shaving her own head with clippers in a Sherman Oaks (California) hair salon, she visited a tattoo parlor and got several tattoos. Her weird behavior caused worldwide public attention. Some days later, she admitted herself to a California treatment facility, but checked out after less than 24 hours. [February 2007]", "Topped FHM Germany's annual survey searching the \"100 Unsexiest Women in the World\" in 2005 and 2006.", "Manager Larry Rudolph sent her to rehab in early 2007. She fired him. [April 2007]", "April 2, 2007: Crowned the \"April Fool\" (by 76% of all voters) in the \"Most Foolish\" survey of New York publicist Jeff Barge.", "Ranked #8 on VH1's 100 Sexiest Artists.", "Was signed on for a role in a film entitled \"In the Pink\" co-starring comedians Wanda Sykes and Tim Allen, Academy Award winner Cher, and Academy Award nominee Bette Midler. The film was scrapped after years of delay.", "Actress Claudette Lalí was her wardrobe stylist.", "September 27, 2007: Manager Jeff Kwatinetz and her lawyer, Laura Wasser, quit.", "Lost physical custody of her two sons with Kevin Federline due to not having a valid driver's license and failing to take a random drug and alcohol test. Federline has sole custody of the children. [October 2007]", "Her album \"Baby, One More Time\" (1999) has sold 25 million copies worldwide.", "Ranked #19 on Maxim magazine's Hot 100 Women of 2008 list.", "Maddie Aldridge, Ivey Watson & Lexie Spears' aunt.", "After a lengthy custody battle over their sons Preston Federline and Jayden Federline, she and Kevin Federline agreed that he retains sole custody of the children, while she keeps her visitation rights.", "Didn't return to work until 5 months after giving birth to her son, Preston in order to begin recording her fifth studio album, Blackout.", "At age 18, she became the youngest person in the history of Saturday Night Live (1975) to act as a host and the musical guest at the same time on May 13, 2000. She did the same on February 2, 2002 and appeared as the musical guest only on October 18, 2003.", "March 2, 2009: This was announced that she would be the new face of Candie's, taking over from actress Hayden Panettiere.", "Her 2009 world tour, \"The Circus Starring Britney Spears\", became a huge commercial success. The tour's opening show, as well as every show in the two North American legs were sold out, with a total gross of $94 million. The tour also became the highest grossing tour of the year by a solo artist in North America, as well as the fourth overall.", "Her single \"Outrageous\" was chosen as the title track for the film Catwoman (2004), but after she injured her knee shooting the music video for the song, the idea was scrapped. Mis-Teeq's single \"Scandalous\" was chosen as a replacement.", "Her sixth album \"Circus\" debuted at number one on the Billboard 200, making her the youngest female artist in history to have five albums debut at No. 1, thus earning her a place in the Guiness Book of World Records.", "Often works with songwriter Max Martin.", "Her sixth studio album \"Circus\" was released on December 2, 2008, her 27th birthday.", "Her single \"3\" has the shortest title of any song ever reaching No. 1 on the Billboard Hot 100 chart.", "Her single \"3\", from her second greatest hits album \"The Singles Collection\", made her the first artist in over three years to debut at the top position on the Billboard Hot 100 chart, and the only non-American Idol artist in eleven years to do so.", "November 6, 2008: She won two awards at the MTV Europe Music Awards 2008, \"Album of the Year\" for Blackout and \"Act of 2008\".", "In 2009, after years of absence, Forbes magazine listed her as the 13th most powerful celebrity and the second most top-earning young musician as she made $35 million from June 2008 to June 2009.", "Lady Gaga's song, \"Telephone\", was originally written for Spears' sixth album \"Circus\". However, after it failed to make the album's final track listing, Gaga recorded the song as a collaboration with Beyoncé for her second album \"The Fame Monster\".", "Her sixth studio album \"Circus\" which was released in 2008, became her fifth No. 1 album.", "Won a Grammy Award for her hit song \"Toxic\". By 2010, Spears received eight Grammy nominations.", "Britney Spears has sold over 100 million albums world wide, making her one of the best-selling American recording artists.", "December 11, 2009: Billboard magazine named Spears as the second best-selling act of the 2000s.", "Her song \"Womanizer\" gained first-week download sales of 286,000, which is the biggest opening-week tally by a female artist since Nielsen SoundScan began tracking digital downloads in 2003.", "Her song \"Womanizer\" became her fifth No. 1 song on the charts, which put her in a tie for second place for the most No. 1 Top 40 songs in the Mainstream Top 40's sixteen year history. Mariah Carey is in first place with six No. 1 songs.", "As of 2009, Spears has had six No. 1 singles on the European Hot 100 Singles Chart.", "Spears was ranked sixth on Forbes magazine's list of 100 Most Powerful and Influential celebrities in the world (earning more than $64 million in 2009). She is also ranked as the third most powerful musician in the world. [June 2010]", "As of May 2010, Spears became the most popular person on Twitter, with more than 5.2 million followers at that time.", "Her 2009 Circus tour was the fifth highest-grossing tour of the year. According to concert trade publication Pollstar, \"The Circus Starring Britney Spears\" tour grossed more than $130 million.", "According to Forbes magazine, Spears is the third highest earning woman in Hollywood, banking $65 million in 2010. This placed her behind Oprah Winfrey and Beyoncé, but higher than Lady Gaga and Madonna.", "Received a star on the Hollywood Walk of Fame on November 17, 2003, at age 21. She is the youngest music icon to be awarded a star on the Hollywood Walk of Fame.", "Spears was voted as the Number 1 Celebrity You Love of 2010.", "On January 10, 2011, Spears' single \"Hold It Against Me\" set the record for most radio plays in one day in the United States, registering 619 plays on Mediabase and 595 plays on Nielsen Broadcast Data Systems (BDS).", "\"Hold It Against Me\" (January 2011) is Spears' fourth single to debut at No. 1, after her songs \"3\" (2009), \"Womanizer\" (2008) and \"Baby One More Time\" (1999). According to Nielsen SoundScan \"Hold It Against Me\" has also netted 411,000 downloads, which marks the highest first-week tally for a female artist.", "Spears' single \"Hold It Against Me\" (January 2011) made a debut at No. 1. This made her only the second artist in music history to debut more than one song at No. 1, the other artist who managed to do so is Mariah Carey.", "Spears' album \"Femme Fatale\" (2011) became her sixth No. 1 album in the United States. This puts her in a tie with Mariah Carey and Janet Jackson for the third-most No. 1 albums for a female artist, behind Barbra Streisand and Madonna.", "In a 2011 US poll, Spears was voted as the third hottest celebrity mother, behind Halle Berry and Angelina Jolie, but ahead of Salma Hayek, Jennifer Lopez, Jessica Alba and Kate Beckinsale.", "Spears' album \"Femme Fatale\" (2011) was her sixth album to debut at No. 1, this makes her the first female ever to have six No. 1 album debuts. The album also debuted at No. 1 in Canada, Australia and Korea and entered in the Top 10 in 15 other countries.", "Collaborated with Rihanna on a remix of the track \"S&M\", which charted at No. 1 on the Pop songs Billboard chart.", "According to Amplicate, Spears is the Most Loved Pop Star on social media (2011).", "According to a UK poll in 2009, Spears' music video for her song \"Toxic\" was voted as the Sexiest Music Video of All Time.", "Between 2004 and 2010, Spears released nine perfumes which grossed over $2 billion and sold over one billion bottles in just five years. This makes her the No. 1 celebrity perfume endorser of all-time.", "Ranked #25 on Maxim magazine's Hot 100 Women of 2011 list.", "Ranked #4 in FHM magazine's \"Sexiest Women\" list in 2009. Previously, she was ranked #31 in 2008, #54 in 2007, #5 in 2005, #1 in 2004, #3 in 2003, #3 in 2002, #3 in 2001, #2 in 2000, and #16 in 1999.", "Ranked #1 in the 2004 FHM list of \"100 Sexiest Women in the World\".", "Ranked #44 in the 2010 FHM UK list of \"100 Sexiest Women in the World\".", "Launch her 10th fragrance called Cosmic Radiance in August 2011.", "Spears earned her 12th top 10 hit on the Hot 100 Billboard chart with \"I Wanna Go\", the third single from her album \"Femme Fatale\" (2011). It was her fifth consecutive top 10 hit, following her #1 singles \"3\", \"Hold It Against Me\", and her appearance on Rihanna's \"S&M\" remix, while her song \"Till the World Ends\" charted at #3.", "Spears was honored at the 2011 MTV Music Awards. The show paid tribute to Spears and she won two awards - the Michael Jackson Video Vanguard Award and the Best Pop Video Award for her song \"Till the World Ends\". The Video Vanguard Award is also known as the Lifetime Achievement Award. It has previously been given to artists such as David Bowie, The Beatles, Madonna, Michael Jackson, Janet Jackson and U2, among several other artists and music video directors. Spears received the award in 2011, this was handed to her by Lady Gaga.", "When Rihanna asked her Twitter followers which artist they would like to see her collaborate with, the clear answer was Britney Spears. The remix of \"S&M\" became Britney's fifth #1 hit.", "Became the sixth person in Twitter history to reach over 10 million followers on the social networking site (October 2011). The other celebrities who reached 10 million Twitter followers in 2011 are Lady Gaga, Justin Bieber, Katy Perry, President Barack Obama and Kim Kardashian West.", "Is the world's second most searched celebrity in mobile videos, behind Bollywood star Katrina Kaif (2011).", "Was the celebrity spokesperson of Candie's (apparel brand) from 2009-2010.", "Reached over one billion views on her Vevo (YouTube channel) in October 2011.", "Both of her sons were delivered via Caesarean section.", "Britney Spears was Yahoo!'s most popular search term between 2005 and 2008, and has been for several different years. Spears was also named as the Most Searched Person by the Guinness World Records book edition 2007 and 2009.", "Performed live with Michael Jackson in September 2001. Together they performed Jackson's song \"The Way You Make Me Feel\" at the Michael Jackson: 30th Anniversary Special in Madison Square Garden. This was Jackson's last live performance of the song in front of an audience.", "Her inspirations are Madonna, Michael Jackson and Janet Jackson.", "Spears became the youngest female artist in the United States to have five albums debut at No. 1 (after her 2008 album \"Circus\" topped the charts), earning a place in the 2010 Guinness Book of World Records.", "Honoured at the Rock and Roll Hall of Fame. In 2011, there was also an exhibit in the museum honouring women in pop music, the nude rhinestone outfit that Britney Spears wore during her performance at the 2000 MTV Video Music Awards was one of the artifacts on display.", "Spears became the most followed person on Google+ in November 2011. She beat the site co-founder Larry Page from the top position.", "Britney released her first fragrance (Curious) with Elizabeth Arden. The fragrance broke Elizabeth Arden's first-week gross for a perfume, and ended up being the No. 1 fragrance of 2004 in department stores, as well as one of the best-selling perfumes ever. Curious earned over $100 million in sales in the first five weeks after its release. As of 2011, Spears has released 10 perfumes and is considered the number 1 celebrity perfume endorser of all time. [September 2004]", "Her first album \"Baby One More Time\" was released on January 1999, when Spears was 17 years old. It became the best-selling album by a teenager ever. It also led to her first Grammy Award nominations. Her second album \"Oops!... I Did It Again\" (2000) was the fastest selling album by a female artist ever, selling over 1.3 million copies in the first week.", "Was the best-selling teenage artist ever, selling more than 37 million albums worldwide before turning 20 in 2001.", "Is the first person ever to gain one million followers on Google+. [December 2011]", "Engaged to Jason Trawick from December 15, 2011: his 40th birthday to January 11, 2013.", "In a 2011 online Billboard poll, Spears was voted for the 2011 Most Valuable Player award (earning 43% of all votes). She was also the winner of the Best Music Video for \"Till the World Ends\" (45% of all votes) and Best Tour for \"Femme Fatale\" (58% of all votes). Spears also won for Best Awards Show Performance for her collaboration with Rihanna at the Billboard Music Awards in 2011. Spears' song \"Hold it Against Me\" was voted as the second Favorite Hot 100 No. 1 song of 2011, behind \"Rolling in the Deep\" by Adele, and her album \"Femme Fatale\" was voted as the second favorite No. 1 album for 2011.", "Twitter's year end 2011 charts named Spears the #3 most trending topic in music for the year, as her album \"Femme Fatale\" trended for two weeks straight, breaking multiple Twitter records including one of the longest trends of all time. The album title continued to be a trending topic on Twitter even during the Super Bowl.", "Her song \"Till the World Ends\" was named #3 on Billboard's Critics' Choice: 20 Best Singles of 2011.", "Her song \"How I Roll\" was named as the #1 song by Rolling Stone's Top 25 Songs of 2011 list.", "Her song \"Till the World Ends\" was named as #1 on the Top 10 Pop Songs of 2011 list by PopCrunch.", "Ranked #4 in Men's Health magazine's 100 Hottest Women of All Time (2011).", "At the end of 2011 and start of 2012, a few of her unreleased songs were leaked online, including \"Every day\" (a song written by Spears herself), \"Strangest Love\" and \"Look Who's Talking Now\" (written by Spears). An acoustic version of the song \"Don't Keep Me Waiting\" was leaked, while an original version of the song appears as a deluxe edition bonus track on Spears' 2011 album \"Femme Fatale\".", "Has appeared on the cover of Rolling Stone seven times by the year 2011. She was on the cover in: April 1999, May 2000, September 2001, December 2001, October 2003, February 2008 and December 2008.", "Spears was the No. 3 most trended topic overall in Music on Twitter for the year 2011. In January 2012, there were 40 worldwide trending Twitter topics on Britney Spears in five days. Some of the 14 trending topics about Spears include: Britney Is Our Queen, I'm a Slave 4 Britney, Love 2 Love Britney, We Heart Britney, We Just Love Britney, Britney Is Miss American Dream, Venezuela Loves Britney, World Loves Britney, Britney Queen of Pop, and Hot As Britney.", "Her song \"Hold It Against Me\" made Spears the third female artist in history, behind Madonna and Janet Jackson, to top the Hot 100 chart in three decades, as well as the seventh artist overall.", "Has 2 stepchildren: stepdaughter, Kori Federline (b. July 31, 2002) & stepson, Kaleb Jackson Federline (b. July 20, 2004) with ex-husband, Kevin Federline.", "Has 2 sons: Preston Federline (b. September 14, 2005) & Jayden Federline (b. September 12, 2006) with ex-husband, Kevin Federline.", "Was reportedly offered $10 million (the amount was eventually raised to $20 million) to join the second season of Fox's singing competition, The X Factor (2011) (US), as a judge, along with Simon Cowell.", "Was reportedly offered a role in the middle of the third season of Modern Family (2009), but by the time producers heard from her people, they already had the rest of the season planned.", "Named as the \"Sexiest songstress\" by Victoria's Secret What Is Sexy (the Victoria's Secret Angels' Sexiest Celebrities 2012).", "Was the top earning musician of 2012. Despite not releasing an album or going on tour in 2012, Spears earned an estimated $58 million in 12 months according to Forbes. Most of her profits came from her album \"Femme Fatale\" (2011), her perfume line, and her endorsements. This put Spears ahead of fellow top earning pop stars such Rihanna, Lady Gaga, Katy Perry and Taylor Swift.", "Stated in a interview her favorite movies are Ferris Bueller's Day Off (1986) and Forrest Gump (1994). [December 2013]", "Dated Charlie Ebersol from October 2014 to June 2015.", "Was mentioned by Eminem in his songs, We Made You & The Real Slim Shady and by Missy Elliott in her song, Bounce.", "She is mentioned in The Androids \"Do It With Madonna.\".", "Two tracks from the 2001 \"Britney\" album, \"I'm A Slave 4 U\" and \"Boys\", were both originally intended for Janet Jackson's seventh studio album, All for You (2001), with her recording an unreleased demo version of the latter before handing the track to Spears.", "Her likeness was spoofed in the Ratchet & Clank video game series as a robot pop star named Courtney Gears.", "Dating Sam Asghari since November 2016."], "filmography": ["Britney Spears: My Prerogative Commercial", "The Tonight Show Starring Jimmy Fallon", "Britney Spears: Private Show Fragrance", "Britney Spears Catches Kevin Bacon Dancing: Apple Music UK Commercial", "Britney Spears Feat. Tinashe: Slumber Party", "Britney Spears Feat. G-Eazy: Make Me", "Britney Spears Feat. G-Eazy: Make Me", "Jane the Virgin", "Britney Spears & Iggy Azalea: Pretty Girls", "Britney Spears SuperBowl 2015 Commercial", "Britney Spears: Perfume", "Britney Spears: Work Bitch", "Britney Spears: Ooh La La", "Will.I.Am Feat. Britney Spears, Hit Boy, Waka Flocka Flame, Lil Wayne & Diddy: Scream & Shout, Remix", "Britney Spears: Twister Dance Commercial", "Britney Spears: Twister Rave Commercial", "Will.I.Am Feat. Britney Spears: Scream & Shout", "Britney Spears: Fantasy Twist", "Britney Spears MTV VMA 2011 Commercial", "Britney Spears: Criminal", "Britney Spears: I Wanna Go", "Britney Spears: Till the World Ends", "Britney Spears: Hold It Against Me", "Candies: Britney Spears 2010 Commercial", "Glee", "Britney Spears: Radiance", "Britney Spears: Sweet Dreams - Circus Tour Interlude", "Britney Spears & Russell Brand Commercial MTV VMA 2009", "Britney Spears: 3", "Britney Spears: Kill the Lights", "Britney Spears: Radar", "Britney Spears: If U Seek Amy", "Britney Spears: Circus", "Britney Spears: Womanizer", "How I Met Your Mother", "Britney Spears: Break the Ice", "Britney Spears: Piece of Me", "Britney Spears: Gimme More", "Will & Grace", "Britney Spears: Someday", "Britney Spears: Do Somethin'", "Britney Spears: Curious - Hotel Rooms", "Britney Spears: Fantasy", "Britney Spears the Onyx Hotel Tour Commercial, Version 3", "Pepsi Commercial: We Will Rock You", "Britney Spears: My Prerogative", "Britney Spears: Outrageous", "Britney Spears: Everytime", "Britney Spears: Toxic", "Britney Spears 2003 NFL Kickoff Commercial", "Britney Spears Feat. Madonna: Me Against the Music", "Britney Spears: Anticipating", "Britney Spears: I Love Rock 'n' Roll", "Britney Spears: Overprotected, Darkchild Remix", "Britney Spears: Overprotected - Live Version", "Britney Spears: Right Now, Taste the Victory", "Britney Spears GG Tea Commercial", "Britney Spears GG Tea Commercial V.2", "Toyota: Britney Spears Vios Commercial", "Robbie the Reindeer in Legend of the Lost Tribe", "Austin Powers in Goldmember", "Britney Spears Feat. Pharrell Williams: Boys", "Pepsi 400 at Daytona Commercial", "Crossroads", "Britney Spears: Joy of Pepsi", "Britney Spears: Overprotected", "Britney Spears: Pepsi Generation", "Britney Spears: Right Now", "Britney Spears Live from Las Vegas HBO Commercial", "Pepsi Twist", "Britney Spears: I'm Not a Girl, Not Yet a Woman", "All Star Tribute: What's Going On", "Longshot", "Britney Spears: I'm a Slave 4 U", "Britney Spears: Don't Let Me Be the Last to Know", "Britney Spears: Lucky", "Britney Spears: Oops!...I Did It Again", "Britney Spears: Stronger", "People Magazine Britney Spears Commercial", "Eminem: The Real Slim Shady", "The Simpsons", "Britney Spears: Born to Make You Happy", "Britney Spears: From the Bottom of My Broken Heart", "Suki Candy", "Hooves of Fire", "The Famous Jett Jackson", "Kenan & Kel", "Sabrina the Teenage Witch", "Britney Spears: (You Drive Me) Crazy", "Britney Spears: Sometimes", "Britney Spears: ...Baby One More Time", "Bell South: 1995 Commercial", "Maull's: 1993 Commercial"]}